{"author": "Kevin Kelleher", "title": "UPS Begins Using Drones to Transport Medical Samples at North Carolina Hospitals", "description": "UPS and Matternet began using drones to transport medical specimens and blood samples between hospitals at North Carolina's WakeMed.", "url": "http://fortune.com/2019/03/26/ups-matternet-drones-transport-medical-samples-north-carolina-hospitals/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1059360676-e1553642340713.jpg", "publishedAt": "2019-03-26T23:21:37Z", "content": "                                                UPS Begins Using Drones to Transport Medical Samples at North Carolina Hospitals                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Tech      UPS        UPS Begins Using Drones to Transport Medical Samples at North Carolina Hospitals                                            By Kevin Kelleher  March 26, 2019       UPS  said Tuesday it began using unmanned drones to transport medical samples at a North Carolina hospital system, part of its longer-term plan to incorporate drones into its delivery of supplies and samples to medical facilities.  The logistics and delivery giant is partnering with Matternet , a drone-logistics startup, to shuttle medical samples among scattered facilities at WakeMed . The 941-bed hospital system includes three full-service hospitals and other facilities in North Carolina’s Triangle area.  “Currently, the majority of medical samples and specimens are transported across WakeMed’s expanding health system by courier cars,” UPS said in a statement. “The addition of drone transport provides an option for on-demand and same-day delivery, the ability to avoid roadway delays, increase medical delivery efficiency, lower costs and improve the patient experience with potentially life-saving benefits.”    The drone deliveries that began Tuesday are part of a pilot program that the Federal Aviation Administration launched last August to test practical applications of drones and analyze how they could be used safely to speed deliveries and reduce costs. UPS and Matternet are also working with North Carolina’s Department of Transportation to conduct the drone flights.  “Today’s flight marks the beginning of numerous planned daily revenue flights at the WakeMed Raleigh campus,” UPS said.  During the program, WakeMed medical workers will load drones with medical specimens such as a blood sample and send it flying along predetermined flight paths to WakeMed’s central pathology labs, all while monitored by remote drone pilots. Data from those flights will help the companies work on similar drone logistics projects at other hospitals.  UPS has previously partnered with Zipline to deliver blood products to remote locations in Rwanda. Matternet has built an autonomous drone network in Switzerland that delivered blood tests and other samples between medical facilities there.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}