{"author": "Raja Abdulrahim", "title": "Iran Moves to Cement Its Influence in Syria", "description": "On the heels of an Iranian military intervention that has helped bring President Bashar al-Assad to the edge of victory in Syria’s eight-year-long war, Tehran is moving to cement its long-term influence in Syria by cultivating goodwill and winning converts to the Shiite Muslim sect.", "url": "https://www.wsj.com/articles/iran-moves-to-cement-its-influence-in-syria-11553632926?mod=hp_lead_pos5", "urlToImage": "https://si.wsj.net/public/resources/images/B3-DN591_SYRIA__TOP_20190326140604.jpg", "publishedAt": "2019-03-26T20:42:00Z", "content": "                                                 <![endif]-->    Dow Jones, a News Corp company News Corp is a network of leading companies in the worlds of diversified media, news, education, and information services Dow Jones Barron's BigCharts DJX Dow Jones Newswires Factiva Financial News Mansion Global MarketWatch NewsPlus Private Markets Risk & Compliance WSJ Conference WSJ Pro WSJ Video WSJ.com News Corp Big Decisions Business Spectator Checkout51 Harper Collins Housing Makaan New York Post News America Marketing PropTiger REA realtor.com Storyful The Australian The Sun The Times Unruly Subscribe Sign In The Wall Street Journal U.S. Edition U.S. Asia Europe India 中国 (China) 日本 (Japan) March 27, 2019 Print Edition Video Home World Regions Africa Asia Canada China Europe Latin America Middle East Sections Economy More World Video U.S. Sections Economy Law New York Politics Columns & Blogs Real Time Economics Washington Wire More Journal Report U.S. Video What's News Podcast Politics Blogs Washington Wire More Politics Video WSJ/NBC News Poll Economy Blogs Real Time Economics WSJ Pro Bankruptcy Central Banking Private Equity Venture Capital More Economic Forecasting Survey Economy Video Business Sections Management Tech/WSJ.D The Future of Everything Industries Aerospace & Defense Autos & Transportation Commercial Real Estate Consumer Products Energy Entrepreneurship Financial Services Food & Services Health Care Hospitality Law Manufacturing Media & Marketing Natural Resources Retail C-Suite CFO Journal CIO Journal CMO Today Logistics Report Risk & Compliance Columns Heard on the Street WSJ Pro Artificial Intelligence Bankruptcy Central Banking Private Equity Venture Capital More Business Video Journal Report Business Podcast Tech Sections CIO Journal The Future of Everything Columns & Blogs Christopher Mims Joanna Stern David Pierce More Billion Dollar Startup Club Tech Video Tech Podcast Startup Stock Tracker Markets Sections Bonds Commercial Real Estate Commodities & Futures Stocks Your Money Columns & Blogs Heard on the Street MoneyBeat Wealth Adviser Market Data Market Data Home U.S. Stocks Currencies Commodities Bonds & Rates Mutual Funds & ETFs More CFO Journal Journal Report Markets Video Your Money Briefing Podcast Secrets of Wealthy Women Podcast Search Quotes and Companies Opinion Columnists Sadanand Dhume James Freeman William A. Galston Daniel Henninger Holman W. Jenkins Andy Kessler William McGurn Walter Russell Mead Peggy Noonan Mary Anastasia O'Grady Jason Riley Joseph Sternberg Kimberley A. Strassel Reviews Books Film Television Theater Art Masterpiece Series Music Dance Opera Exhibition Cultural Commentary More Editorials Commentary Letters to the Editor The Weekend Interview Potomac Watch Podcast Foreign Edition Podcast Opinion Video Notable & Quotable Best of the Web Newsletter Morning Editorial Report Newsletter Life & Arts Sections Arts Books Cars Food & Drink Health Ideas Real Estate Science Sports Style & Fashion Travel More WSJ. Magazine WSJ Puzzles The Future of Everything Far & Away Life Video Arts Video Real Estate Sections Commercial Real Estate House of the Day More Real Estate Video WSJ. Magazine Sections Fashion Art & Design Travel Food Culture Search Search →                                 Share  Text  51                World      Middle East       Iran Moves to Cement Its Influence in Syria  Tehran uses cash, food and public services in a hearts and minds campaign to cultivate loyalty, draw military recruits and win converts to the Shiite Muslim sect               U.S.-backed forces in Syria have expelled Islamic State from its last outpost, but jihadist fighters are still active in the region. Here’s what might follow the demise of the so-called caliphate. Photo: Reuters       By   Raja Abdulrahim and   Raja Abdulrahim  The Wall Street Journal  Biography Raja Abdulrahim  @RajaAbdulrahim  raja.abdulrahim@wsj.com     Benoit Faucon    Benoit Faucon  The Wall Street Journal  Biography Benoit Faucon  @benoitfaucon  benoit.faucon@wsj.com     March 26, 2019 4:42 p.m. ET       MUHAYMIDA, Syria—In Islamic State’s former eastern Syrian stronghold, the Islamic Republic of Iran is parlaying its military and economic might into a lasting foothold.  On the heels of an Iranian military intervention that has helped bring President Bashar al-Assad to the edge of victory in Syria’s eight-year-long war, Tehran is moving to cement its long-term influence in Syria by cultivating goodwill and winning converts to the Shiite Muslim sect. ...     To Read the Full Story   Subscribe  Sign In                           Most Popular Videos          How to Decide Which iPad to Buy         Why Mueller’s Full Report May Never Be Public          What a U.S.-China Trade Deal Might Look Like           How Robert Mueller’s Russia Investigation Unfolded           President Trump Reacts to Barr’s Summary of Mueller Report        Most Popular Articles          Opinion: Mueller Exposes Spy Chiefs          Opinion: A Catastrophic Media Failure          Prosecutors Drop All Charges Against Actor Jussie Smollett          How Colin Kaepernick’s Lawyer Dealt With Nike and Became Entangled in Extortion Charges          A Decade After the Housing Bust, the Exurbs Are Back                           Popular on WSJ          Most Popular Videos           How to Decide Which iPad to Buy           Why Mueller’s Full Report May Never Be Public           What a U.S.-China Trade Deal Might Look Like           How Robert Mueller’s Russia Investigation Unfolded           President Trump Reacts to Barr’s Summary of Mueller Report        Most Popular Articles          Opinion: Mueller Exposes Spy Chiefs          Opinion: A Catastrophic Media Failure          Prosecutors Drop All Charges Against Actor Jussie Smollett          How Colin Kaepernick’s Lawyer Dealt With Nike and Became Entangled in Extortion Charges          A Decade After the Housing Bust, the Exurbs Are Back                               The Wall Street Journal U.S. Edition U.S. Asia Europe India 中国 (China) 日本 (Japan) Subscribe Now Sign In Back to Top « WSJ Membership WSJ+ Membership Benefits Digital Subscription Print Subscription Print and Digital Subscription Why Subscribe? Corporate Subscriptions Professor Journal Student Journal WSJ Amenity Program Customer Service Customer Center Contact Us Tools & Features Emails & Alerts Guides My News RSS Feeds Video Center Watchlist Podcasts Ads Advertise Commercial Real Estate Ads Place a Classified Ad Sell Your Business Sell Your Home Recruitment & Career Ads More About the Newsroom Content Partnerships Corrections Jobs at WSJ Masthead News Archive Register for Free Reprints Buy Issues Facebook Twitter Instagram YouTube Podcasts Snapchat Google Play App Store Dow Jones Products Barron's BigCharts Dow Jones Newswires Factiva Financial News Mansion Global MarketWatch Private Markets realtor.com Risk & Compliance WSJ Conference WSJ Pro Central Banking WSJ Video WSJ Wine Privacy Policy Cookie Policy Copyright Policy Data Policy Subscriber Agreement & Terms of Use Your Ad Choices Copyright ©2019 Dow Jones & Company , Inc. All Rights Reserved.                    ", "category": "business"}