{"author": "Laura Stampler", "title": "Massive Airport Computer Outage Led to Bad Morning for American, JetBlue, Alaska Airlines Flyers", "description": "Airports across the country had computer outages due to Sabre's \"system issue\", which assists American, JetBlue, and Alaska Airlines.", "url": "http://fortune.com/2019/03/26/sabre-computer-system-airline-outage-jetblue-american/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/alaska-e1553630041388.jpg", "publishedAt": "2019-03-26T19:54:08Z", "content": "                                                Massive Airport Computer Outage Led to Bad Morning for American, JetBlue, Alaska Airlines Flyers                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Briefing      Airports        Massive Airport Computer Outage Led to Bad Morning for American, JetBlue, Alaska Airlines Flyers                                                      An Alaska Airlines airplane passes by the skyline of lower Manhattan in New York City as it heads to a gate at Newark Liberty Airport on January 21, 2019 in Newark, New Jersey. (Photo by Gary Hershorn/Getty Images)  Gary Hershorn Corbis via Getty Images        By Laura Stampler  3:54 PM EDT       Even TSA pre-check couldn’t help flyers avoid massive lines and delays at airports across the U.S. Tuesday morning due to a major—albeit temporary—computer outage impacting JetBlue, American, and Alaska Airlines that left passengers and gate attendants alike unable to check into flights and access online information.  Sabre, a Texas-based tech company that provides support to the aforementioned airlines, took responsibility and apologized for the since-resolved technological glitch in an early afternoon tweet , noting it “experienced a system issue that impacted some customers.”  Although the company didn’t specify the cause of the malfunction, or how long it lasted, some airlines began fielding customers’ concerned tweets about being unable to access the companies’ websites beginning around 9 a.m. ET.  But the issue appeared to really come to a head two hours later, when a larger volume of passengers noted that they were unable to board their flights due to a system crash. Pictures from Boston Logan Airport to Seattle’s SeaTac Airport to Fort Lauderdale showed crowds of passengers and agents alike having difficulty checking in.        Standing in a huge line at Logan airport… @JetBlue ‘s entire system is down and no one can check in…not even the agents! pic.twitter.com/SuZ8CiC84V  — Greg Nelson (@gnels) March 26, 2019         @JetBlue the systems down n nobody can’t check in get boarding passes nothin 🤔 wats da hold up . I’m tryna get on a quick lil Vacay… pic.twitter.com/ZLsO00MOY3  — Robby Anderson (@youngamazing9) March 26, 2019      “Gate agents are asking if ‘ANYONE’ has a paper boarding pass,” a delayed passenger tweeted .      @JetBlue is there an issue with the app? Can’t check in at kiosk either. Been waiting in line with many others and not getting any updates. Check-in isn’t moving and gate agents are asking if “ANYONE” has a paper boarding pas.  — Eric Robinson (@emikerob) March 26, 2019       Sabre, which didn’t immediately respond to Fortune’s request for comment, acknowledged the issue in an 11:56 a.m. tweet , although Newsweek  reports that the problem had already been resolved for some airlines by then.  “Technical teams were immediately engaged,” Sabre tweeted an hour later. “Systems have recovered and customers are reporting normal operations. We apologize for the inconvenience to those affected.”  Individual airlines were quick to note that the issue was with an outside source’s system.  “Earlier today, Sabre had a brief technical issue that impacted multiple carriers, including American Airlines ,” an airline spokesperson told Fortune via email. “This technical issue has been resolved. We apologize to our customers for the inconvenience.”  JetBlue also apologized to those who were impacted by the technical problem, telling Fortune , “All functions have been restored following a temporary outage of Sabre’s systems that impacted multiple airlines.”  Sabre doesn’t exclusively work with airlines.  In 2016, the company made headlines due to a massive data breach of its hotel reservation system— serving 32,000 properties including Trump Hotels—that compromised consumers’ credit card numbers and security codes.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}