{"author": "Renae Reints", "title": "Senate Judiciary Committee Holds Gun Control Hearing on Red Flag Laws", "description": "The scheduled hearing comes in the days after three people affected by the Parkland or Sandy Hook mass shootings died in apparent suicides.", "url": "http://fortune.com/2019/03/26/red-flag-laws-senate-gun-control/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/suicide-e1553629725453.jpg", "publishedAt": "2019-03-26T19:49:13Z", "content": "                                                Senate Judiciary Committee Holds Gun Control Hearing on Red Flag Laws                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Briefing      gun control        Senate Judiciary Committee Holds Gun Control Hearing on Red Flag Laws                                            By Renae Reints  3:49 PM EDT       The Senate Judiciary Committee held a hearing on gun control regulation known as red flag laws Tuesday, following a week in which three people from communities affected by a mass shooting died in apparent suicides.  Red flag laws—also called extreme risk protection orders—allow law enforcement or civilians to petition a judge to have firearms removed from the possession of someone who they believe is at risk of harming themselves or others. The individual has the opportunity to protest the order. If it’s enacted, however, they may not purchase or posses a firearm for a minimum of 180 days.  Fourteen states plus D.C. already have some form of red flag laws on the books, and other states have considered similar legislation.  Tuesday’s scheduled meeting allowed the Judiciary Committee to hear from a sheriff, a gun control advocate, a research director and law professor, a firearms prosecutor, and a representative from the National Alliance on Mental Illness.    Those in favor of red flag laws state the regulation can prevent violence, particularly suicides. Those in opposition argue that unless the law addresses the value of the second amendment and provides for due process, it can be used to disarm innocent people.  The hearing comes as the public is becoming increasingly aware of the trauma caused by mass shootings. Over the past week, two Parkland students and a father whose six-year-old daughter died in the Sandy Hook shooting each died in apparent suicides .  Red flag laws provide a temporary solution to those who family or friends may believe are a danger to themselves or others. The regulation has support from both sides of the isle: Sen. Lindsay Graham (R-SC) co-sponsored legislation with Sen. Richard Blumenthal (D-CT) proposing federal red flag laws after the 2018 Parkland school shooting, but it was unsuccessful. Sen. Marco Rubio re-introduced bipartisan legislation on red flag laws earlier this year, and the White House as shown support for such preventative laws as well.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}