{"author": "Sy Mukherjee", "title": "How Medicare for All Could Eliminate the $600 Billion Private Insurance Industry", "description": "Nearly every Democrat running for President supports a version of universal health care. That has insurance companies on edge.", "url": "http://fortune.com/2019/03/25/medicare-for-all-eliminate-private-insurance/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/bra_04_01_19-medicare-for-all.jpg", "publishedAt": "2019-03-25T12:00:06Z", "content": "                                                How Medicare for All Could Eliminate the $600 Billion Private Insurance Industry                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Magazine      Health Care        How Medicare for All Could Eliminate the $600 Billion Private Insurance Industry                                            By Sy Mukherjee  March 25, 2019       The 2020 election is coming. And health insurers are worried.  A groundswell of support for Medicare for All among prominent Democratic presidential contenders has spooked the industry, with some candidates professing the private health insurance sector may (and even should) eventually be tossed into the dustbin of history.  Sen. Bernie Sanders—author of a comprehensive Medicare for All bill—has never shied away from a fight with large corporations, and universal health care has long been one of his hobbyhorses. But candidates occupying a more centrist space in the Democratic Party, such as Sens. Kamala Harris, Kirsten Gillibrand, and Cory Booker, have all cosponsored Sanders’s legislation.        The bulk of the Sanders bill would be paid for by a 7.5% payroll tax on employers and 4% from workers’ paychecks. The current system of Medicare and Medicaid would be scrapped and replaced with a significantly more generous program. Everyone in the United States would be covered, no opt in or out.    The big catch: You’d lose your current employer plan. “The Medicare for All bills proposed by Sanders … would effectively eliminate the role of private health insurance providers,” Larry Levitt, senior vice president for health reform at the nonpartisan Kaiser Family Foundation, told Fortune in an interview. “The idea of eliminating an industry and companies that are this large is unprecedented.”  Under the plan, private insurers would be banned from competing with government coverage, relegating them to the role of selling supplemental insurance—table scraps compared with the $600 billion feast that private insurance is today.  Democratic politicians are finding themselves increasingly comfortable with that situation. Harris told CNN’s Jake Tapper, “Let’s eliminate all of that,” referring to the insurance industry (she later softened her stance). Gillibrand has called it an “urgent goal.”              Gillibrand & Harris: Chip Somodevilla—Getty Images; Sanders: Win McNamee—Getty Images      Wall Street is taking that possibility seriously. The S&P 500 Managed Health Care Index, comprising many health insurance stocks, fell 10% between Feb. 26, when House Democrats introduced their own Medicare for All legislation, and March 7. By comparison, the index was up nearly 15% in the 12 months preceding the bill’s introduction.    It’s hard to overstate the magnitude of such an overhaul. UnitedHealth was ranked fifth on the 2018 Fortune 500 list, grossing more than $226 billion last year; Anthem and Aetna (premerger with CVS) were both in the top 50. Those three companies alone employed more than 364,000 people in 2017.  The prospect of all of that simply vanishing has the industry preparing for a fight. Last year the nation’s largest hospital, pharmaceutical, insurance, and doctors’ lobbying groups formed the Partnership for America’s Health Care Future (PAHCF), an organization dedicated to market-based health care reforms—and pushing back on the specter of Medicare for All.  “We want to build upon the system that’s working and fix what’s wrong,” Lauren Crawford Shaver, PAHCF’s executive director, told Fortune in an interview. “In many of these Medicare for All proposals, it’s very unclear what they actually want to do. They’re looking to start all over. Why not pause for a second and improve what we have?” Shaver points to polls showing that Americans’ support of Medicare for All, which is 71% if told it would guarantee health care as a right, falls to 37% when told it would eliminate private health insurance.    Subscribe to Fortune’s Brainstorm Health newsletter for daily analysis of the health care industry.  But insurers for the most part haven’t offered up a whole lot of suggestions for fixing the current private system and feel little need to, according to KFF’s Levitt. “Right now, I’d expect health insurers to just trash the idea of Medicare for All without offering an alternative,” he said.  That could be a miscalculation. The cost of private insurance has been rising consistently , and employers have increasingly shifted costs onto their workers—while wages have largely not kept pace.  Those financial realities and the frustrating, jigsaw nature of U.S. health care are fueling the enthusiasm for Medicare for All.  The Sanders bill has a zero probability of passing before 2021. But in a scenario where Democrats win the White House and total control of Congress in 2020 (and nix the Senate filibuster), it’s not in the realm of fantasy that some form of Medicare for All could pass.    Falling short, Democratic leaders would still be likely to push for expanded access to Medicare (by lowering the enrollment age to 55, for example).  If insurers can’t offer a compelling alternative to calm the swell, they could soon find themselves fighting against an industry-drowning tide.  A version of this article appears in the April 2019 issue of Fortune with the headline “Eradicating a $600 Billion Industry.”                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}