{"author": "Graham Rapier", "title": "The CEO of Careem explains why Uber had no choice but to buy out the Middle East rival", "description": "Careem's founder explained to Business Insider why it would be so hard to a Western company to succeed in the region.", "url": "https://www.businessinsider.com/careem-ceo-interview-why-uber-had-to-acquire-rival-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a615386d56e7502753241-960-480.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Careem's CEO ribbed Uber for making a rookie error in the Middle East. Now Uber's paying $3.1 billion to buy it.        Graham Rapier  7h                                                         Mudassir Sheikha, cofounder and CEO of Careem.  S3studio/Getty Images          Uber is buying Careem , its major rival in the Middle East, for $3.1 billion. For Uber, it's a way to buy dominance in a fiercely competitive region. Careem has built a moat to keep out Western competition, founder and CEO Mudassir Sheikha told Business Insider in a recent interview. Just weeks ahead of its highly anticipated initial public offering, Uber announced a $3.1 billion deal to acquire one of its largest rivals in the Middle East, Careem . While Careem will remain an independent brand, Uber will acquire key insights and technology that the company has developed over the past seven years. Founder and CEO Mudassir Sheikha told Business Insider in February that the moat carved out by Careem would be hard for a Western company to easily overcome. Sheikha said that certain things that Western companies take for granted — like ubiquitous credit cards or even Google Maps — don't always exist in the countries where Careem operates. \"We not only had to build mapping infrastructure, we had to build our own places database because Google was not complete nor reliable,\" Sheikha said. \"Neighborhood by neighborhood we have actually gone into our cities and mapped every building, every villa, and every shopping mall in order to provide an accurate location for pickups and drop-offs.\" Read more : Careem has mapped 45,000 miles of road in its bid to compete on a global stage Cash is still king in the Middle East, but simply accepting hard currency in exchange for rides is more complicated than it might seem. \"Cash might seem like a simple option in the app, but to enable it at scale required a lot of work,\" Sheikha said. The company assigns credit limits to captains (its term for drivers on the platform) based on their driving history on the platform. Those limits decide how much cash one driver can collect before having to deposit the company's cut. Careem's algorithm can then prioritize credit-card trips to let the accounting work out commissions. Drivers can also arrange a rendezvous to move cash, in a move that could foreshadow Careem's plans to enter the payments and remittances space, a huge industry in the region. Given Careem's experience pioneering ride-hailing services in the region, it makes sense why Uber would want to buy out the company rather than try to compete with it. \"For a global player to come in and start providing a service to the top 2% to 3% of the population is not difficult, they're used to the convenience,\" Sheikha said. \"But as soon as you start going down the masses, you require a lot of tailoring.\" For example, \"it took Uber almost 2 years to realize that very few people in this region have a credit card,\" he said. \"That's a very basic thing. It's 101 in this region.\" In an email to Uber employees late Wednesday, CEO Dara Khosrowshahi said Sheikha and his cofounder are \"first-class entrepreneurs\" with a truly extraordinary product. \"Over time, by integrating parts of our networks, we can operate more efficiently, achieve even lower wait times, expand new products like high-capacity vehicles and payments, and quicken the already remarkable pace of innovation in the region\" he said of the acquisition. \"It's a great day for the Middle East, for the region's thriving tech sector, for Careem, and for Uber.\"  This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content.      SEE ALSO:  Uber’s biggest competitor in the Middle East says it has mapped 45,000 miles of road in its bid to compete on a global stage      NOW WATCH: People are watching YouTubers study for hours and they say the popular trend helps them stay focused         More:  Careem  Uber  ride-hailing  BITranspo      Prime  BI Prime                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}