{"author": "Kate Rooney", "title": "These are the stock sectors you want to buy when the bond market is flashing a recession signal", "description": "The bond market is flashing a recession warning but that could bode well for certain sectors.", "url": "https://www.cnbc.com/2019/03/26/stock-sectors-to-buy-when-bond-market-is-flashing-a-recession-signal.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/26/105814827-1553608520813gettyimages-1137624915.1910x1000.jpeg", "publishedAt": "2019-03-26T14:57:19Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Markets     Pre-Mkt    US    EU    China    Asia    World    FX    Cryptocurrency    Commodities    Bonds    ETF Markets      These are the industries you want to buy when the bond market is flashing a recession signal    Last week, the U.S. yield curve inverted for the first time since 2006. That move is historically a signal of recession ahead. The last seven times the yield curve inverted for 3-month and 10-year bonds, excluding a 2 week inversion in 1998, the US economy went into recession every single time within 15 months, according to data from Credit Suisse. Certain sectors outperform in this environment. Three months after the inversion, insurance and industrial stocks tend to do the best, while defensive stocks tend to outperform 12 months after.      Kate Rooney | @Kr00ney   Published 5 Hours Ago  Updated  1 Hour Ago  CNBC.com              Spencer Platt | Getty Images Traders work on the floor of the New York Stock Exchange (NYSE) in New York City.   The bond market is flashing a recession warning. But certain stock sectors may still hold up.   On Friday, the U.S. yield curve \" inverted \" — meaning the yield on the 3-month Treasury rose above the yield on the 10-year note. Historically, this means a recession is on the horizon.  The last seven times the yield curve inverted, excluding a 2-week inversion in 1998, the U.S. economy went into recession every single time within 15 months, according to data from Credit Suisse.   \"Historically investors have often tried to come up with reasons for why things are different this time around and have often been proven wrong,\" Credit Suisse research analyst Andrew Garthwaite said in a note to clients Tuesday.  Stocks may still have a bit more room to run until they take a hit. Six months after the yield curve inverts is typically when stocks peak, Garthwaite said. During the three months after an inversion, the S&P 500 rose by an average 4 percent, and was up 75 percent of the time. But on a longer time horizon — 18 months out — the S&P was down an average 8 percent, and up only 38 percent of the time.  Still, certain sectors do better than others in that environment. In the first three months after the inversion, insurance and industrial stocks show the strongest median out-performance. Semiconductors and consumer durables are historically the biggest laggards.  One year after the yield curve inverts, though, there's a more definite split. Defensive stocks like healthcare equipment, pharmaceuticals and insurance historically outperform in the 12 months after the yield curve inverts. A defensive stock is something that has constant demand for products and isn't typically correlated to the rest of the business cycle. They tend to kick back a consistent dividend and relatively stable earnings regardless of stock market conditions.  More \"cyclical\" stocks, which do rely on market conditions, tend to underperform, according to Credit Suisse. Autos and technology hardware are among the laggards 12 months after the yield curve inverts.            Kate Rooney Markets Reporter                                      html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}