{"author": "Berkeley Lovelace Jr.", "title": "OxyContin-maker Purdue Pharma and Sackler family agree to pay $270 million to settle Oklahoma state opioid case", "description": "The case against Purdue and other manufacturers was scheduled to go to trial in May. Accusations against the Stamford, Connecticut-based company included downplaying the addiction risk of opioids while overstating the benefits.", "url": "https://www.cnbc.com/2019/03/26/purdue-pharma-and-sackler-family-agree-to-pay-270-million-in-opioid-case.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/06/103917663-GettyImages-563590877.1910x1000.jpg", "publishedAt": "2019-03-26T18:44:27Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Health and Science     Biotech and Pharma    Health Insurance    Hospitals    Science      OxyContin-maker Purdue Pharma and Sackler family agree to pay $270 million to settle Oklahoma state opioid case    OxyContin maker Purdue Pharma and its owners, the Sackler family, have agreed to pay $270 million to the state of Oklahoma. As a part of the agreement, unveiled Tuesday, Purdue will contribute $102.5 million to fund the creation of a National Center for Addiction Studies at Oklahoma State University.      Berkeley Lovelace Jr. | @BerkeleyJr   Published 1 Hour Ago  Updated  47 Mins Ago  CNBC.com                show chapters               Here's the Sackler family's statement on Purdue Pharma's $270 million settlement with Oklahoma   1 Hour Ago |  00:59        OxyContin maker Purdue Pharma and its owners, the Sackler family, have agreed to pay $270 million to the state of Oklahoma to settle a lawsuit accusing the drugmaker of ruthlessly marketing and misleading the public about the dangers of its highly addictive narcotic.   The case against Purdue and other manufacturers was scheduled to go to trial in May. Accusations against the Stamford, Connecticut-based company included downplaying the addiction risk of opioids while overstating the benefits.  The company previously denied any wrongdoing, saying labels for its painkiller carried warnings about the risk of abuse and misuse associated with the drugs.   At a news conference Tuesday confirming the settlement, Oklahoma Attorney General Mike Hunter said he intends to \"hold accountable other defendants ... for their role in creating the worst public health crisis in our state and nation we've ever seen.\"  The settlement is just \"the first step,\" he added.  As a part of the agreement, unveiled Tuesday, Purdue will contribute $102.5 million to fund the creation of a National Center for Addiction Studies at Oklahoma State University. The company will also donate $20 million worth of medicines to support the center's treatment mission.  The agreement, which resolves all of the state's claims against Purdue, also includes an additional payment of $72.5 million, of which $12.5 million will be available to counties and cities in the state to abate the effects of the opioid crisis, the company said.  The Sacklers, who were not named as defendants in the lawsuit, will contribute $75 million toward the university center as well, Purdue added.  \"Purdue is very pleased to have reached an agreement with Oklahoma that will help those who are battling addiction now and in the future,\" Purdue Pharma CEO Craig Landau said in a statement. \"We applaud Attorney General Mike Hunter for his leadership in making such an agreement possible.\"  OxyContin is a prescription drug used to treat moderate to severe pain in adults. From 1999 to 2017, nearly 218,000 people have died in the United States from overdoses related to prescription opioids, according to the U.S. Centers for Disease Control and Prevention. OxyContin first came on the market in 1996.  The settlement Tuesday may take some pressure off Purdue, which has been considering bankruptcy protection.  Earlier this month, Landau said the company was considering bankruptcy to protect its assets against thousands of lawsuits for its alleged role in the opioid epidemic. Purdue was founded in the 1950s by brothers Arthur, Mortimer and Raymond Sackler.  --AP contributed to this report.           Berkeley Lovelace Jr. Reporter                                         To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}