{"author": "Kevin Jacques", "title": "Jerome Powell Is Right—We Should Be Worried About Low Inflation", "description": "As recently emphasized by Federal Reserve Chairman Jerome Powell, there are numerous problems associated with low inflation.", "url": "http://fortune.com/2019/03/26/federal-reserve-powell-low-inflation/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/j-powell-e1553624662420.jpg", "publishedAt": "2019-03-26T19:38:12Z", "content": "                                                Jerome Powell Is Right—We Should Be Worried About Low Inflation                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Commentary      inflation rates        Jerome Powell Is Right—We Should Be Worried About Low Inflation                                            By Kevin Jacques  3:38 PM EDT       The Federal Reserve announced last week that there is no plan for a rate hike this year due to slower economic growth. In a press conference held that same afternoon, Fed Chairman Jerome Powell added that “[i]t may be some time before the outlook for jobs and inflation calls clearly for a change in policy.” But perhaps what was most striking about Powell’s characterization of the problems and persistence of low inflation outlined during those remarks was his statement that low inflation is “one of the major challenges of our time.”  While persistent inflation under 2% is a relatively new phenomenon—having only begun in the aftermath of the Great Recession—it’s not just an issue for Federal Reserve policymakers. For economic agents such as businesses, laborers, savers, and investors, persistently low inflation is also problematic because it brings with it a number of potential consequences that influence economic well-being.    First, low inflation may be symptomatic of a slowdown in the economy—a question both financial markets and policymakers struggle with when assessing whether or not a recession is forthcoming. In turn, an economic slowdown can bring with it slower job growth or a rise in the unemployment rate.  Second, low inflation can limit the effectiveness of monetary policy. Historically, when the economy is weak or in a recession, the Federal Reserve may reduce the federal funds rate to try to stimulate the economy. Recent examples include the Federal Reserve lowering the federal funds rate in response to the 2001 recession and the September 11 terrorist attacks. Using zero as a lower bound for interest rates, if inflation is low then the Federal Reserve is limited in how far it can drop rates. As a result, expansionary monetary policy may require more nontraditional tools—such as quantitative easing—to stimulate the economy. And while these nontraditional tools may be effective, policymakers have considerably less experience in their use.   Third, low inflation can be harmful to banks. Banks make income, in part, by the interest rate spread—the difference between the rates they pay to acquire funds (deposits, for example) and the rate they charge on loans. Banks pay relatively low interest rates on deposits, all the while charging significantly higher interest rates on loans. With low inflation that spread shrinks which can negatively impact bank profitability. A healthy and profitable banking system is important to the economy as banks move funds from savers and investors to borrowers (such as homebuyers and businesses). This process, called financial intermediation, is important to the health and well-being of not only financial markets, but the growth of the economy as a whole.  Finally, if inflation becomes negative—then it’s deflation. Persistent deflation causes a whole host of economic problems as consumers reduce spending, businesses cut back on output, unemployment rises, and investors see a decline in the value of their real and financial assets. While rare historically (the last time was during the Great Depression), persistent deflation increases the likelihood of a severe recession.    To make matters worse, part of the problem of low inflation is that traditional economics and economic policy, for decades concerned with high inflation, have until recently given too little attention to the issue of low inflation. This is not surprising: During the late 1970s and the early 1980s, for instance, the U.S. economy experienced inflation rates over 10%. As a result, policymakers and economic researchers focused on how to quickly bring such high inflation rates down rather than the possibility that inflation could become too low.  Powell was correct when he characterized persistently low inflation as one of the most challenging economic issues of our time. In part, understanding the problems caused by low inflation helps address the other challenges Powell highlighted, such as sustaining the U.S.’s economic expansion. Now, economic research and policy must continue to evolve and find the most effective ways to address those problems.  Kevin Jacques is the Boynton D. Murch Chair in Finance at Baldwin Wallace University in Berea, Ohio, and a former senior economist at the U.S. Department of the Treasury.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}