{"author": "Jacob Pramuk", "title": "House fails to override Trump's veto on bill that would have blocked his national emergency", "description": "But Democrats could not get enough GOP lawmakers to back the measure to override Trump's veto and block his national emergency declaration.", "url": "https://www.cnbc.com/2019/03/26/house-cant-override-trump-veto-on-border-wall-emergency-declaration.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/11/26/105592428-1543239708671rts27jbq.1910x1000.jpg", "publishedAt": "2019-03-26T18:02:45Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Politics     White House    Policy    Defense    Congress    Elections    Europe    China    Asia    World      House fails to override Trump's veto on bill that would have blocked his national emergency    The House fails to override President Donald Trump's veto of a measure that would have ended the president's national emergency declaration at the southern U.S. border. Fourteen House Republicans support the measure, but it was not enough to reach a two-thirds majority.      Jacob Pramuk | @jacobpramuk   Published 2 Hours Ago  Updated  24 Mins Ago  CNBC.com                show chapters               House votes against overriding Trump's border emergency veto   2 Hours Ago |  00:48        House Democrats' attempt to override President Donald Trump 's first veto failed Tuesday, leaving the president's national emergency declaration in place for now.   The chamber fell short of the two-thirds majority needed to overcome the president's opposition to a resolution that would end his executive action. Only 14 Republicans joined with Democrats in voting to override the veto in a 248-181 vote — one more GOP representative than when the House passed the measure last month.  In a joint statement, House Speaker Nancy Pelosi and Rep. Joaquin Castro, a Texas Democrat who authored the resolution, said the congressional votes would \"provide significant evidence for the courts as they review lawsuits\" challenging the move to secure money for the president's proposed border wall. They signaled the House would vote again on ending the national emergency in six months, which lawmakers can do as long as it is in effect.   \"The President's lawless emergency declaration clearly violates the Congress's exclusive power of the purse, and Congress will work through the appropriations and defense authorization processes to terminate this dangerous action and restore our constitutional system of balance of powers,\" they said following the vote. \"In six months, the Congress will have another opportunity to put a stop to this President's wrongdoing. We will continue to review all options to protect our Constitution and our Democracy from the President's assault.\"       Al Drago | Bloomberg | Getty Images U.S. House Speaker Nancy Pelosi, a Democrat from California, speaks to members of the media while departing a House Democratic Caucus meeting on Capitol Hill in Washington, D.C., U.S., on Tuesday, March 26, 2019.   Last month, Trump declared a national emergency to divert money already approved by Congress to the construction of barriers on the U.S.-Mexico border. Democrats and some Republicans worried about Trump circumventing the legislature's appropriations power after lawmakers passed only about $1.4 billion of the $5.7 billion the president sought for structures.  Both the House and Senate previously passed the legislation to block the emergency declaration with bipartisan support.  Trump hopes to use the declaration to secure $3.6 billion of the $8 billion total he wants to put toward barriers on the border. It would come from the Defense Department's military construction budget. The president has argued he has the full authority to divert the funds.  Though Congress cannot terminate the emergency declaration for now, Trump's action still will face its share of scrutiny. Numerous states and outside groups have filed lawsuits challenging the declaration.  Lawsuits have in part cited Trump's own words last month, when he said \"I didn't need to do this\" to get border wall funding, \"but I'd rather do it much faster.\"  After acting Defense Secretary Patrick Shanahan said Monday that the Pentagon would move $1 billion away from military construction projects to build the border wall, House Armed Services Committee Chairman Rep. Adam Smith, D-Wa., denied the move. He said his committee had not approved it.  It still may go through, as the Pentagon will argue it has the authority to use the funds.  Trump also requested $8.6 billion for border wall construction in his fiscal 2020 budget, which could spark yet another standoff with Democrats over his signature campaign promise .  Subscribe to CNBC on YouTube.          Jacob Pramuk Staff Reporter                                         To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}