{"author": "Chris Morris", "title": "'Empire' Star Jussie Smollett Has All Charges Against Him Dropped", "description": "The Illinois state attorney's office dropped all criminal charges against \"Empire\" actor Jussie Smollett Tuesday.", "url": "http://fortune.com/2019/03/26/jussie-smollett-charges-dropped/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1130398805-e1553613882195.jpg", "publishedAt": "2019-03-26T15:57:42Z", "content": "                                                'Empire' Star Jussie Smollett Has All Charges Against Him Dropped                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Entertainment      Jussie Smollett        'Empire' Star Jussie Smollett Has All Charges Against Him Dropped                                            By Chris Morris  11:57 AM EDT       The twisting case of the attack on Empire actor Jussie Smollett took an unexpected turn Tuesday, as Illinois officials dropped all criminal charges against the actor.  “We believe this outcome is a just disposition and appropriate resolution to this case,” said one Cook County prosecutor in announcing the dismissal, according to The Chicago Tribune .  Smollett had been charged with 16 different criminal counts after being accused of staging a racist and homophobic attack against him. Officials on Feb. 21 said he both faked a letter using racist and homophobic language, mailing it to the Chicago studio where Empire is filmed, and paid $3,500 to two Nigerian brothers to stage the attack. Police said Smollett staged the attack because he was dissatisfied with his salary .    He pleaded not guilty to the charges.  An unscheduled emergency hearing was held Tuesday morning, before the charges were dropped. The judge also granted a motion to seal the case.  The sealing of the case by the judge will likely only add to the mystery surrounding the events. Smollett’s attorney, Patricia Brown Holmes, said the actor did not reach a deal with prosecutors. However, he did agree to forfeit his $100,000 bond “so he could go on with his life and get this over with.” In doing so, it essentially means Smollett surrendered $10,000 (the 10% of the bond he personally posted) that normally would be returned to him.  “Jussie and many others were hurt by these unfair and unwarranted actions,” Smollett’s attorneys said in a statement. “This entire situation is a reminder that there should never be an attempt to prove a case in the court of public opinion. That is wrong. It is a reminder that a victim, in this case Jussie, deserves dignity and respect. Dismissal of charges against the victim in this case was the only just result. Jussie is relieved to have this situation behind him and is very much looking forward to getting back to focusing on his family, friends and career.”   Smollett has said he was attacked when he went to buy food late at night in downtown Chicago, adding that one attacker told him “this is MAGA country”. Initially, he received a wave of support, but suspicions began to grow when police could find no video footage of the attack.  After he was charged, Fox removed Smollett from the final episodes of Empire ‘s fifth season, saying “Jussie has been an important member of our Empire family for the past five years and we care about him deeply. While these allegations are very disturbing, we are placing our trust in the legal system as the process plays out.”  The network has not commented further on his future on the show.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}