{"author": "Kevin Kelleher", "title": "Boeing Fires Employee Responsible for Hanging a Noose in a South Carolina Factory", "description": "Boeing (BA) investigated the hanging of a noose in a South Carolina plant manufacturing Dreamliner 787s and fired the person responsible.", "url": "http://fortune.com/2019/03/26/boeing-fires-employee-noose-south-carolina-plant/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1129882264-e1553640625757.jpg", "publishedAt": "2019-03-26T22:51:44Z", "content": "                                                Boeing Fires Employee Responsible for Hanging a Noose in a South Carolina Factory                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Briefing      Boeing        Boeing Fires Employee Responsible for Hanging a Noose in a South Carolina Factory                                            By Kevin Kelleher  March 26, 2019       Boeing fired an employee Tuesday after claiming the worker was responsible for hanging a noose in a South Caroline manufacturing facility, TV station WCSC reported .  In late February, Boeing said it was investigating a nylon, one-foot noose that was found hanging in a Charleston, S.C., plant that manufactures its 787 Dreamliner aircraft. The noose was first reported by a CBS transportation reporter, who confirmed the investigation on Twitter.      #breaking  @weareboeingsc confirms a noose was found at Charleston plant that builds the 787. “I am saddened and angered that a racially-charged symbol was discovered on site…there is absolutely no place for racism and these cowardly acts” VP Brad Zaback wrote in msg to staff.  — Kris Van Cleave (@krisvancleave) March 1, 2019       “We have completed a thorough review of the matter and identified the responsible person,” Brad Zaback, vice president and general manager of Boeing’s 787 program said in a letter to the plant’s employees Tuesday. “This individual’s actions are a violation of our company’s values and behaviors, and as a result this individual is no longer with the company.”  Nooses have appeared in several U.S. workplaces in recent years. In January, workers at General Motors  sued the company to address nooses hung in a Toledo, Ohio, plant along with swastikas and racist slogans scrawled in the facility’s restrooms. Earlier this month, UPS workers at a Ohio distribution hub also sued their employer over racist behavior at the site, including the hanging of a noose and a Confederate flag.   The firing at Boeing comes as the aerospace giant weathers a crisis involving its Max 737 planes, two of which have crashed in the last six months, one in Indonesia and another in Egypt. Both planes appear to have been affected by a software program that pushed the plane’s nose downward during flights. Many airlines have grounded their 373 Max planes, with some cancelling orders for new Boeing airplanes.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}