{"author": "Rob Price", "title": "Apple will have to stomach big losses for a long time in order to succeed with its Hollywood push", "description": "Hollywood is nothing like Silicon Valley. Apple needs to realize that.", "url": "https://www.businessinsider.com/apple-tv-plus-needs-burn-cash-lose-succeed-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a76898e436a73893e81bc-1334-667.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Apple will have to stomach big losses for a long time in order to succeed with its Hollywood push        Rob Price  5h                                                         Apple CEO Tim Cook at the Steve Jobs Theater during an event to announce new products Monday, March 25, 2019, in Cupertino, California.  AP Photo/Tony Avelar                     Apple must be prepared to shoulder huge losses to succeed in the TV business. On Monday, the tech giant announced Apple TV Plus, its entry into the streaming TV market. The company is used to enjoying huge profits on the sales of the iPhone, its star product — but entertainment is very different. Apple needs to have the appetite to spend enormous sums for years — without generating much revenue in return — to make a dent in showbiz. It's official: Apple is going to Hollywood. But if it's going to survive, it needs to realise that Tinseltown is nothing like Silicon Valley. On Tuesday, the Cupertino technology giant held a glitzy event to formally announce its long-awaited video-streaming service, Apple TV Plus. When it launches, it will offer subscribers original content, including TV shows, movies and documentaries — and it has some of the biggest names in showbiz on board, from Steven Spielberg to Oprah Winfrey and JJ Abrams. But it's also going up against long-established players like HBO and Netflix, and will need to adopt a totally new approach to doing business if it wants to make Apple TV Plus a long-term success. Apple's business, at present, is heavily dependent on the ongoing success of the iPhone. It's the world's most popular smartphone, and is a money-printing machine of staggering proportions. Apple enjoys quarterly profits of $20 billion , largely off the back of the ongoing success of iPhone. Every device sold means hundreds of dollars in profit for Apple, which stands in stark contrast to the razor-thin margins in much of the rest of the smartphone business. The media business is not going to be the same immediate cash-generating success for Apple. It is facing the necessity of enormous outlays to procure top tier talent and produce new video content from scratch, with no guarantee of success. Apple TV Plus may be in the red for years before it hits a critical mass of users to make it sustainable on its own merits. Such profligate spending is necessary because without the content there in the first place, users simply won't pay to sign up. You wouldn't sign up for a paid streaming service with only three shows and a dozen movies — there needs to be a key level of content before the entire enterprise even becomes viable. That means burning cash lots of cash. Apple has some key strengths going into this: Hundreds of millions of users, and bucketloads of moolah. Morgan Stanley weighs in As Morgan Stanley analysts wrote in a research note to clients on Tuesday: \"Apple enters the content publishing business with two distinct strengths — a global user base and a massive checkbook. In our view, these two factors alone mean investors and competitors should take it seriously.\" As such, the determining factor in Apple's success may not be whether it can afford to persevere, but rather whether it has the stomach to do so — if that means subsidizing unprecedented losses in an uncertain new business vertical until it builds the \"content tonnage needed\" to achieve scale,\" wrote the analysts. Morgan Stanley points to the volume of cash Netflix had to go through to reach its position of strength: \"From 2012 to 2021, when we estimated Netflix turns [free cash flow] positive, we estimate it will have burned nearly $13bn of [free cash flow to achieve this feat ... Netflix has benefited from a long bull market and fairly easy access to capital. Does Apple have the appetite to spend its way to success?\"  This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content.      NOW WATCH: People are weirdly obsessed with these videos of a girl mixing paint         More:  Apple  Apple TV Plus  BI Prime                                      Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}