{"author": "David Meyer", "title": "In a New Blow to Boeing, Rival Airbus Sells 300 Planes to China", "description": "Airbus is selling 300 aircraft to China. Most are A320s—the planes that compete against Boeing's grounded 737 Max 8s.", "url": "http://fortune.com/2019/03/26/china-airbus-order-boeing/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1132871236.jpg", "publishedAt": "2019-03-26T10:38:57Z", "content": "                                                In a New Blow to Boeing, Rival Airbus Sells 300 Planes to China                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Travel      China        In a New Blow to Boeing, Rival Airbus Sells 300 Planes to China                                            By David Meyer  March 26, 2019       As Boeing flounders, Airbus thrives—the European plane manufacturer has just sold another 300 jets to Chinese airlines.  The deal was signed Monday as Chinese President Xi Jinping visited France’s Emmanuel Macron in Paris. No value was announced, but the pre-discount list price for the order is roughly $35 billion . Airbus’s shares rose more than 2% on the news.  “We are honored to support the growth of China’s civil aviation with our leading aircraft families–single-aisle and widebodies,” said Airbus commercial aircraft chief Guillaume Faury, who will become CEO next month. “Our expanding footprint in China demonstrates our lasting confidence in the Chinese market and our long-term commitment to China and our partners.”  Almost all the planes—290 of the 300—are in Airbus’s single-aisle A320 family. This is the line with which Boeing was scrambling to compete when it developed its 737 Max 8 aircraft, which have been grounded around the world in the wake of two deadly crashes. Boeing’s planes are still parked while the company readies a software fix for the automated flight control issue that may have caused the accidents in Indonesia and Ethiopia.    China was among the first countries to order the Max 8’s grounding, and it is reportedly considering cutting new 737 Max planes from the list of American products it would buy under a trade deal with the U.S.  The value of the French deal also provides some interesting perspective regarding Italy’s recent Belt and Road agreement with China, struck as Xi visited Rome a couple days ago. Belt and Road is China’s attempt to create a successor to the Silk Road trade routes of old, but critics see it as a tool of expansionism. This past weekend, Italy became the first G7 country to sign up.  The export-driven Italian agreement was worth less than $3 billion—though the Italian government claims it could end up being worth over $22 billion—and it leaves Italy open to criticism from other Western European countries that it will become overly dependent on China.   Macron, a big Belt and Road critic, turned his reception of Xi into a show of European unity by inviting German Chancellor Angela Merkel and European Commission President Jean-Claude Juncker to join in on Tuesday talks. “Europe must be united and have a coherent message. That’s what we are doing on strategic investments,” he said in a joint address with his Chinese counterpart.  In total, China and France agreed deals with a value of around $45 billion, covering areas such as shipping, banking and renewable energy—and all outside the framework of the Belt and Road Initiative.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}