{"author": "Lauren Hirsch", "title": "Bed, Bath & Beyond should be the perfect stock for an activist, here's why it's not", "description": "The under-the-radar investors, and the limited size of their bets, indicates the unclear path to salvation for Bed, Bath & Beyond. Nearly every product the company sells, from linens to towels to cookware can be found online, yet the retailer only began to make all of its merchandise online within the past few years.", "url": "https://www.cnbc.com/2019/03/26/bed-bath-beyond-has-been-a-puzzle-others-have-passed-on-solving.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/17/104222775-GettyImages-489625368.1910x1000.jpg", "publishedAt": "2019-03-26T18:31:58Z", "content": "                                                         html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Retail     Apparel    Discounters    Department Stores    E-Commerce    Food and Beverage    Restaurants    Household Products      Many have looked at buying Bed, Bath & Beyond. So far, all have passed    Three little-known activists are pushing for change at Bed, Bath & Beyond, including a full board turnover. Multiple private equity firms have considered, but opted against, buying Bed, Bath, people said. At least one prominent activist investor has looked at and passed on pushing for change at Bed, Bath, a person familiar said.      Lauren Hirsch   Published 2 Hours Ago  Updated  1 Hour Ago  CNBC.com              Andrew Harrer | Bloomberg | Getty Images Shoppers walk past a Bed Bath & Beyond store in Washington, D.C.   A well-known company in the beaten up retail sector with shares that have fallen nearly 80 percent since an all-time high in 2015 should be bait for activist investors. It's the ideal duo of the sex appeal of a recognizable name and affordability granted by an out-of-favor industry.   But for Bed, Bath & Beyond , the hunter ended up being three little-known activist investors who, combined, cobbled up less than 5 percent stake. Investors Legion Partners Asset Management, Macellum Advisors and Ancora Advisors on Tuesday confirmed their stake in the retailer and list of demands. They want a full turnover of the retailer's board and for it to consider the sale of some of its smaller brands.  Legion's other recent campaigns include settlements with cloud communications provider Vonage Holdings , Playtex-owner Edgewell Personal Care and weight loss program Nutrisystem.   The under-the-radar investors, and limited size of their bets, indicates the unclear path to salvation Bed, Bath currently has in its reach.  Its industry challenges are significant. Nearly every product the company sells, from linens to towels to cookware can be found online. Almost nothing is branded unique to the retailer, meaning nothing is proprietary. It has a nearly 1,000-store footprint, but analysts have dinged many as cluttered and dirty.  A sale to a private equity firm would be difficult to finance.  Bed, Bath shares have a market value of $2.37 billion, after Tuesday's gains. A trail of bankrupt leveraged buyouts from Toys R Us to Gymboree has made both lenders and buyers nearly allergic when it comes to retail. Those challenges were most recently highlighted when struggling video game retailer Gamestop called off its own sale process earlier this year. Its market value is about half of Bed, Bath's, at $1.05 billion.  Multiple private equity firms having considered acquisitions of Bed, Bath over the past few years, people tell CNBC, but no deal has transpired. In 2015, private equity firm Leonard Green & Partners built a stake in the company, a toehold that did not ultimately lead to a deal, despite some investor expectations that it would. The company's stock has steadily declined as expectations of a sale have waned. Over the past year, shares have fallen 19 percent, including Tuesday's stock pop.  Meantime, selling some of Bed Bath's pieces, like Buy Buy Baby, which sells baby gear like cribs and strollers, and Cost Plus World Market, which sells discount home decor and gift items, is also difficult. The retail units work together, giving them stronger purchasing power with its suppliers. Breaking the businesses apart risks reducing some of that leverage.  The retailer also does not break out the units' performances in their annual filings, making it difficult to know how well they are performing.  As result of these challenges, at least one prominent activist investor has looked at and passed on pushing for change at Bed, Bath, a person familiar said.  Still, the three activist firms have pounced loudly. They are pushing for the rare turnover of the entirety of Bed, Bath's board. Its slate includes executives who have presided over similarly challenged retailers such as Alexander Smith, who served as CEO of home furnishings retailer Pier 1 Imports from February 2007 until December 2016.  While at Pier 1, Smith improved the company's gross margins by 1,200 basis points in the five years between 2007 and 2012. Still shares of the company rose by only 26 percent while he was CEO, compared to the S&P 500 , which grew 54.8 percent. The retailer is currently working with law firm Kirkland & Ellis on restructuring advice, a person familiar tells CNBC. Kirkland's role with Pier 1 was first reported by Reuters.  Other nominees include Janet Grover, the former corporate vice chairman of Macy's; Victor Herrero Amigo, the former CEO of Guess and John Fleming, the former head of global e-commerce at Uniqlo.  Same-store sales have declined for the past seven quarters, and some analysts say there is a case to be made that the company has been mismanaged. The average director tenure is approximately 19 years, according to the activists. Analysts have called management's lack of transparency, like its limited approach to breaking out financials, \"irritating.\"  The activists called out what they say is \"excessive executive compensation\" despite \"chronic underperformance.\" From fiscal 2015 to 2017, CEO Steven Temares received $51 million in awarded compensation related to performance despite a 70 percent decline in the company's stock, they say.  The retailer has been slow to keep pace with the evolution in the industry. While Amazon and Walmart have been investing in e-commerce for years, Bed, Bath only began to make all of its merchandise online within the past few years.  In an email to its employees Tuesday obtained by CNBC, Bed, Bath CEO Temares highlighted the company's planned and completed initiatives to usher in its turnaround. They include data-driven personalized marketing, improved merchandise and a new, more efficient operating structure in its buying group. Bed, Bath plans to roll out roughly 40 \"working labs\" where it is testing various initiatives, like different assortments and product layouts. It is actively evaluating its store leases.  It is also focusing on profitability rather than sales growth by changing \"free shipping\" requirements and eliminating its less profitable goods. The company this past quarter reported earnings of 18 cents per share . It has said it expects fiscal 2019 earnings per share will be about the same fiscal 2018.  \"In fiscal year 2019, our transformation will become even more visible to our customers,\" Temares wrote.  —CNBC's   Tom Franck   contributed to this report           Lauren Hirsch Retail Reporter for CNBC.com    Related Securities      Symbol  Price    Change  %Change      WMT   ---      AMZN   ---      S&P 500   ---      PIR   ---      GME   ---      BBBY   ---      EPC   ---      VG   ---                                            html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}