{"author": "Michael Sheetz", "title": "NASA and the White House want billions so companies will compete to build human moon landers", "description": "In a potential boon for companies like SpaceX and Blue Origin, NASA is asking for $363 million next year to accelerate a program to build spacecraft to take humans to and from the moon.", "url": "https://www.cnbc.com/2019/03/26/nasa-moon-landing-acsc-commercial-competition-to-build-human-landers.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/06/104931701-GettyImages-514080638.1910x1000.jpg", "publishedAt": "2019-03-26T19:29:14Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Investing in Space   NASA and the White House want billions so companies will compete to build human moon landers    A NASA program called Advanced Cislunar and Surface Capabilities (ACSC) is key to the White House's goal of putting humans on the surface of the moon. NASA estimates the budget for ACSC would grow to $2.4 billion by fiscal year 2024. The huge increase in this year's budget request for ACSC is the result of an internal battle at NASA, a person familiar with the situation told CNBC.      Michael Sheetz | @thesheetztweetz   Published 1 Hour Ago  CNBC.com              Bettmann | Getty Images   In a potential boon for private space companies like Elon Musk's SpaceX and Jeff Bezos' Blue Origin, NASA is asking Congress for billions of dollars over the next five years to speed the development spacecraft capable of flying humans to and from the moon.   NASA requested $363 million for fiscal year 2020 for the Advanced Cislunar and Surface Capabilities (ACSC) program, more than double what the space agency sought last year. More importantly, NASA estimates the budget for the program would grow to $2.4 billion by fiscal year 2024, as the agency begins to award companies with development contracts.         The huge increase in this year's budget request for ACSC is the result of an internal battle at NASA, a person familiar with the situation told CNBC on Monday. This year's introduction of a competitive bidding process means that companies would build their own spacecraft, with help from competitive NASA funding awards, rather than build a NASA-specific spacecraft.   NASA didn't respond to CNBC requests for comment.  After the establishment of the National Space Council, President Donald Trump's administration looked to work with the growing private space sector on multiple NASA programs. A main directive was to create a sustained U.S. presence on the moon. NASA would first send robots to the surface without crews, later following up with astronauts.  Recently appointed NASA administrator Jim Bridenstine supported a White House plan last year to make ACSC a competitive process between companies, two people familiar with the matter told CNBC. But some NASA leaders rejected the idea, wanting to stick with the development of an in-house lunar lander project, one of the people said.  Known as the \"Flexible Lunar Explorer\" (or FLEx) lander concept, some at NASA wanted a system built for the agency, rather than according to the companies building the spacecraft. This is NASA's traditional method of awarding contracts, exemplified by the Boeing -built Space Launch System (SLS) rocket – which is now years behind and racking up billions of dollars in cost overruns.  With delays in the SLS program, privately-built rockets are being increasingly considered to launch NASA missions. And now, despite internal hesitancy, NASA is considering commercial alternatives for getting astronauts to the moon's surface. The agency has spoken to companies about enabling \"regular access to the lunar surface,\" NASA said in its budget request earlier this month.  The increased funding for ACSC also matches with statements Vice President Mike Pence made on Tuesday at a National Space Council meeting. Pence said it is the White House policy \"to return American astronauts to the moon within the next five years.\" Although he said the SLS rocket must be accelerated to do so, he urged NASA to reach the moon \"by any means necessary.\"  \"We're not committed to any one contractor. If our current contractors can't meet this objective, then we'll find ones that will,\" Pence said. \"If American industry can provide critical commercial services without government development then we'll buy them.\"  Musk welcomed Pence's comments, saying in a tweet that \"it would be so inspiring for humanity to see humanity return to the moon!\"     More competition driving cheaper spaceflight   The budget request said ACSC would look at acquisition opportunities through public-private partnerships. In essence, this would structure the ACSC financial awards and development process in a competitive structure. Or, as Pence put it, buying the services rather than developing them in-house.  In the past decade, NASA's commercial cargo and commercial crew have enabled the agency to buy flights to the International Space Station at competitive prices. After providing development awards, NASA has bought flights from SpaceX, Northrop Grumman -owned Orbital Sciences and Boeing .  In the case of the Commercial Crew program, NASA officials said a recent critical flight test of SpaceX's Crew Dragon capsule \"did better than expected.\" Although delayed in development, many in the space industry point to the Commercial Crew program as another example of how private companies can fulfill government needs that used to be kept fully in-house. Once flight tests are complete, NASA will fly astronauts on SpaceX's capsule at a price of $58 million a seat (less than the $81 million a seat it costs NASA to fly astronauts on Russian Soyuz rockets).  As Trump's budget request has yet to be finalized, the details of ACSC may still change. Moreover, the earliest ACSC funding would not be awarded until late 2020, NASA's request said.  How NASA expects to shift funds so heavily to ACSC also remains in question. When asked by reporters, NASA's deputy CFO Andrew Hunter said there were \"some out-year assumptions\" of funds for the International Space Station in 2023 and 2024 that NASA will re-examine. Additionally, NASA senior budget analyst Brian Dewhurst said the \"lunar gateway\" program \"will largely be done in its development phase by that point, and so we'll be taking those dollars.\"           Michael Sheetz Markets and Space Reporter    Related Securities      Symbol  Price    Change  %Change      NOC   ---      BA   ---                                            html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}