{"author": "Diana Olick", "title": "Want to sell your home? Hurry up and list it next week", "description": "Timing is everything, especially in a housing market that has been less than dependable lately. So if you want to get the best price for your home in the shortest amount of time, you'd better list it next week, at least according to realtor.com.", "url": "https://www.cnbc.com/2019/03/26/want-to-sell-your-home-hurry-up-and-list-it-next-week.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/08/28/105420567-1535476842005gettyimages-1020749918.1910x1000.jpeg", "publishedAt": "2019-03-26T17:10:39Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Real Estate     Commercial Real Estate    Construction    Housing    Mortgages    REITs    Rising Risks      Want to sell your home? Hurry up and list it next week    Homes listed in the first week of April get 14 percent more online views on average and are likely to sell 6 days faster on average than the rest of the year. The number of buyers jumps dramatically in April, but the number of listings doesn't peak until a little later, so there is less seller competition. The average rate on the 30-year fixed mortgage has fallen more than a quarter of a percentage point in the last week and is nearly a full percentage point lower than the recent peak last November      Diana Olick | @DianaOlick   Published 9 Hours Ago  CNBC.com              Daniel Acker | Bloomberg | Getty Images Prospective homebuyers in Dunlap, Illinois.   Timing is everything, especially in a housing market that has been less than dependable lately. So if you want to get the best price for your home in the shortest amount of time, you'd better list it next week, at least according to realtor.com.   Homes listed in the first week of April get 14 percent more online views on average and are likely to sell six days faster than the average during the rest of the year.  Homes sold in April are also priced 6 percent higher than those in January. According to the most recent pricing data, that could mean an additional $17,000 for sellers listing the typical home prices around $306,000. One caveat is that realtor.com is looking at average prices and does not take into account the type of homes for sale at different times of year. Larger, more expensive homes tend to be listed in the spring because families like to move over the summer, during school vacations.   \"Given the time it takes from listing to close, putting a home on the market in early April positions sellers to attract buyers seeking to close and move before the beginning of school year,\" said Danielle Hale, chief economist for realtor.com.  The number of buyers jumps dramatically in April, but the number of listings doesn't peak until a little later, so there is less seller competition. The average list price in June is higher than April, again as larger family homes are being listed during school vacations, but there are fewer buyers, which increases the chance for a price reduction, although not by much. Homes listed in June are 1 percent more likely to see a price reduction and garner 2 percent fewer online views on average than the rest of the year.  If next week was already a great week to list, the steep drop in mortgage rates that started last week is only making it better. Buyers now have a little bit more purchasing power. The average rate on the 30-year fixed mortgage has fallen more than a quarter of a percentage point in the last week and is nearly a full point lower than the recent peak last November. Every quarter-point drop knocks about $50 off the monthly payment on a $300,000 mortgage.  Of course all real estate is local, and locality can impact timing. The best time to list in New York, Chicago and Dallas is March 31, according to realtor.com. In Atlanta and Seattle, it's April 7. In Los Angeles and Boston, it's April 14. In Phoenix and Tampa, it's early June.  And not everyone agrees. Researchers at Zillow, a competitor of realtor.com, claim the first two weeks in May are the best nationally. They add that homes listed on Saturdays get the most page views, although most real estate agents will tell you Thursday is when most people are trolling online, planning their weekend house hunts.  \"Sellers time their listings to optimize their sale in all sorts of ways,\" said Skylar Olsen, Zillow's director of economic research and outreach. \"Some need to time the sale just right to manage their own synchronized home purchase. Others are seeking to get the highest sale price possible.\"          Diana Olick CNBC Real Estate Reporter                                      html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}