{"author": "Kif Leswing", "title": "Apple's new credit card holds a lot of promise, but read the fine print before signing up", "description": "The new Apple Card will have a variable interest rate, and will probably be available to people with only fair credit scores. While it has no fees attached, there are new fees for the Apple Pay", "url": "https://www.cnbc.com/2019/03/26/apple-credit-card-read-the-fine-print.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/25/105812944-1553535496776screen-shot-2019-03-25-at-1.37.13-pm.1910x1000.jpg", "publishedAt": "2019-03-26T18:41:50Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Tech     Cybersecurity    Enterprise    Internet    Media    Mobile    Social Media    Venture Capital    Tech Guide      Apple's new credit card holds a lot of promise, but read the fine print before signing up    Apple's new credit card will have a wide range of APR rates, suggesting that it could be available even to people with fair or middling credit, experts said. For people with good credit scores, Apple's card may offer a low interest rate. While Apple's card won't have any printed numbers on it, increasing security, that's not the most common kind of credit card scam.      Kif Leswing | @kifleswing   Published 1 Hour Ago  Updated  49 Mins Ago  CNBC.com              Bloomberg | Getty Images   Apple announced a new credit card issued in conjunction with Goldman Sachs at a launch event at its campus on Monday. Apple is promoting it as a simpler credit card, with no fees, powerful integration with iPhone spending tools and attractive rewards when customers use Apple Pay, Apple's digital wallet.   But the company glossed over many critical details, including interest rates and who will qualify. In fact, people with bad credit might not even be eligible for Apple Card.  CNBC read through the fine print and asked some experts to weigh in. Here's what you need to know.      High variable APR   Like other credit cards, the Apple Card has a high interest rate for people who carry a balance. Apple said that users will pay an APR between 13.24% and 24.24%, based on individual credit scores.  That's a wider range than most cards have, CreditCards.com industry analyst Ted Rossman said.  For people with great credit scores, Apple could be a good deal.  \"On the low end, meaning people with better credit, Apple's interest rate is significantly lower than the national average,\" which was 17.67% , according to a CreditCards.com survey.  The high-end rate suggests that Apple will make its card widely available, but will significantly raise rates for people with bad credit, Rossman suggested.  \"I think people in the low to mid-600 range will probably quality for the card,\" Rossman said. \"If your score is so low you're probably not going to get any cards at all. But among people who can get cards, I think this card will be pretty widely available.\"         show chapters               Apple reveals Apple Card digital credit card   1:42  PM ET Mon, 25 March 2019 |  04:16        An Apple representative declined to comment on a credit score cutoff for Apple Card. Apple said on Monday that its goal is to \"provide interest rates that are among the lowest in the industry\" and that it wanted to make the Apple Card available to the largest number of people possible.     Apple Pay Cash fees   While the Apple Card doesn't have an annual membership fee, there are some fees for certain transactions through its Apple Pay Cash service.  Apple Pay Cash is the service that allows people to send digital money to other iPhone users. It competes directly with PayPal' s Venmo and Square Cash.  The two services are closely linked. Rewards from the Apple Card are paid through the Apple Pay Cash account, for example.  Apple will charge a 1 percent fee to make an instantaneous transfer from an Apple Pay Cash balance to a debit card, maxing out at $10, although direct bank transfers are free. This means that while Apple Card doesn't have fees, some of Apple's associated services might have one.     Fraud prevention           Source: Apple  Titanium Apple Card    Another key selling point of the Apple Card is the iPhone giant's reputation for security. Apple spent significant time on Monday positioning Apple Card as more secure than other credit cards and created a specific web page on the Apple Card site to promote the security and privacy features of the card.  The physical version of the Apple Card is titanium and laser-etched with the user's name -- but it doesn't have any numbers on it, which Apple argues makes it more secure.  The idea is that if your card is physically stolen or someone can take a picture of the front or back, the thief can't use it.  \"Your Apple card is more secure than others, it has no card number, no CVV, no expiration and no signature,\" Apple Pay VP Jennifer Bailey emphazied on Monday.  The Better Business Bureau tracks credit card scams, and spokesperson Katherine Hutt generally agrees the lack of numbers is a good thing.  \"In a typical scenario, if someone finds your wallet, they go online and buy a large item with your credit card immediately before you cancel,\" Hutt said. \"Without numbers, they can't do it.\"  However, Hutt warned, other scenarios are increasingly common, and Apple Card holders shouldn't be lulled into a false sense of security.  \"Scammers have much more efficient ways of breaching your credit card and getting your data,\" such as guessing weak passwords, or \"phishing\" calls pretending to be from the user's bank and asking them for their passwords.  \"The bigger issue will be making sure that their phone is secure. Passwords need to be unique and strong.\"  Subscribe to CNBC on YouTube.          Kif Leswing Technology Reporter    Related Securities      Symbol  Price    Change  %Change      SQ   ---      PYPL   ---      AAPL   ---                                               To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}