{"author": "Yen Nee Lee", "title": "Credit Suisse's global CIO says a recession is coming — but it won't be 'right here, right now'", "description": "The U.S. bond market has been signalling slower growth and a possible recession, but stocks on Wall Street shook off the warning and inched higher Tuesday.", "url": "https://www.cnbc.com/2019/03/27/credit-suisse-global-cio-on-us-yield-curve-inversion-stocks-investing.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/12/19/105637843-1545252894012rtx6j8ks.1910x1000.jpg", "publishedAt": "2019-03-27T03:42:48Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Credit Suisse Asian Investment Conference   Credit Suisse's global CIO says a recession is coming — but it won't be 'right here, right now'    The yield on the 10-year U.S. Treasury bill fell below that of the 3-month note last week — a development seen as an early indicator of a recession. Meanwhile, U.S. stocks shook off the bond market's warning with the S&P 500 closing higher on Tuesday after two sessions of losses. For Credit Suisse's Global Chief Investment Officer Michael Strobaek, the bond market is usually better than stock markets in predicting what's to come.      Yen Nee Lee | @YenNee_Lee   Published 48 Mins Ago  Updated  39 Mins Ago  CNBC.com             The bond and stock markets in the U.S. have been sending mixed signals about the American economy over the last few days — and investors are split on which asset class got it right.   Last week, the yield on the 10-year U.S. Treasury bill fell below that of the 3-month note for the first time since 2007. It's a development that investors call an inverted yield curve, and is seen as an early indicator of a recession . Meanwhile, U.S. stocks shook off the bond market's warning with the S&P 500 closing higher on Tuesday after two sessions of losses.  But for Credit Suisse's Global Chief Investment Officer Michael Strobaek, the bond market is usually a better indicator of what's to come.   \"I have to say I'm a bigger believer of the predictability by the bond market. And they're signaling either a combination of inflation going much lower and, or, growth going much lower,\" he told CNBC's Nancy Hungerford on Wednesday at the Credit Suisse Asian Investment Conference in Hong Kong .  \"We're really going into a slowdown and a recession,\" Strobaek said, clarifying that it may not be \"right here, right now\" — but it could come in 2 to 3 years.  That means the stock market could experience a \"real correction\" in the next 1.5 to 2 years, according to Strobaek. For now, the Swiss bank is still looking for opportunities to buy equities, he said.  \"A nice, small-ish type correction, for sure, will be one trigger. Another one would be to see Europe stabilize a bit, China reaccelerating and that could be good for the second half ... I'm waiting patiently,\" Strobaek said.     WATCH: Stocks shake off bond market warning signs — five experts weigh in          show chapters               Stocks shake off bond market warning signs — Watch five experts weigh in on what's next   9 Hours Ago |  05:25                 Yen Nee Lee Correspondent    Related Securities      Symbol  Price    Change  %Change      CSGN   ---                                               To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}