{"author": "Sarah Whitten", "title": "Criminal charges against 'Empire' actor Jussie Smollett dropped", "description": "The Illinois state attorney's office dropped criminal charges against \"Empire\" star Jussie Smollett on Tuesday.", "url": "https://www.cnbc.com/2019/03/26/charges-against-empire-actor-jussie-smollett-dropped.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/02/21/105753104-1550762112798smollett.1910x1000.jpg", "publishedAt": "2019-03-26T15:15:01Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Entertainment     Life    Travel    Entertainment    Sports    Weather    Crime    Art & Culture    Science      Prosecutors drop charges against 'Empire' actor Jussie Smollett for alleged staged hate crime — Chicago mayor calls it 'whitewash of justice'    Chicago prosecutors abruptly drop criminal charges against \"Empire\" star Jussie Smollett, who had been accused of staging a phony hate crime against himself. Chicago Mayor Rahm Emanuel calls the dismissal a \"whitewash of justice.\" Smollett had faced 16 counts of disorderly conduct. It is not clear whether the dismissal will affect an investigation by the FBI into a letter threatening Smollett that was sent to the studio where \"Empire\" is filmed and which Chicago police have said that Smollett himself sent.      Sarah Whitten | Dan Mangan   Published 13 Hours Ago  Updated  8 Hours Ago  CNBC.com              Kamil Krzaczynski | Reuters Actor Jussie Smollett leaves court after charges against him were dropped by state prosecutors in Chicago, Illinois, March 26, 2019.   Chicago prosecutors on Tuesday abruptly dropped criminal charges against \"Empire\" star Jussie Smollett, who was accused of staging a phony hate crime against himself.   Smollett, who had faced 16 counts of disorderly conduct, appeared at an emergency court hearing Tuesday morning, where the case was dismissed in exchange for the actor agreeing to forfeit his $10,000 release bond.  There had been no suggestion in recent court filings or media reports that Smollett's case would be tossed out. Smollett had pleaded not guilty March 14, and before Tuesday's surprise hearing was next scheduled to be in court on April 17.   \"This is without a doubt a whitewash of justice,\" Chicago Mayor Rahm Emanuel said at a press conference where he and police blasted the dismissal.  He said Smollett \"did this all in the name of self-promotion.\"  \"How dare you!\" Emanuel said of the 36-year-old Smollett.  The mayor said that Smollett's alleged deception meant that future actual victims of hate crimes would be under a cloud of suspicion when they report being targeted for their race, sexual orientation or religion.  \"This sends an unambiguous message that there is no accountability, and that is wrong,\" Emanuel said of the case being dropped.  Smollett, who is black and gay, told Chicago police in January that he was attacked by two masked men as he was walking home around 2 a.m. The actor said the men beat him, shouted racist and homophobic comments, poured a chemical substance on him, looped a rope around his neck and then fled.  Two brothers, Ola and Abel Osundairo, were arrested in February for allegedly being connected to the attack, but later were released without charges. The Osundairos told police that Smollett wrote them a check for $3,500 to carry out the purported attack.  Chicago Police Superintendent Eddie Johnson told reporters Tuesday that police \"found out about [the dismissal] when you all did.\"  \"Do I think justice was served? No. ... They chose to hide behind secrecy in brokering a deal,\" Johnson said.   Tweet   But Smollett, after the case was dropped, said, \"I've been truthful and consistent on every level since day one.\"  \"I would not be my mother's son if I was capable of even one drop of what I have been accused of.\"  \"This has been an incredibly difficult time, honestly, one of the worst in my entire life,\" he said.  \"I want to thank my legal counsel from the bottom of my heart, and I would like to thank the state of Illinois for attempting to do what is right. Thank you for all the support, thank you for faith and thank you to God.\"       Source: Chicago PD A mugshot of actor Jussie Smollett after making false crimes charge.   There was no plea deal in the case, whose records have now been sealed as a result of the dismissal.  A spokesman for Cook County State's Attorney Kimberly Foxx, whose office was prosecuting Smollett, said, \"After reviewing all of the facts and circumstances of the case, including Mr. Smollett's volunteer service in the community and agreement to forfeit his bond to the City of Chicago, we believe this outcome is a just disposition and appropriate resolution to this case.  Foxx recused herself from the investigation in February after facilitating conversations between Smollett's family and the Chicago Police Department. She initially cited \"potential questions of impartiality based upon familiarity with potential witnesses in the case\" as the reason for stepping away from the case.  Smollett's legal team, in a statement, reiterated its claim that Smollett was the victim of an actual attack.  \"Today, all criminal charges against Jussie Smollett were dropped and his record has been wiped clean of the filing of this tragic complaint against him,\" Smollett's legal team said. \"Jussie was attacked by two people he was unable to identify on January 29th.\"  The dismissal is a \"stunning, surprising turn of events. Like something you might see on Mr. Smollett's TV show,\" Georgetown University Law professor Paul Butler said on MSNBC.  Chicago Police Department Commander Edward Wodnicki, whose department had conducted the investigation into Smollett, told WMAQ-TV he was outraged by the dismissal.  \"It's a punch in the gut. Is absolutely a punch in the gut,\" Wodnicki said. \"We worked closely throughout our three-week investigation to get to the point where we arrested the offender. For the state's attorney at this point to dismiss charges without discussing this with us at all is just shocking.\"  \"They weren't courteous to give us a heads-up\" about the dismissal, he said.  \"This is a slap in our face.\"  Wodnicki said there was \"overwhelming evidence\" against Smollett and called the case against him \"rock solid.\"  \"We wasted time and effort on a reported serious crime to get to the point it's a lie?\" Wodnicki said. \"I want reimbursement,\" he said, noting that the Chicago PD had spent more than $10,000 on the probe.  \"Citizens should be angry,\" Wodnicki said.  Emanuel said Smollett's claim of the assault had dragged the city of Chicago's name \"through the mud.\"  \"I support the hard work of our police,\" Emanuel said.  He noted that a grand jury had indicted Smollett and that the case was accepted by prosecutors weeks ago.  It is not clear whether the dismissal will affect a separate investigation by the FBI into a letter that threatened Smollett and which was sent to the studio where \"Empire\" is filmed shortly before the alleged attack on Smollett.  Chicago police have said that Smollett himself sent that letter.  Smollett has not been charged by federal authorities in connection with the letter. A spokesman for the U.S. Attorney's Office in Chicago, which would handle any federal prosecution of Smollett if it were to be initiated, declined to comment.  In the wake of Smollett's arrest in February, producers of the 20th Century Fox Television show \"Empire\" decided to remove the actor from the final two episodes of the latest season. Warner Bros. -owned TNT also pulled an episode of \"Drop the Mic\" that featured Smollett.  In a statement, 20th Century Fox Television and Fox Entertainment said, \"Jussie Smollett has always maintained his innocence and we are gratified that all charges against him have been dismissed.\"  As of last week, 20th Century Fox Television is owned by Disney .   Tweet   \"Our son and brother is an innocent man whose name and character has been unjustly smeared,\" said the Smollett family in a statement to The Hollywood Reporter. \"Jussie is a son, a brother, a partner, a champion for human rights, and a genuine soul who would never be capable of what he was falsely accused of. He was the victim of an assault and then falsely blamed for his own attack.\"  The statement continued, \"This morning truth has prevailed and he has been vindicated. All charges have been dismissed and his record expunged (cleared). The painful incidents we've witnessed him endure over the past 7 weeks have been heartbreaking and unjust to say the least. While many were quick to rush to judgement before hearing the actual truth, we are grateful that the truth about Jussie has come to light. We look forward to bringing the real perpetrators to justice. We thank God and our village for standing by us during this trying time.\"  Smollett's attorneys had included celebrity lawyer Mark Geragos. On Monday, Geragos was identified as a co-conspirator of lawyer Michael Avenatti in an alleged scheme by Avenatti to extort up to $25 million from athletic shoe giant Nike by threatening to release damaging information about that company.  Geragos has not been criminally charged in that case.  Patricia Brown Holmes, a lawyer for Smollett, said the $3,500 that Smollett gave the brothers who claimed the attack was staged actually was payment for nutrition and training.  \"We have gotten to a result which is the right result in this case, and we are happy with that,\" Holmes said during a news conference Tuesday.  Smollett \"is a good, solid citizen of the city of Chicago,\" she said.          Sarah Whitten Reporter Dan Mangan Reporter    Related Securities      Symbol  Price    Change  %Change      T   ---      NKE   ---      DIS   ---      FOXA   ---                                            html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}