{"author": "Emily Price", "title": "Citigroup is Starting a Payments Unit", "description": "Citigroup's new payments solution will help it compete with companies like Stripe and Paypal.", "url": "http://fortune.com/2019/03/26/citigroup-is-starting-a-payments-unit/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1001438458-e1553630342531.jpg", "publishedAt": "2019-03-26T20:02:50Z", "content": "                                                Citigroup is Starting a Payments Unit                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Retail      Citigroup        Citigroup is Starting a Payments Unit                                                      Citigroup is starting a payments unit with firms including Mastercard to compete with companies such as PayPal and Stripe.  S3studio Getty Images        By Emily Price  4:02 PM EDT       Citigroup is launching a new payments unit that will offer merchants consumer payment options such as credit cards, digital wallets, and direct bank account transfers.  Citigroup is reportedly partnering with payments firms including Mastercard for the new offering. Mastercard will provide some of the back-end connections and processing for merchants, The Wall Street Journal reports.  “Our mission is to power frictionless payment acceptance with nimble technology. We want to extend our leadership beyond the B2B payment space by developing capabilities to enable institutions to collect from consumers in a globally consistent and seamless fashion,” said Naveed Sultan, Global Head of Citi’s Treasury and Trade Solutions said in a prepared statement .  With the move, Citi says that institutions will be able to gain more visibility into the end-to-end transaction lifecycle, which will allow them to focus on their traditional business operations and growth. It says that consumers will benefit from payment ubiquity through a localized payment experience.    “Every institution wants to focus their time on providing their customers with the best experience or the best product. Our trusted technology helps them do just that. We are excited to work with Citi and their leading transaction services business,” Michael Miebach, Chief Product Officer, Mastercard said in Citi’s press release . “As they integrate Mastercard Payment Gateway Services, they’re making the whole process simpler for Citi’s institutional clients to accept payments from anywhere in the world and continue growing their businesses.”  The move is expected to allow Citigroup to better compete with companies such as PayPal and Stripe, which are typically preferred by some internet companies.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}