{"author": "Bob Bryan", "title": "Americans are starting to dislike Bernie Sanders' Medicare for All plan, but there is a Democratic healthcare idea that even Republicans voters like", "description": "More people think Medicare for All is a bad idea than think it is a good idea. But a majority of Americans support a Medicare buy-in option.", "url": "https://www.businessinsider.com/medicare-for-all-bernie-sanders-alexandria-ocasio-cortez-poll-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a859b8629137a8d01b435-1334-667.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Americans are starting to dislike Bernie Sanders' 'Medicare for All' plan, but there is a Democratic healthcare idea that even Republicans voters like        Bob Bryan  6h                                                         Sen. Bernie Sanders' \"Medicare for All\" plan is losing popularity among Americans, according to a new poll.  Bastiaan Slabbers/NurPhoto via Getty Images          The luster of \" Medicare for All ,\" the healthcare plan advanced by progressives such as Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez, is starting to fade. According to a new poll, 43% of Americans think Medicare for All is a good idea, while 45% said it is a bad idea. Fifty-one percent of people said it was a good idea in August 2017, while 38% said it was a bad idea. But a Medicare buy-in option, which has been advanced by more moderate Democrats, is much more popular. Fifty-one percent of people surveyed supported that idea, while just 30% were against it. Americans are starting to cool on the idea of \" Medicare for All ,\" but there is a more moderate Democratic proposal that still captures the public's attention, according to a new poll. A Quinnipiac University poll found that support for the Medicare for All idea, which has been advanced by progressives such as Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez , has slipped substantially over the last year and a half. In August 2017, 51% of Americans thought Medicare for All was a \"good idea,\" while just 38% thought it was a \"bad idea.\" In the poll released on Tuesday, the percentage of Americans calling Medicare for All a \"good idea\" was down to 43%, while 45% said it was a \"bad idea.\" Medicare for All would eliminate private insurance and enroll all Americans in the government's healthcare program. While the idea would drive up the government's spending , advocates say that the savings for average people — who would no longer have to pay insurance premiums — and the streamlining of the healthcare system would result in savings for the healthcare system as a whole . But the idea also includes tax increases to help offset some of the government spending , which previous polling has shown drives down people's acceptance of the idea . Read more : People love Medicare for All until they're told it'll raise their taxes While Medicare for All may be declining in popularity, another healthcare reform advanced by Democrats still remains popular. A Medicare buy-in, in which people could either keep their private insurance or choose to shift to the government's Medicare program, actually attracted support from a majority of people. Fifty-one percent of Americans said the buy-in option was a \"good idea,\" while just 30% said it is a \"bad idea.\" The Medicare buy-in drew much more support among Democrats and independents, but even a plurality of self-described Republicans liked the idea. Forty-three percent said it was a \"good idea,\" while 39% said the buy-in was a \"bad idea.\" A number of more moderate Democrats, including 2020 presidential candidates such as Beto O'Rourke , have pushed for a Medicare buy-in plan. Others have suggested that the US should lower the age at which people qualify for Medicare to 50 from the standard of 65. While the Quinnipiac poll does not give reasons for the fall in the popularity of Medicare for All, there are a number of factors that could be in play. For one thing, the increased visibility of Medicare for All — which has gone from a fringe solution to part of the political mainstream — could have exposed more people to the specifics of the idea. Additionally, many Democrats were vague about their meaning of Medicare for All — sometimes combining the idea with the Medicare buy-in. As those terms get more well-defined, it appears most people are gravitating toward the less extreme option.         SEE ALSO:  Alexandria Ocasio-Cortez suggested members of Congress should get paid more, but a majority of Americans want the complete opposite      NOW WATCH: A dog groomer is going viral for creating epic slow motion photoshoots of her canine clients         More:  Bernie Sanders  Alexandria Ocasio-Cortez  Medicare for all  Healthcare      Health Insurance  Beto O'Rourke  Obamacare                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}