{"author": "Joe Perticone", "title": "Trump's national emergency declaration for a border wall survives after House fails to override veto", "description": "Congress' inability to override Trump's veto means that, for the time being, the national emergency declaration to build a border wall will go on as planned.", "url": "https://www.businessinsider.com/house-fails-override-trump-veto-national-emergency-declaration-border-wall-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a3af509b6037acf600182-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Trump's national emergency declaration for a border wall survives after House fails to override veto        Joe Perticone  39m                                                         The House Speaker Nancy Pelosi.   JIM WATSON/AFP/Getty Images           The House of Representatives failed to garner enough votes to override President Donald Trump's veto of the resolution crafted to terminate his national emergency declaration . A veto override would have required a two-thirds majority of both the House and the Senate to reverse Trump's decision. Trump's national emergency declaration is also facing several lawsuits. WASHINGTON — The House of Representatives failed to garner enough votes to override President Donald Trump's veto of the resolution crafted to terminate his national emergency declaration to divert military funds and build a wall along the United States border with Mexico. The vote finished 248-181, far short of the required two-thirds majority required to overturn a presidential veto. Read more : Americans overwhelmingly want Congress to defy Trump and override his veto of the resolution to end his border-wall emergency declaration The inability of Congress to override Trump's veto from earlier this month means that, for the time being, the national emergency declaration will go on as the White House has planned. The Senate passed the resolution, 59-41 , with 12 Republicans joining a unanimous conference of Democrats, issuing an embarrassment to Trump, whose administration attempted to quell the rebellion brewing in the lead-up to the vote. That vote came after the House passed the same resolution in February , when 13 Republicans crossed the aisle. The House's failure to override the veto come after an INSIDER poll showing that almost twice as many Americans supported Congress' effort to reject the president. But the emergency declaration is not exactly settled because it still faces a host of lawsuits , including one from a coalition of nearly two-dozen states led by California. Read more: THE OTHER BORDER 'CRISIS': While America is fixated on Mexico and the wall, thousands of migrants are fleeing for Canada in a dramatically different scene The multi-state lawsuit challenging the emergency declaration argues that money appropriated to their respective states could be at risk as a result of the White House's decision to reprogram certain funds. When the lawsuit was announced, Trump went on Twitter to rail against it as a plot created by the \"Radical Left.\" \"As I predicted, 16 states, led mostly by Open Border Democrats and the Radical Left, have filed a lawsuit in, of course, the 9th Circuit!\" Trump wrote on Twitter . \"California, the state that has wasted billions of dollars on their out of control Fast Train, with no hope of completion, seems in charge!\" Read more: A simple technology could secure the US-Mexico border for a fraction of the cost of a wall — but no one's talking about it Trump has been racking up political victories this week , and with the House's failure to override his veto he has snagged another win.      SEE ALSO:  The 20 companies and groups that spend the most money to influence lawmakers      NOW WATCH: 5 animals that have the most extreme sex in the animal kingdom         More:  Donald Trump  Nancy Pelosi  Congress  White House      National Emergency Declaration  Border Wall  Border Security                                           Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A GOP senator brought a giant picture of Ronald Reagan riding a dinosaur onto the Senate floor to argue against Democrats' Green New Deal      Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}