{"author": "Steve Cameron", "title": "The NCAA brings in $1 billion a year — here's why it refuses to pay its college athletes", "description": "The NCAA brings in $1 billon a year in revenue, most of which is generated by March Madness, but doesn't allow its college athletes to be paid.", "url": "https://www.businessinsider.com/ncaa-college-athletes-march-madness-basketball-football-sports-not-paid-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a29be2cc74065e6454447-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                         Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE           Edition                Prime    Intelligence     A vertical stack of three evenly spaced horizontal lines.     Edition   International Editions:    United States  US         International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                       BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation        Finance    Markets  Retail  Your Money  Markets Insider        Politics    Military & Defense  News        Strategy    Careers        Life    Entertainment  Travel  Sports        All       Coupons    Target  Walmart  EBay  Nike  Container Store            BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE           Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES            Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                     The NCAA brings in $1 billion a year — here's why it refuses to pay its college athletes        Steve Cameron  8m                                             The NCAA brought in $1 billion of revenue during the 2016-2017 school year — most of which was generated by the Division I Men's Basketball Tournament, also known as March Madness . Regardless of how much money the NCAA makes, it refuses to pay college athletes . NCAA athletes are also prohibited from profiting off of their name, image, or likeness. The NCAA uses \"amateurism\" to justify these terms in courtrooms, but former athletes are pushing for a share of the revenue. Following is a transcript of the video: Narrator: In the 2016-2017 school year, NCAA revenue reached $1 billion. Many people have argued that the players who drive this revenue don't receive the true value that they bring to their schools. John Oliver: There is nothing inherently wrong with a sporting tournament making huge amounts of money, but there is something slightly troubling about a billion-dollar sports enterprise where the athletes are not paid a penny. Narrator: John has a point. So why is it that student-athletes aren't paid? Let's start by looking through recent lawsuits against the NCAA. In response to the release of EA Sports' popular NCAA video games, former UCLA basketball player Ed O'Bannon filed a federal lawsuit against the NCAA over whether Division I men's basketball and football players should be compensated for the commercial use of their names, images, and likenesses. After appeals, the final outcome was that even though the NCAA's amateurism rules are unlawful, the fact that it lets colleges compensate student-athletes with the cost of college attendance, the NCAA frees itself from antitrust violations. And in March 2019, there was a slight change to that ruling. In the US District Court, Judge Claudia Wilken ruled to allow each conference and its member schools to provide additional education-related benefits without NCAA caps and prohibitions. Her ruling tethers payment to education, so instead of cash, student-athletes will be allowed to receive computers or scholarships for post-graduate degrees. In each trial, the NCAA has argued that amateurism keeps it from becoming an anticompetitive trust. So what is amateurism? In page four of the NCAA Division I handbook under the heading \"The Principle of Amateurism,\" the NCAA declares student-athletes shall be amateurs in an intercollegiate sport, and their participation should be motivated primarily by education and by the physical, mental, and social benefits to be derived. To clarify that, Oliver Luck, the NCAA's former executive vice president of regulatory affairs, said in a speech in 2015, \"It would be a bad mistake to create campus employer-employee relationships with student-athletes.\" Paying college athletes \"would distract in a very significant way from pursuing what they really need to pursue - an education... And we need to emphasize the value of that education.\" But let's think about that for a second. Are student-athletes able to receive the full value of that education? Richard Sherman: No, I don't think college athletes are given enough time to really take advantage of the free education that they're given. Narrator: Former student-athletes argue that the time commitment of playing a college sport, especially at the Division I level, impedes their ability to take advantage of their educational opportunity. Sherman: Show me how you're gonna get all your work done when after you get out at 7:30 or so you got a test the next day, you're dead tired from practice, and you still have to study just as hard as everybody else every day and get all of the same work done. Narrator: In fact, CBS Sports published a study on the topic with data from the Pac-12, the league Sherman competed in while at Stanford. The study surveyed 409 Pac-12 student-athletes and found 54% of athletes say they don't have enough time to study for tests, 80% of athletes say they have missed a class for competition during the academic year, and overall, athletes spend 50 hours a week on athletics. And while student-athletes feel they have the resources at their disposal to succeed academically, they don't have the time to do so. Reporter: The University of North Carolina today reeling from a blow, a really big blow, to its reputation, especially the integrity of its legendary sports program. Narrator: The University of North Carolina even went as far as committing academic fraud for 18 years. Advisers enrolled students in paper classes, which were fake classes used to inflate student-athlete GPAs to keep them eligible to play. So in many cases, these student-athletes are not receiving the education they're promised, the cost of which is by law how they're compensated. But beyond that, the cost of that education is lower than the revenue most big school athletic departments bring in. In 2014, the 10 schools that made the most money in college sports averaged revenue that was $132.5 million more than the average those schools spent on scholarships. Skip Bayless: So you get a free ride at school, but you deserve so much more than that. Stephen A. Smith: The NCAA has been allowed to be the flaming hypocrites that they are, getting away with the multitude of things that they have gotten away with in an effort to exploit these kids for years and years and years. Colin Cowherd: It's time to now pay players. Narrator: In her latest ruling, Judge Wilken denied a free market scholarship model, and the idea of paying student-athletes raises a lot of questions. Scott Davis: There would be such a large disparity between some of the athletes, and it's no different than the pros where the best players are getting paid and lower players are not, even when you trickle down to other sports that are not making as much money or generating as much attention as football or basketball. Bernard Muir: We have 36 sports, many of the sports you've just mentioned. We would have to kind of concentrate to a small number in order to pay student-athletes. Davis: There would be less incentive to go to class because they would essentially have a job already if they were earning, like, their true value to the schools. Narrator: Despite these arguments, some writers have devised plans to pay athletes the value they add to their schools. Deadspin published, \"So what is the best plan for playing players? No plan at all,\" arguing to treat them like any other employee and that the free market is the best solution, similar to the proposal in Judge Wilken's court. SB Nation suggests the NCAA adopts the Olympic model of amateurism in which the athletes are free to gain endorsement deals and sell autographs. And LZ Granderson has called for government intervention. Granderson: It is way more complicated than just handing out checks, as well, and so I think Congress actually needs to get involved a lot more than what's happening right now. Narrator: This issue is far from decided and likely won't be anytime soon. Let us know what you think in the comments. Do you believe college athletes deserve to be paid? If you do, what model do you think works best?                    Most Popular Videos            Bud Light's 'Dilly Dilly' just made a comeback at the Super Bowl with a weird crossover ad with Game of Thrones — here's what the phrase means            Michael D'Antonio reveals Donald Trump's 'strange' morning ritual that boosts his ego            There are serious health reasons why you shouldn't eat your boogers            Meet the three women who married Donald Trump            Earth's north magnetic pole is on the move — here's what will happen when our poles flip          Most Recent Videos            Watch Oprah and Tim Cook debut Apple's original-video service: Apple TV+            Watch Apple's March 2019 'Show Time' event in 13 minutes            Watch Apple debut its own no-fee credit card            Watch Apple debut its game-subscription service, Apple Arcade            Watch Tim Cook unveil Apple's news-subscription service: Apple News+                                   Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US         International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}