{"author": "Saheli Roy Choudhury", "title": "McDonald's will reportedly no longer lobby against minimum wage hikes", "description": "McDonald's is said to have written to the National Restaurant Association that wage increases should be phased in and that all industries should be treated the same way, Politico reported.", "url": "https://www.cnbc.com/2019/03/27/mcdonalds-reportedly-to-stop-lobbying-against-minimum-wage-hikes.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/03/21/105079239-GettyImages-929107440.1910x1000.jpg", "publishedAt": "2019-03-27T01:26:46Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Jobs     Economy    World Economy    US Economy    The Fed    Central Banks    Jobs    GDP outlook      McDonald's will reportedly no longer lobby against minimum wage hikes    McDonald's will no longer participate in lobby efforts against raising the minimum wage in the U.S. at the federal, state or local level, the fast-food giant told the National Restaurant Association, Politico reported. Genna Gent, McDonald's vice president of government relations, said in a letter that the company believes wage increases \"should be phased in and that all industries should be treated the same way.\" The move from McDonald's could boost House Democrats and their efforts to raise the minimum wage.      Saheli Roy Choudhury   Published 3 Hours Ago  CNBC.com              Jeff Greenberg | Universal Images Group | Getty Images   McDonald's will no longer take part in efforts to lobby against raising the minimum wage at the federal, state or local level, the fast-food giant told the National Restaurant Association, Politico reported .   Genna Gent, McDonald's vice president of U.S. government relations, said in a letter to the association that the company believes wage increases \"should be phased in and that all industries should be treated the same way.\"  \"The conversation about wages is an important one; it's one we wish to advance, not impede,\" Gent wrote, according to Politico. The fast-food chain also stated that outlets owned by the company have an average starting wage that exceeds $10 per hour while franchisees pay \"likely similar\" wages in their own restaurants.   McDonald's did not immediately respond to CNBC's emailed requests for comments.  The move from McDonald's, one of the largest employers in the world, could boost House Democrats and their efforts to raise the minimum wage . Earlier this month, the House Committee on Education and Labor advanced a bill to raise the U.S. wage floor to $15 per hour by 2024. Currently, the minimum wage is $7.25.  Still, the legislation has only a slim chance of becoming law. Republicans in the GOP-held Senate — like their colleagues in the House — will likely oppose it. The White House has also trashed the idea of hiking the federal wage floor.  For its part, McDonald's has been mired in a suit over alleged labor violations by some of its franchisees, after they allegedly punished some of their employees who took part in protests to raise the minimum wage, Politico said.  Read more about McDonald's decision to halt lobbying against minimum wage hikes here.  — CNBC's Jacob Pramuk contributed to this report.     WATCH: MacDonald's acquires startup to customize digital drive-thru menus          show chapters               McDonald's acquires startup to customize digital drive-thru menus   10 Hours Ago |  01:08                 Saheli Roy Choudhury Reporter, CNBC.com    Related Securities      Symbol  Price    Change  %Change      MCD   ---                                               To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}