{"author": "Kate Rooney", "title": "Apple's move into banking raises the bar for fintech, traditional credit cards", "description": "Apple is working with Goldman Sachs and Mastercard to launch a credit card that some say poses a threat to fintech companies and regional banks.", "url": "https://www.cnbc.com/2019/03/26/apples-move-into-banking-raises-the-bar-for-fintech-credit-cards.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/26/105815009-1553612805806cook.1910x1000.jpg", "publishedAt": "2019-03-26T16:52:53Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Finance     Banks    Hedge Funds    Deals and IPOs    Wall Street      Apple's move into banking raises the bar for fintech, traditional credit cards    Apple is working with Goldman Sachs and Mastercard to launch a credit card. In typical Apple style, it’s changing the way the old guard might think about something as common as swiping a credit card. Some say the tech giant could pose a threat to fintech companies and regional banks. \"Money is just a form of data, and Apple has been great at managing access to data. They'll take the same approach to money over time,\" says Ryan Gilbert, general partner at Propel Ventures.      Kate Rooney | @Kr00ney   Published 9 Hours Ago  Updated  7 Hours Ago  CNBC.com                show chapters               Apple can do more with Apple Pay, says CreditCards.com industry analyst   8 Hours Ago |  04:13        Thanks to Apple , the iPhone is hardly used as a phone at all. The same thing may very well happen to our wallets — forcing established credit card companies to change the way they do business.   The tech giant unveiled its Apple credit card through a partnership with Goldman Sachs and Mastercard on Monday. Apple is entering a crowded, competitive market filled with banks and newer fintech firms. While many of the perks on the Apple card are already available at competitors, the tech company's brand, massive customer base and new security features could help it carve out significant market share.  \"Money is just a form of data, and Apple has been great at managing access to data. They'll take the same approach to money over time,\" said Ryan Gilbert, general partner at Propel Ventures. \"Apple has raised the bar — we'll see most issuers rethinking their products and seeking to copy Apple.\"   Apple users will be able to sign up for the new card this summer through their iPhones, according to the company. It's centered around Apple Pay, the company's mobile payment and digital wallet service that started in 2014. The card will also let users manage spending and rewards through the iPhone's Wallet app.  Among the features other card companies might want to copy is Apple's heightened security. The card will incorporate a one-time use authentication code that is protected by biometric security — either \"Touch ID\" or \"Face ID\" through the iPhone. The sleek, minimalist titanium card just has the holder's name etched onto it with lasers. It forgoes card numbers and other sensitive information.  If customers are able to trust Apple with their bank accounts, that could be \"the winning punch\" against other credit cards with similar perks.  \"That's an opportunity over existing banks, especially if you get hacked — Apple is known for that Apple store, Genius bar experience\" Gilbert said.  Apple's credit card comes with perks, but they're not entirely new. The card gives 2 percent cash back on Apple Pay transactions and 3 percent on direct Apple purchases. Customers get 1 percent on purchases with the physical card and the company said rewards are dispensed daily.       Source: Apple Titanium Apple Card   The interest rate on the Goldman Sachs-linked credit card are expected to range from roughly 13 percent to 24 percent. There's no teaser rate — which fintech companies and banks often use to attract customers. The card has no fees of any kind — that includes late fees, international fees or annual fees, according to Apple.  Other cards, like the Citi Double Cash card, also offer 2 percent cash back on all purchases while U.S. Bank Altitude Reserve Visa Infinite card rewards mobile spending with 3 percent cash back and pays back 4.5 percent on travel.  Even if it's not the best rewards card, it could help build Apple Pay, said CB Insights' Max Abramsky.  \"Although Apple is late to the credit card game, its marketing clout and loyal customer base gives the company an opportunity to scale up quickly,\" Abramsky said. The Apple Cash rewards will encourage users to keep an account balance and ultimately spend it on online, for in-store purchases or by making peer-to-peer payments.  For Goldman, the move marks a further push into its new consumer financial products. Goldman Sachs rolled out its retail bank called Marcus in 2016. Until then, the investment bank was mostly known for catering to high-net-worth individuals and institutional investors throughout its 150-year history.     Threat to fintech   The Apple Card is likely to put more competitive pressure on branded credit card issuers than on Goldman's fellow banks. But it is also likely a threat to fintech companies, especially if it goes after consumer deposits.  \"It is conceivable that Apple continues to offer more financial products to its customer base, particularly bank accounts which is quite complementary to credit accounts,\" said Kyle Lui, partner at venture capital firm DCM. \"That would be much more competitive to fintech unicorns like SoFi, Chime and even Robinhood.\"  Fintech companies like Chime, Robinhood, Wealthfront and SoFi have been moving toward holding customer cash by launching cash accounts. Many of them tend to partner with smaller, regional banks instead of big institutions like Goldman and J.P. Morgan. If Apple were to go after deposits, smaller banks could take a hit.  \"Regional banks are going to have a tough time -- the big banks can still play defense,\" said Propel's Ryan Gilbert. \"Those who haven't done much exciting over time will see more pressure especially If direct deposits go to Apple.\"  Square and PayPal might not be immune, either. Those payment firms have courted customers by offering small business loans, peer-to-peer payment apps, debit cards and credit cards in the case of PayPal.  \"This is really Apple putting on the boxing gloves not just to the likes of Netflix and Disney in streaming, but also Square and PayPal by going to after payments market share,\" said Dan Ives, managing director and equity analyst covering the technology sector at Wedbush. \"It really shows Apple loading up the arsenal getting ready to go.\"           David Paul Morris | Bloomberg | Getty Images  Jennifer Bailey, vice president at Apple Inc., speaks during an event at the Steve Jobs Theater in Cupertino, California, U.S., on Monday, March 25, 2019.    Gene Munster of Loup Ventures estimated that Apple Pay is still only active on about 25 percent of all iPhones in the U.S. This could speed up adoption of Apple's payments system, since the card can be used anywhere unlike Apple Pay.  Apple is making inroads, even without the credit card. More than 70 percent of U.S. retailers now take Apple Pay, and roughly 40 countries will opt in by year-end, Cook said. Apple Pay is on track to pass 10 billion transactions this year, and will work in mass transit systems in New York, Chicago and Portland this year, Cook said in the presentation Tuesday.  Apple's success in capturing other areas of consumer's lives may be a key reason someone could decide to trust them with personal finance.  \"The Apple brand is such that if they started a new yogurt, Apple enthusiasts would buy that,\" Ives said. \"They want to build more of a fence around their backyard by going after the financial platform side of the customer.\"  There are potential challenges, including demand for the card. Propel Venture's Gilbert said underwriting the demand could be a challenge. And Apple has to deal with the reality that they may have to turn people down depending on credit scores.  \"A credit card implies that you have credit,\" Gilbert said. \"How does this support Apple being the firm for everybody model? Can this be for everyone, or is it only for people with high quality credit?\"  The revenue potential is also unproven. While this appears to represent an \"incremental benefit to users,\" the \"revenue opportunity of the Apple Card product is unclear at this point,\" Raymond James wrote in a note to clients after the announcement.  — CNBC's Hugh Son and Annie Nova contributed reporting.          Kate Rooney Markets Reporter    Related Securities      Symbol  Price    Change  %Change      PYPL   ---      SQ   ---      MA   ---      AAPL   ---                                               To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}