{"author": "Jacob Pramuk", "title": "Green New Deal backed by Alexandria Ocasio-Cortez fizzles out in the Senate as Dems accuse GOP of putting on a 'stunt' vote", "description": "Ahead of the Green New Deal vote, Chuck Schumer accused Mitch McConnell of using political theater to hide his lack of a plan to address a warming planet.", "url": "https://www.cnbc.com/2019/03/26/aocs-green-new-deal-dies-in-mcconnell-led-senate-vote.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/02/12/105701369-1550007183399gettyimages-1088557744r.1910x1000.jpg", "publishedAt": "2019-03-26T20:51:40Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Politics     White House    Policy    Defense    Congress    Elections    Europe    China    Asia    World      Green New Deal backed by Alexandria Ocasio-Cortez fizzles out in the Senate as Dems accuse GOP of putting on a 'stunt' vote    The Senate fails to advance a Green New Deal resolution as Republican Senate Majority Leader Mitch McConnell forces a vote. The nonbinding measure widely criticized by Republicans calls for the U.S. to make drastic change to move away from fossil fuels and fight climate change. Senate Minority Leader Chuck Schumer accuses McConnell of putting on a \"stunt\" vote as he tries to put Democratic senators and 2020 presidential contenders on the record.      Jacob Pramuk | @jacobpramuk   Published 5 Hours Ago  Updated  2 Hours Ago  CNBC.com                show chapters               Senate vote to begin Green New Deal debate fails to advance   5 Hours Ago |  01:26        A Green New Deal proposal backed by numerous Democrats failed to advance in the Senate on Tuesday as Democrats protested what they called a political show vote orchestrated by majority Republicans.   The nonbinding resolution, which calls on the United States to make an ambitious effort to slash its use of fossil fuels to fight climate change, fell short in a procedural vote. The Senate did not proceed to debating the measure, as 57 senators voted against it and 43 Democrats and independents who caucus with them — nearly all of the Democratic caucus — voted \"present.\" Four senators who vote with Democrats — Joe Manchin of West Virginia, Kyrsten Sinema of Arizona, Doug Jones of Alabama and independent Angus King of Maine — voted against the resolution.  By voting \"present,\" Democrats hoped not to go on the record on a bill that had no realistic chance of passing, even if they support the concept of a Green New Deal. The six Democratic senators running for president next year — who co-sponsored the original resolution introduced by Sen. Ed Markey, D-Mass. — did not take a position on the measure Tuesday.   Democrats have pushed for drastic action to combat climate change as the planet warms and severe weather events such as recent Midwestern flooding have devastated U.S. communities. They say the U.S. has only a limited window to combat climate change and address an existential threat.  Republicans have gleefully criticized the Green New Deal, warning about Democratic efforts to take away anything from cars to hamburgers. They accuse Democrats of a drift toward socialism spurred in part by freshman Rep. Alexandria Ocasio-Cortez, D-N.Y., a champion of the measure in the House.       Al Drago | Bloomberg | Getty Images Representative Alexandria Ocasio-Cortez, a Democrat from New York, center, speaks to members of the media while departing a House Democratic Caucus meeting on Capitol Hill in Washington, D.C., U.S., on Tuesday, March 26, 2019.   Ahead of the vote Tuesday, Senate Minority Leader Chuck Schumer accused Senate Majority Leader Mitch McConnell of using political theater to hide his lack of a plan to address a warming planet.  \"Republicans want to force this political stunt to distract from the fact that they neither have a plan nor a sense of urgency to deal with the threat of climate change. With this exercise, the Republican majority has made a mockery of the legislative process,\" the New York Democrat said Tuesday.  McConnell aimed to put Democrats on the record about whether they support the plan. He sees it as something that will fail to resonate with centrist or independent voters, who some senators will need to keep their seats — or win swing states in a presidential election next year.  The Kentucky Republican said Tuesday that he believes in climate change and wants to address it through unspecified \"technology and innovation.\"  \"This is nonsense,\" McConnell said of the Green New Deal. \"And if you're going to sign on to nonsense, you ought to have to vote for nonsense.\"  President Donald Trump, meanwhile, plans to use the proposal against Democrats as he runs for re-election next year. Six Democratic senators — Cory Booker of New Jersey, Kirsten Gillibrand of New York, Kamala Harris of California, Amy Klobuchar of Minnesota, Bernie Sanders of Vermont and Elizabeth Warren of Massachusetts — are running to challenge the president next year.  During a Senate Republican policy lunch Tuesday, Trump signaled he wants to use the Green New Deal as a cudgel in 2020, according to Sen. Lindsey Graham.  \"He said make sure you don't kill it too much, because I want to run against it,\" the South Carolina Republican said, according to NBC News.   Frank Thorp tweet   Subscribe to CNBC on YouTube.          Jacob Pramuk Staff Reporter                                         To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}