{"author": "Emma Newburger", "title": "Boeing CEO says company is 'humbled and learning' from deadly Ethiopian Airlines crash", "description": "Boeing CEO Dennis Muilenburg released a statement in support of Ethiopian Airlines following the Flight 302 crash that killed 157 people in March.", "url": "https://www.cnbc.com/2019/03/26/boeing-ceo-says-its-humbled-and-learning-from-ethiopian-airlines-crash.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/26/105814674-1553604861819gettyimages-1132016199.1910x1000.jpeg", "publishedAt": "2019-03-26T18:55:28Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 U.S. News   Boeing CEO says company is 'humbled and learning' from deadly Ethiopian Airlines crash    Boeing CEO Dennis Muilenburg released a statement in support of Ethiopian Airlines following the Flight 302 crash that killed 157 people in March. Ethiopian Airlines said Monday it would maintain ties with the U.S. plane maker.      Emma Newburger | @emma_newburger   Published 1 Hour Ago  Updated  1 Hour Ago  CNBC.com              Stephen Brashear | Getty Images A Boeing 737 MAX 8 airliner takes off from Renton Municipal Airport near the company's factory, on March 22, 2019 in Renton, Washington. After two crashes of 737 MAX planes in five months, the model has been grounded from from passenger flights by aviation authorities throughout the world.   Boeing CEO Dennis Muilenburg said the aircraft maker was \"humbled and learning\" from an Ethiopian Airlines crash that killed 157 people earlier this month, the second fatal crash of its popular 737 Max plane in less than 5 months.   \"We've stood shoulder to shoulder in partnership with the Ethiopian team to grieve and extend our deepest sympathies to the families, friends and communities of the passengers and crew,\" Muilenburg wrote in a statement released Monday.  Ethiopian Airlines said on Monday it would maintain ties with the U.S. plane maker despite questions and an investigation into its 737 Max 8 model, which was also involved in the Lion Air crash that killed 189 people in October.   Boeing is under intense scrutiny as federal investigators look into whether the plane maker provided incomplete or misleading information about the model to U.S. air-safety regulators.  Read Muilenburg's full statement below.  As the lead engineer on a project earlier in my career, I watched my pilot friend climb into the cockpit of a prototype aircraft and fly it for the first time. He landed safely, and I exhaled with admiration and relief—a vivid memory I carry with me every day. Knowing someone's life depends on your work is an unforgettable feeling, and it's one shared among all of us at Boeing. We hold ourselves to the highest standards of safety, excellence and integrity in our work because the stakes could not be higher. Since the moment we learned of the recent 737 MAX accidents, we've thought about the lives lost and the impact it has on people around the globe and throughout the aerospace community. All those involved have had to deal with unimaginable pain. We're humbled by their resilience and inspired by their courage. In the weeks since the Ethiopian Airlines Flight 302 accident, the airline's crews have demonstrated this by continuing to serve the flying public with distinction and professionalism. As the airline's Group CEO Ato Tewolde GebreMariam said in his heartfelt statement yesterday, this tragedy does not define Ethiopian—and it won't define the aviation industry or our enduring relationship with their team. For those of us who have worked with them over the years, this comes as no surprise. Ethiopian Airlines has a proud history that stretches more than seven decades. In that time, Ethiopian has been a pioneer and a leader in our industry, launching Africa into the jet age, connecting the continent with all corners of the globe with its extensive network, and earning a reputation for service and safety. More than just an airline, Ethiopian represents the pride and progress of a great people and a symbol of The New Spirit of Africa. We are all humbled and learning from this experience. We've stood shoulder to shoulder in partnership with the Ethiopian team to grieve and extend our deepest sympathies to the families, friends and communities of the passengers and crew. With a shared value of safety, be assured that we are bringing all of the resources of The Boeing Company to bear, working together tirelessly to understand what happened and do everything possible to ensure it doesn't happen again. All of us thank Ethiopian Airlines for their commitment and share their resolve to doing everything possible to build an even safer air travel system. Boeing stands together with all our customers and partners to earn and strengthen the flying public's trust and confidence in us every day.           Emma Newburger Digital Associate    Related Securities      Symbol  Price    Change  %Change      BA   ---                                            html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}