{"author": "Benjamin Zhang", "title": "A Southwest Airlines Boeing 737 Max just made an emergency landing in Florida", "description": "The pilots of the Southwest Airlines Boeing 737 Max reported problems with their CFM Leap 1B engines.", "url": "https://www.businessinsider.com/southwest-airlines-boeing-737-max-makes-emergency-landing-florida-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a93b3dc676772bd561cd7-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  A Southwest Boeing 737 Max headed for storage in the desert just made an emergency landing in Florida        Benjamin Zhang  2h                                                         A Southwest Airlines Boeing 737 MAX 8.  Reuters          A Southwest Airlines Boeing 737 Max airliner made an emergency landing in Orlando, Florida, on Tuesday. \"The aircraft returned and landed safely in Orlando. No passengers were aboard the aircraft,\" the Federal Aviation Administration said in a statement to Business Insider. The pilots reported an engine issue that appears to be unrelated to the control-software problems that grounded the Boeing jet. The plane was being ferried to Victorville, California, for desert storage. A Southwest Airlines Boeing 737 Max airliner made an emergency landing in Orlando, Florida, on Tuesday. Southwest Airlines Flight 8701, a Boeing 737 Max 8, was en route from Orlando to Victorville, California, when its pilots declared an emergency minutes after takeoff, the Federal Aviation Administration (FAA) said in a statement to Business Insider. Southwest Airlines told Business Insider that its pilots \"reported a performance issue with one of the engines.\" The engine issue reported by the pilots appears to be unrelated to the control-software issues that have plagued the 737 Max and that may have contributed to the crashes of both Lion Air Flight JT610 and Ethiopian Airlines Flight ET302. Neither of the two ongoing crash investigations have indicated any performance issues with the plane's CFM International Leap-1B engines. The FAA said it is investigating the flight that lasted just 11 minutes . Southwest Airlines, which is based in Dallas, is the single largest operator of the Boeing 737 Max. Read more : Here are the airlines that fly the Boeing 737 Max The plane involved in the incident is one of 34 Boeing 737 Max aircraft in the Southwest fleet that were grounded by an FAA emergency order earlier this month after the crash of Ethiopian Airlines Flight ET302 . Flight 8701 was headed for the Southern California Logistics Airport in Victorville, where the plane will be kept in short-term desert storage. As a result, there were no passengers on board the flight. \"The Boeing 737 MAX 8 will be moved to our Orlando maintenance facility for a review,\" Southwest said in a statement. Read more : The Boeing 737 Max is likely to be the last version of the best-selling airliner of all time At the heart of the controversy surrounding the 737 Max is MCAS, the Maneuvering Characteristics Augmentation System. To fit the Max's larger, more fuel-efficient engines, Boeing had to position the engine farther forward and up. This change disrupted the plane's center of gravity and caused the Max to have a tendency to tip its nose upward during flight, increasing the likelihood of a stall. MCAS is designed to automatically counteract that tendency and point the nose of the plane downward. Initial reports from the Lion Air investigation, however, indicate that a faulty sensor reading may have triggered MCAS shortly after the flight took off. Observers fear Ethiopian Airlines flight may have experienced a similar issue. Read more : 53% American adults say they don't want to fly on a Boeing 737 Max Boeing is working on a software update for MCAS along with hardware improvements to get its plane flying again. Here is the FAA's statement in its entirety: \"The crew of Southwest Airlines Flight 8701 , a Boeing 737 MAX aircraft, declared an emergency after the aircraft experienced a reported engine problem while departing from Orlando International Airport in Florida about 2:50 p.m. today. The aircraft returned and landed safely in Orlando. No passengers were aboard the aircraft, which was being ferried to Victorville, Calif., for storage. The FAA is investigating.\"   Get the latest Boeing stock price here.       SEE ALSO:  Boeing quietly unveiled the $442 million airliner that will replace the 747 jumbo jet    FOLLOW US:  On Facebook for more car and transportation content!      NOW WATCH: The founder and CIO of $12 billion Ariel Investments breaks down how his top-ranked flagship fund has crushed its peers over the past 10 years         More:  Boeing 737 Max  Southwest Airlines  BITranspo  BISelect      Boeing  FAA                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       Walmart is quietly closing stores — here's the full list      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}