{"author": "Ellen McGirt", "title": "The Horror Of \"Us\"", "description": "As Jordan Peele's latest film wins big at the box office, its central metaphor plays out in the news", "url": "http://fortune.com/2019/03/26/the-horror-of-us/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/us-movie-lupita-nyongo-4.jpg", "publishedAt": "2019-03-26T18:57:48Z", "content": "                                                The Horror Of \"Us\"                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                        Leadership      raceAhead        The Horror Of \"Us\"                                              By Ellen McGirt  March 26, 2019     If you weren’t among the brave moviegoers who flocked to Jordan Peele’s new feature film Us this weekend, you’re about to run out of time: The movie is so fascinating, multi-layered – and yes, terrifying – that spoilers are quickly popping up everywhere.  The film raked in more than $70 million over the weekend , well past double the opening weekend receipts of Peele’s first film, Get Out, and exceeding the expectations of industry insiders. (Unsurprised Peele fans simply sipped their tea and nodded.) I won’t spoil much of it here except to say that its central metaphor is a powerful one made for modern times: Every American has a double who looks exactly like them, abandoned in an empty subterranean world, who rises up to fight for their freedom and their due.  With that image in mind, I’m going to switch back to the real world and point out that some of us are feeling pretty abandoned right now.  First, there’s Puerto Rico .  Congress expanded food stamp aid to the island after the devastating effects of Hurricane Maria in September 2017. But the federal government missed the deadline to renew that aid earlier this month. And, it seems, lawmakers have been getting strong signals from the administration that no new aid will be coming. Some 43 percent of island residents are now struggling to buy food and other essentials, the island is still owed billions in yet undispersed emergency funds, and residents are now facing cuts to Medicaid. Each of these remedies requires the support of the federal government, which is unlikely to come. “[The President] doesn’t want another single dollar going to the island,” a senior official told The Washington Post.  Then, there’s Pine Ridge.  Recent snow, rain, and related flooding have set off a natural disaster on the Pine Ridge Reservation in South Dakota, which is not looking to clear up any time soon.  Some residents have been stranded as long as two weeks; washed out roads have made it nearly impossible for food, medical, and other supplies to reach them. Volunteers on horseback are delivering essentials when they can, but increasingly, ill, elderly or otherwise desperate residents have been braving the weather and walking for miles to get help.  From the New York Times :    Officials with the Oglala Sioux Tribe, which administers the reservation, say they lack the training, manpower and equipment needed to deal with such a large-scale crisis. And there’s a pervasive sense on Pine Ridge, a place of long-strained relations with the state and federal governments, that help has been woefully slow to arrive, and that few people beyond the reservation know or care much about its plight.    And finally, there are the Muslims next door.  This past Sunday, a mosque in Southern California was set on fire in an attack which was designed to express solidarity with the perpetrator in the March 15 attack on two mosques in Christchurch, New Zealand. The arsonist used an accelerant to fuel the fire set to the Dar-ul-Arqam mosque in Escondido, a city near San Diego, Calif. and left graffiti referencing the New Zealand attack. Thankfully, nobody was killed or injured.  But it sent a message. Hate crimes and other bias-related incidents against U.S. Muslims have ticked-up dramatically in the last few years. According to the Council on American-Islamic Relations , there were 2,213 incidents of anti-Muslim bias in 2016, 260 of which were verified hate crimes. In 2017, 2,599 incidents of bias, including workplace discrimination, of which 300 were hate crimes. This is the highest number since 2009, the year CAIR began keeping track.  Jordan Peele’s latest film examines the deep divisions that stem from our shared history, and the struggle of people who have been cast away in a failed experiment of exploitation. But it doesn’t take a film critic to see how many times these scenes play out in real life, with real people who play the other in our policies, while in fact, they are us.          On Point               Charges dropped against actor Jussie Smollett    Prosecutors have dropped all charges against Empire actor Jussie Smollett today, barely a month after he was charged with 16 counts including disorderly conduct and filing a false police report. There are few details, but there is no plea agreement and no community service will be required.     ABC News      Study: Public colleges recruit from white, wealthy communities    As we continue to unpack the ramifications of the recent college admissions scandal, it’s worth remembering the many legal ways wealthy families game the system. And, it looks like they get a lot of help. A new report from the Joyce Foundation, a nonpartisan foundation that funds policies to advance racial and economic equity in the Midwest, finds that when public colleges recruit out-of-state students, they do so disproportionately from white, wealthy, and often private high schools. The resulting student body doesn’t reflect the population of the states they serve. Perhaps then, “the enrollment priorities of some public research universities are biased against poor students and/or communities of color.”     Inside Higher Ed      A new startup aims to help people fight for their rights in toxic workplaces    After being pushed out of jobs at male-dominated startups, Ariella Steinhorn and Mary Rinaldi joined forces to start Simone, an early stage NY-based startup that helps match people who had been dealing with toxic work environments, or potential discrimination or #MeToo claims with affordable legal and other advice. The company is still a team of two, but they believe they’re on to something. “It gave me all the legwork… I wouldn’t know where to go, and I don’t think this is something you can Google,” said one woman who used Simone to file an EEOC complaint.     Fortune      Deaf activist, actor, and transgender man cast as in DC’s Titans    It’s a milestone in casting says Chella Man, who has been tapped to play the role of mute superhero Jericho in the streaming “Titans” series, which is slated for a second season.  Jericho signs to communicate with his superhero squad. “Jericho’s primary mode of communication hits close to home,” Man told Huffpost via email. “I rarely saw sign language authentically represented on screen growing up, so this incredible opportunity has made my heart soar.” Some 95% of characters with disabilities are played by actors without any. Not that Man feels that any of his own characteristics are limiting, mind you. “Take it from a Deaf, queer, Jewish person of color who has always dreamed of being a superhero and has now been granted that exact opportunity,” he said.     Huffpost         Advertisement        On Background               Take the mic, please. No, really, take it    Professional people live in a world of meetings and conferences, and along with it, the tap-tap-tap of the passed microphone for questions and answers. Is this thing on? Take the mic, says Jessie B. Ramey, an associate professor, and director of the Women’s Institute at Chatham University. When you do that, “naw I’m good,” and belt out your comment, you’re forgetting the hard of hearing colleagues in the room. “When you say you don’t need a microphone, what you’re really saying is that you don’t care that I need you to use one,” she points out. “And that those with hearing loss will speak up for themselves — whether it’s comfortable to do so or not, and no matter how many times we have already had to do that in these same meetings.” Click through for more essential microphone-related inclusion tips.     Chronicle of Higher Education      In praise of Bibaporru, Beep Vaporú, El Bic, El Bix, El Vickisito    Vicks Vaporub, the greasy, odiferous goo that has been a staple in medicine chests for a century, holds an unusually beloved place in many Latinx communities, reports Esmerelda Bermudez. True believers use it for absolutely everything – from handling cuts and stretch marks, to adding a distinct flavor to coffee and tea. “Latinos have created vivaporu  hashtags , memes , emojis , comedy skits and, for those still scratching their heads at the love affair, explanatory videos ,” she say. “Some have written about their nostalgia in dissertations, poems and published essays.” But the simple answer may in fact be the smell. Says one cognitive neuroscientist, the smell may evoke feelings associated with love, of “not of feeling sick, but of being cared for and being soothed.”     Deloitte      Doing the laundry was a nasty bit of business in 1881    In a busy city like Atlanta, black “washerwomen” would pick up dirty clothes and diapers, pile them on their heads and travel to washing sites equipped with cauldrons of boiling water and homemade lye soap. they, they would boil, pound, dry, iron and return the clothes. All, for nearly no money – until one day, the women had enough. The day just happened to fall ahead of the International Cotton Exposition which was being held in the city that year, the centerpiece of which was a boast: Atlanta had a steady and obedient servant class. Because washerwomen lived in black communities and worked together, not in a white home, they could organize. And they sure did: Some 3,000 women went on strike.     Atlanta Journal-Constitution           Quote                Dear Joel: I think it is more difficult these days to define what makes a good citizen then it has ever been before. Certainly all any of us can do is follow our own conscience and retain faith in our democracy. Sometimes it is the very people who cry out the loudest in favor of getting back to what they call ‘American Virtues’ who lack this faith in our country. I believe that our greatest strength lies always in the protection of our smallest minorities. Sincerely yours, Charles M. Schulz.   - —Charles Schultz in a letter to ten-year-old fan, Joel Lipton                   SPONSORED FINANCIAL CONTENT        You May Like                   Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                               Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}