{"author": "Matt Weinberger", "title": "Apple's new no-fee credit card is an aggressive move to control more of your digital life and keep you from switching to Android", "description": "Apple Card is going to be really good for a lot of people. It's also a way for Apple to keep people from leaving iPhone behind for Android.", "url": "https://www.businessinsider.com/apple-card-makes-it-harder-to-switch-to-android-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ae0c4fe19ee8652008b45d3-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Apple's new no-fee credit card is an aggressive move to control more of your digital life and keep you from switching to Android        Matt Weinberger  2h                                                         Apple Card is a new credit card offered in conjunction with Goldman Sachs and designed to work with Apple Pay.  Getty/Michael Short/Stringer             Apple Card , Apple's new credit card, is going to appeal to a lot of users because it promises no fees, better security, and 2% cash back on most purchases, paid out to users daily. It's another new business line for Apple as it looks for ways to generate more revenue from each of its users. Consider also that it's a move that protects against iPhone users switching to Android : It's enough of a pain to ditch iMessage and its blue bubbles; can you imagine having to cancel your credit card, too? Conversely, Apple is offering a higher cash-back rate of 3% on purchases directly from the company, including iCloud, Apple Music, the App Store, and even new iPhones and Macs — giving a strong incentive for users to stick around. In a lot of ways, Apple is the new Microsoft: Where Windows once informed every single decision made by Microsoft, so too does Apple make protecting its flattening iPhone business its first priority. Take, for example, Apple's much-vaunted push into services, which took center stage at an event on its Apple Park campus on Monday morning . New services such as Apple Arcade, Apple News Plus, and Apple TV Plus are all slated to run first, and best, on iPhones and Macs, helping the company squeeze more revenue from every Apple user in the world. And then, there's Apple Card , the new credit card offered in conjunction with Goldman Sachs that's designed to work with Apple Pay. Apart from the obvious profits it stands to make from just getting into the credit-card business, the launch of this card is an intriguing move that hints at how Apple views the state of the smartphone business. If you're feeling charitable, you could reasonably make the argument that Apple is just doing what it always does: taking something that already exists and making it better. Credit cards, generally speaking, are pretty bad; Apple's no-fee, instant-rewards, security-focused alternative seems to be at least a little more humane — on paper, anyway. Read more : Apple's new Apple Card credit card doesn't have any hidden fees or late-payment charges The other way of looking at it is that this is a shrewd business move for Apple. Not only does the company get a toehold in the lucrative financial-services market, but it also makes it that much less appealing to switch from an iPhone to Android. It's one thing to lose the vaunted blue text bubbles that come with Apple's iMessage, but can you imagine having to cancel your credit card just because you bought a new phone? What Apple gets The truth is probably somewhere in the middle. Anecdotally, at least some people seem really excited about the prospect of the Apple Card. It's likely to see considerable uptake, too, given that Apple is likely to heavily promote it to iPhone users once it's available later this year. At the same time, it's worth really considering what Apple gets out all of this. Note that while Apple Card promises 2% cash-back rewards on most purchases , paid out to users on a daily basis, that goes up to 3% for purchases made directly from Apple itself. That means a blanket discount for Apple iCloud, Apple Music, App Store purchases, or even a new Mac or iPhone. So if the hassle of switching is the stick, that amped-up cash-back reward is the carrot. Taken together, they form a very clear picture: With Apple Card, you get rewarded for diving deeper into Apple's whole ecosystem of products and services, and the card simultaneously makes it that much harder to leave. That's important in a world where it gets harder to justify paying the rising price of an iPhone , as midrange Android phones look to be just fine for most people. Apple Card's Daily Cash feature pays out 2% cash-back bonuses on most purchases and 3% rewards on anything bought from Apple. Apple It's not completely dissimilar from what Facebook is doing amid Mark Zuckerberg's grand pivot to private messaging among small groups. By focusing on direct messages and commerce, Facebook is slowly positioning itself as the middleman between you and the real world — across both your social life and your daily spending habits. In so doing, it makes it way more convenient to use Facebook and, therefore, that much harder to stop using it, which is a real concern for the social network in a post-Cambridge Analytica world. Read more : Mark Zuckerberg's vision for Facebook sounds a lot like China, where I couldn't buy a cup of coffee without the app that dominates people's lives there In any case, the Apple Card may be a good and worthwhile opportunity for anybody who finds its benefits appealing. But consider that there ain't no such thing as a free lunch — no matter how much cash you get back from your daily sandwich run — and that this convenience has the hidden cost of giving Apple more power over your digital life.   Learn more: Credit Card Industry and Market Mobile Payment Technologies Mobile Payments Industry Mobile Payment Market, Trends and Adoption Credit Card Processing Industry List of Credit Card Processing Companies List of Credit Card Processing Networks List of Payment Gateway Providers M-Commerce: Mobile Shopping Trends E-Commerce Payment Technologies and Trends       NOW WATCH: 5 animals that have the most extreme sex in the animal kingdom         More:  Apple  Apple Card  iPhone  Android      Apple Pay  Apple event March 2019  Facebook                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       A GOP senator brought a giant picture of Ronald Reagan riding a dinosaur onto the Senate floor to argue against Democrats' Green New Deal      Popular       Trump's national emergency declaration for a border wall survives after House fails to override veto      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}