{"author": "Charlie Wood", "title": "This killer fact shows Apple has a ton of work to do if it's going to seriously challenge Netflix", "description": "Apple faces a major challenge if it wants to rival Netflix in terms of subscribers.", "url": "https://www.businessinsider.com/apple-got-to-do-challenge-netflix-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a5a2277584e6eeb7d2852-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  This killer fact shows Apple has a ton of work to do if it's going to seriously challenge Netflix        Charlie Wood  6m                                                         Apple CEO Tim Cook.  Reuters/Thomas Peter          Apple unveiled its new TV streaming service on Monday, with stars like Oprah Winfrey in attendance at the launch event in California. But the idea that Apple TV is going to challenge Netflix's dominance anytime soon may be fanciful, according to an analyst note from investment bank Nomura. Nomura said Apple will need 8 million subscribers to generate sales of $1 billion. It took Netflix more than a decade to hit 8 million users, while CBS All Access had to wait five years to hit this figure. But Apple has a big ace up its sleeve: Its pre-existing user base. Apple unveiled its much-heralded TV streaming on Monday, with Hollywood royalty like Oprah Winfrey adding some stardust to the launch event at the tech giant's headquarters. The service, called Apple TV+, is being touted as a rival to Netflix , not least because Apple will use splashy original content to hook potential subscribers and reel them in. But the idea that Apple TV is going to challenge Netflix's dominance anytime soon may be fanciful — a reality highlighted in an analyst note from investment bank Nomura. Apple has spent anywhere between $1 billion and $2 billion on shows for Apple TV+, according to various reports. That cash has helped it lure stars like Reese Witherspoon and filmmakers, including Steven Spielberg. To access this content, Nomura estimates that Apple will charge people $10 a month for a subscription. At this price, Apple would need 8 million subscribers to break even at $1 billion, Nomura said — the lower end of what Apple is estimated to have spent on original programming. To put that in some context: It took Netflix more than a decade to hit 8 million subscribers . Founded in 1997, it reached 1 million subscribers in the first quarter of 2003, and did not hit the 8 million mark until the first three months of 2008, according to historical earnings. Read more: Apple has unveiled its long-awaited streaming TV service, Apple TV Plus. Here's how it compares to the other big streaming services, from Netflix to Prime Video. Now, these were the days when Netflix was almost exclusively an online DVD rental store and not the online entertainment behemoth it has now become. Perhaps a fairer example — and indeed the one used by Nomura — is CBS All Access. It took CBS five years to secure 8 million streaming subscribers . It did this two years ahead of schedule, but still, it shows the time it can take to build an online audience in a heavily saturated market. To further highlight the task ahead of Apple in challenging Netflix, the company behind \"Stranger Things\" now adds more than 8 million subscribers a quarter , such is its momentum around the world. That's more than it gained in its first decade of existence. \"We assume profitability will be low,\" was Nomura's somewhat withering final word on Apple TV+. Apple's secret weapon is its giant user base AP Photo/Tony Avelar But Apple has a big ace up its sleeve: Its pre-existing user base. Apple, unlike Netflix, has already gained a vast and near-religious following thanks to the success of products such as the iPhone. Where Netflix had to gain devotees from scratch, Apple already has an army: There were more than 900 million active iPhone users at the end of 2018. Or, as Oprah Winfrey put it: \"They're in a billion pockets, y'all.\" Apple faces an uphill battle if it wants to seriously challenge Netflix. But if Tim Cook and company can somehow mobilise Apple's existing user base it might just stand a chance of toppling the TV streaming industry's Goliath.  This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content.      SEE ALSO:  ANALYSIS: How Apple Card is poised to accelerate Apple's payments business       More:  Apple  Netflix  Nomura  Tim Cook      Oprah Winfrey  Apple TV Plus  BI Prime  Prime                                           Popular       A GOP senator brought a giant picture of Ronald Reagan riding a dinosaur onto the Senate floor to argue against Democrats' Green New Deal      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       Mitch McConnell blocked a resolution to release the full Mueller report, 3 days after saying he wanted 'openness and transparency' about it      Popular       Trump's national emergency declaration for a border wall survives after House fails to override veto      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}