{"author": "Linette Lopez", "title": "A DATE IS SET: A Judge will hear arguments on whether or not Elon Musk is in contempt of court next month", "description": "Musk's contempt charge is related to a tweet he sent falsely claiming that Tesla would make 500,000 cars in 2019. The public figure was 400,000.", "url": "https://www.businessinsider.com/elon-musk-contempt-of-court-hearing-date-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9aa3f609b6031068665517-1920-960.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  A DATE IS SET: A Judge will hear arguments on whether or not Elon Musk is in contempt of court next month        Linette Lopez  4h                                                         Tesla CEO Elon Musk.  AP Photo/Jae C. Hong          A judge will hear oral arguments on whether Tesla CEO Elon Musk is in contempt of a Securities and Exchange Commission ruling on April 4. Musk's contempt charge is related to a tweet he sent falsely claiming that Tesla would make 500,000 cars in 2019. The company has estimated it would make about 400,000 in public filings. Musk got in trouble for making false statements on Twitter last year, when he said he had \"funding secured\" to take Tesla private for $420 per share. He, in reality, did not have funding secured. On April 4, Elon Musk's lawyers (and perhaps Musk himself) will appear for oral arguments in New York City to counter the Securities and Exchange Commission's (SEC) claim that Musk is in contempt of a ruling meant to prevent him from making false statements on Twitter. This latest salvo between the Tesla CEO and the SEC started in February, when Musk tweeted that Tesla would make 500,000 cars in 2019. The company has said in public filings that it would make about 400,000. To the SEC, this incorrect tweet was a violation of a ruling it made against Musk last year, in which it accused Musk of falsely claiming he had \"funding secured\" to take Tesla private at $420 per share in August. That tweet to his powerful 20 million-person Twitter following that allegedly spread false material information forced Musk to step down as Chairman of Tesla's board. Musk and Tesla were each fined $20 million. On top of that, Musk had to appoint a Twitter czar to review tweets containing information material to Tesla's future. Adults don't need a Twitter sitter A day after Musk tweeted that Tesla would make 500,000 cars in 2019, his chief legal counsel (who had been at Tesla for two months) quit. A few days later, the SEC demanded that Musk prove that he was not in contempt of court. To bolster the charge that he was, the SEC not only went back to the tweet but also to an interview Musk did with \"60 Minutes,\" during which he said there was no Twitter czar at Tesla and some \"mistakes\" may be made. Musk responded to the SEC by saying that it was attempting to expand on the terms of its settlement by limiting his speech on Twitter and that, in doing so, it was seeking to violate his First Amendment rights. Musk also said that he has \"diligently attempted to comply\" with the SEC and that the SEC's use of Musk's comments made during a CBS \"60 Minutes\" interview as proof of his violation reflected a \"concerning and unprecedented overreach on the part of the SEC.\" If you have any experience working with Tesla or Elon Musk, give me a shout at llopez@businessinsider.com.   Get the latest Tesla stock price here.       SEE ALSO:  MUSK FILES HIS DEFENSE: Says SEC seeks to violate his First Amendment rights and its filing 'smacks of retaliation and censorship'      NOW WATCH: People are watching YouTubers study for hours and they say the popular trend helps them stay focused         More:  Tesla  Elon Musk  SEC  Contempt Of Court      BITranspo                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}