{"author": "The Economist", "title": "Slower growth in ageing economies is not inevitable", "description": "But avoiding it means tough policy choices", "url": "http://www.economist.com/finance-and-economics/2019/03/26/slower-growth-in-ageing-economies-is-not-inevitable", "urlToImage": "https://cdn.static-economist.com/sites/default/files/images/2019/03/articles/main/20190330_fnd000.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "     Topics Sections Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network Media Audio edition Economist Films Podcasts About The Economist Subscribe Log in or sign up Manage subscription Log In Forgot password? New to  The Economist ? Sign up now Activate your digital subscription Manage your subscription Renew your subscription Search Topics Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition Audio edition Economist Films Podcasts The Economist apps More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network About The Economist Subscribe Free exchange Slower growth in ageing economies is not inevitable But avoiding it means tough policy choices Business and finance Mar 26th 2019 FOR THE first time in history, the Earth has more people over the age of 65 than under the age of five. In another two decades the ratio will be two-to-one, according to a recent analysis by Torsten Sløk of Deutsche Bank. The trend has economists worried about everything from soaring pension costs to “secular stagnation”—the chronically weak growth that comes from having too few investment opportunities to absorb available savings. The world’s greying is inevitable. But its negative effects on growth are not. If older societies grow more slowly, that may be because they prefer familiarity to dynamism. Ageing slows growth in several ways. One is that there are fewer new workers to boost output. Workforces in some 40 countries are already shrinking because of demographic change. As the number of elderly people increases, governments may neglect growth-boosting public investment in education and infrastructure in favour of spending on pensions and health care. People in work, required to support ever more pensioners, must pay higher taxes. But the biggest hit to growth comes from weakening productivity. A study published in 2016, for example, examined economic performance across American states. It found that a rise of 10% in the share of a state’s population that is over 60 cuts the growth rate of output per person by roughly half a percentage point, with two-thirds of that decline due to weaker growth in productivity. Get our daily newsletter Upgrade your inbox and get our Daily Dispatch and Editor's Picks. Why are older economies less productive? The answer is not, as one might suppose, that older workers are. Though some capabilities, notably physical ones, deteriorate with age, the overall effect is not dramatic. A study of Germany’s manufacturing sector published in 2016 failed to detect a drop-off in productivity in workers up to the age of 60. Companies can tweak employees’ roles as they get older in order to make best use of their comparative advantages, such as extensive experience and professional connections. Furthermore, if weak productivity growth was caused by older workers producing less, pay patterns should reflect that. Wages would tend to rise at the beginning of a career and fall towards its end. But that is not what usually happens. Rather, according to a recent paper by economists at Moody’s Analytics, a consultancy, wages are lower for everyone in companies with lots of older workers. It is not older workers’ falling productivity that seems to hold back the economy, but their influence on those around them. That influence is potent: the authors reckon that as much as a percentage point of America’s recent decline in annual productivity growth could be associated with ageing. How this influence makes itself felt is unclear. But the authors suggest that companies with more older workers might be less eager to embrace new technologies. That might be because they are reluctant to make investments that would require employees to be retrained, given the shorter period over which they could hope to make a return on that training for those near the end of their careers. Or older bosses might be to blame. Research indicates that younger managers are more likely to adopt new technologies than are older ones. This may seem obvious: older people’s greater aversion to new technology is a cliché. And at least anecdotally, greying industries do seem more averse to change. If the evidence suggested that ageing economies struggled primarily because of slow-growing labour forces and fast-growing pension costs, it would make sense to focus policy efforts on keeping people in work longer—by raising retirement ages, for example. But if, as seems to be the case, reticence to embrace new technologies is a bigger issue, other goals should take priority—in particular, boosting competition. In America, increasing industrial concentration and persistently high profits are spurring renewed interest in antitrust rules. The benefits of breaking up powerful firms and increasing competition might be even bigger than thought, if conservative old firms are thereby spurred to make better use of newer technologies. There are other measures that could help. Removing barriers to job-switching, for example by making benefits more portable, could shorten average tenures and help stop companies’ cultures becoming ossified. Best of all would be more immigration. An influx of young foreign workers would address nearly all the ways in which population ageing depresses growth. It would not only expand the labour force and create new taxpayers, but would mean more and younger companies, and greater openness to new technologies. And there would be plenty of willing takers in poorer countries with younger populations. No men for old country Societies with lots of older workers are also societies with lots of older voters, however. Those voters are, on average, more politically conservative than younger people, and less likely to support increased immigration. People of all ages would gain from policies that boosted growth and productivity. But given the choice between a dynamic but unfamiliar society and a static but familiar one, older countries tend to opt for the second. In hindsight, the demographic boom that coincided with industrialisation in rich countries may have had an underappreciated benefit: it created a big constituency in favour of embracing new technologies and the opportunities they provided. Technology may at some point overcome the stifling effect of ageing. In a new paper Daron Acemoglu of the Massachusetts Institute of Technology and Pascual Restrepo of Boston University find that when young workers are sufficiently scarce, manufacturers invest in more automation, and experience faster productivity growth as a result. Robots have yet to make a big impact in the service sector and beyond, but as their capabilities improve and jobs for younger people go begging that may change. The world could use more flexibility and productivity now. But stagnation may end eventually, once the robots are promoted to management. Business and finance Mar 26th 2019 Reuse this content About The Economist Apple Prime time With iPhone sales slowing, Apple bets on video, gaming, news and a credit card The company takes on tech giants, Hollywood and banks Free exchange Slower growth in ageing economies is not inevitable Asterix’s village Another day in the life of “a Europe that protects” Charlemagne’s notebook Daily chart Energy consumption increased at a record rate in 2018 When it's a matter of opinion, make your opinion matter Subscribe now Each week, over one million subscribers trust us to help them make sense of the world. Join them. Subscribe  to The Economist today or Sign up  to continue reading five free articles Subscribe Group subscriptions Contact us Help Keep updated Subscribe to The Economist newsletters Sign up to get more from The Economist Get 5 free articles per month, daily \n newsletters and more. About The Economist Advertise Reprints Careers Media Centre Published since September 1843 to take part in “a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.”  Terms of Use Privacy Cookie Policy Manage Cookies Accessibility Modern Slavery Statement Copyright © The Economist Newspaper Limited 2019 . All rights reserved.                ", "category": "business"}