{"author": "Amanda Macias", "title": "Trump taps Air Force general to lead US Space Command", "description": "President Donald Trump has nominated U.S. Air Force General John \"Jay\" Raymond to lead the U.S. Space Command, a new combatant command that will oversee the military's missions and war fighting in space.", "url": "https://www.cnbc.com/2019/03/26/trump-taps-air-force-general-to-lead-us-space-command.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/26/105815812-15536383923634347143.1910x1000.jpg", "publishedAt": "2019-03-26T22:23:02Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Defense     Business    Earnings    Transportation    Defense    Materials      Trump taps Air Force general to lead US Space Command    President Donald Trump has nominated U.S. Air Force General John \"Jay\" Raymond to lead the U.S. Space Command, a new combatant command that will oversee the military's missions and war fighting in space. As the Air Force's top space officer, Raymond was long-considered a favorite for the job. The latest revelation comes as the Pentagon works to lay the groundwork for Trump's proposed Space Force, a new service branch that would stand alongside the Navy, Marine Corps, Army and Air Force.      Amanda Macias | @amanda_m_macias   Published 4 Hours Ago  CNBC.com              U.S. Air Force photo U.S. Air Force Gen. Jay Raymond, commander of Air Force Space Command, addresses the 34th Space Symposium in Colorado Springs, Colorado, April 17, 2018.   WASHINGTON – President Donald Trump has nominated U.S. Air Force General John \"Jay\" Raymond to lead the U.S. Space Command, a new combatant command that will oversee the military's missions and war fighting in space.   As the Air Force's top space officer, Raymond was long-considered a favorite for the job. He is currently the commander of Air Force Space Command at Peterson Air Force Base in Colorado Springs, Colorado. If confirmed by the Senate for this newly established role, Raymond will run both U.S. Space Command and Air Force Space Command.  The latest revelation comes as the Pentagon works to lay the groundwork for Trump's proposed Space Force, a new sister service branch that would stand alongside the Navy, Marine Corps, Army and Air Force. However, the creation of a sixth military branch, the first in 72 years, is dependent upon congressional approval.   Unlike the creation of a Space Force, the Pentagon can establish a U.S. Space Command without input from lawmakers.  Meanwhile, the Defense Department is asking for $14.1 billion in its fiscal 2020 budget request to fund space operations . The $14.1 billion would allocate funding to several national security programs, from satellites to missile warning systems. Of the total, about $1.6 billion will fund improvements to space-based missile warning capabilities, a missing link in America's layered missile defense system.  The Air Force is also seeking $72.4 million to establish a headquarters for Space Force.          Amanda Macias National security reporter                                      html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}