{"author": "Dawn Giel", "title": "Ex-UBS broker first to be sentenced in fraudulent Puerto Rico bond sales scheme", "description": "Jose Ramirez, who is known to many in Puerto Rico as \"The Whopper\" pleaded guilty in November for his role in a scheme to fraudulently get clients to misuse credit lines to purchase securities.", "url": "https://www.cnbc.com/2019/03/26/ex-ubs-broker-sentenced-in-fraudulent-puerto-rico-bond-sales-scheme.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/15/104901596-Still1211_00012.1910x1000.jpg", "publishedAt": "2019-03-26T20:30:53Z", "content": "                                                         html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Finance     Banks    Hedge Funds    Deals and IPOs    Wall Street      Ex-UBS broker first to be sentenced in fraudulent Puerto Rico bond sales scheme    Jose Ramirez will be the first former UBS Puerto Rico employee to serve jail time for their role in the scheme, which centered on sales of the firm's proprietary closed-end bond funds. From January 2011 through September 2013, Ramirez advised his clients to improperly borrow money in order to invest in UBS Puerto Rico bond funds. The sales generated approximately $1.2 million in commissions. A CNBC investigation in December 2017 found that UBS was not forthcoming with its clients and brokers about the extent of the risks associated with its proprietary bond funds.      Dawn Giel   Published 5 Hours Ago  Updated  4 Hours Ago  CNBC.com              CNBC San Juan, Puerto Rico.   WASHINGTON — A former top broker in Puerto Rico for the Swiss banking giant UBS was sentenced to a year and a day in prison Tuesday, months after he pleaded guilty to criminal bank fraud for pocketing $1 million in commissions in a scheme that saw many investors lose their life savings.   Jose Ramirez will be the first former UBS Puerto Rico employee to serve jail time for a role in the scheme, which centered on sales of the firm's proprietary closed-end bond funds.  In a near-empty courtroom in DC federal court, Ramirez asked Judge Thomas F. Hogan for leniency.   \"I'm not here to blame anyone else,\" Ramirez, a 60-year-old father of three, told the judge. \"I ruined my record, my life and the lives of those who looked up to me.\"  The sentence was shorter than the 33-month maximum recommended by the government. Judge Hogan also ordered two years of supervised release, a $500 fine and granted Ramirez's request to voluntarily report to prison.  \"I'm faced with a human being who has admitted his wrongdoings, and I think is remorseful for his actions,\" Judge Hogan said.  Ramirez, who is known to many in Puerto Rico as \"The Whopper\" pleaded guilty in November 2018 for his role in a scheme to fraudulently obtain and misuse credit lines to purchase securities.  \"UBS terminated the employment of Mr. Ramirez in January 2014, following an internal investigation that determined (1) he had permitted or encouraged clients to engage in improper conduct, and (2) had provided misleading responses to firm management when questioned about it,\" Peter Stack, a spokesman for UBS, said in an emailed statement  According to the government, from January 2011 through September 2013, Ramirez advised his clients to improperly borrow money in order to invest in UBS Puerto Rico bond funds. The sales generated approximately $1.2 million in commissions.     'Broken Bonds'   The use of the credit lines to purchase securities was not allowed by UBS Puerto Rico. However, Ramirez contends that he was not the only broker whose clients used the loans to purchase securities. He alleges in his sentencing memorandum that UBS \"was fully aware of the transactions\" and \"issued letters to at least seven financial advisors for knowing, allowing, or encouraging\" the scheme.  Ramirez has been the only person prosecuted for the involvement in the scheme to date. The sales generated commissions when the credit lines were drawn down at UBS's Utah subsidiary and then again when the clients used the money to invest in the closed end funds managed by Ramirez.  These highly levered funds were chock full of Puerto Rico bonds. By the end of June 2013, two separate bonds accounted for more than 90 percent of the net assets in 10 of UBS funds.  At its peak, UBS had the largest wealth management business in Puerto Rico, representing an estimated 20,000 households.  A CNBC investigation in December 2017 found that UBS was not forthcoming with its clients and brokers about the extent of the risks associated with its proprietary bond funds sold to residents on the island, even as the values of the funds plummeted.  By 2012, UBS investors on the island had about $10 billion invested in the funds, or roughly 10 percent of the island's gross domestic product .  In 2013, the bottom fell out of the Puerto Rico bond market, which caused a steep drop in the value of the bond funds. Many customers were forced to sell their bonds funds because they had no other available assets to meet account maintenance calls. That created significant losses.  According to the government, the market collapse ultimately exposed Ramirez's scheme.  Later that year, in August, the Financial Industry Regulatory Authority permanently barred him from acting as a broker or associating with a broker-dealer firm after he failed to cooperate with regulators during his on-the-record testimony. According to court documents, Ramirez didn't answer the regulator's questions because he had invoked his Fifth Amendment right under the U.S. Constitution. He also asserted his constitutional right to remain silent in the legal proceedings for the SEC's civil case.     Breaking silence   Ramirez finally broke his silence this past Saturday when he named seven individuals, he alleges were either involved in, had knowledge of, or encouraged the transactions of the scheme.  In his sentencing memorandum, Ramirez singled-out: Doel Garcia, a UBS executive, Ramiro Colon, a UBS Puerto Rico branch manager and his former supervisor, Carlos Ubinas, the chairman and president of UBS Puerto Rico, as well as four current or former UBS Puerto Rico brokers: David Lugo, Fernando Castillo, Leslie Highley and Luis Sanchez.  In response to these allegations, a spokesman from UBS said: \"In its sentencing papers, the DOJ described Mr. Ramirez's offense as 'brazen', found that he took various steps to 'circumvent' UBS controls and to 'obscure' from UBS what he was doing, and found that Mr. Ramirez 'took advantage of all parties involved.' In light of these findings, Mr. Ramirez's last-ditch efforts to blame his victims for his own criminal conduct should be seen for what it is: an attempt to escape responsibility for his own wrongdoing.\"  CNBC reached out to lawyers or representatives of these individuals.  Cory Jacobs, the trial attorney for the U.S. government, \"flatly objected\" to the assertion that Ramirez was made a \"scapegoat\" for the scheme.  \"UBS did an internal investigation that identified the defendant as the hub of the fraud,\" Jacobs told Judge Hogan. He also said that people would go into UBS and ask for \"the whopper special.\"  Jacobs told the Judge that Ramirez had cooperated with the government during its investigation, but that the evidence and information he provided wasn't enough for the government to prove beyond a reasonable doubt that other bankers were knowingly engaged in the fraudulent conduct.  UBS added in its statement to CNBC, \"UBS refutes any insinuation of wrongdoing by any of the people he has tried to implicate.\"  A lawyer for Lugo said, \"Mr Lugo did not engage in the activities for which Mr. Ramirez was charged, and to which Mr. Ramirez pled guilty. Nor was Mr. Lugo ever even charged with conducting such activity. Mr. Lugo's employment arbitration against UBS-PR was settled to the satisfaction of both UBS-PR and Mr. Lugo.\"  UBS has previously settled with FINRA and the SEC for roughly $34 million for charges involving the sales practices of the bond funds and failure to supervise.  UBS has also paid out nearly $480 million to clients in FINRA settlements and awards as of January, with over 800 cases against UBS Puerto Rico still pending, according to data compiled by SLCG.  In addition, the Swiss bank has disclosed in regulatory filings an ongoing investigation by the Department of Justice into the impermissible reinvestment of loan proceeds, in regard to the Puerto Rico funds. UBS says they are cooperating with the authorities.  With reporting by Leslie Picker and Scott Zamost﻿          Dawn Giel Reporter                                      html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}