{"author": "Bradley Saacks", "title": "Top Wall Street firms have started disclosing a new risk to their own businesses: sexual harassment", "description": "Financial firms that include the word \"harassment\" in their annual report's risks section have more than doubled this year compared to 2018.", "url": "https://www.businessinsider.com/metoo-a-new-added-risk-for-banks-insurance-companies-asset-managers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9a46c88e436a6b9935aa58-1136-568.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Top Wall Street firms have started disclosing a new risk to their own businesses: sexual harassment        Bradley Saacks  33m                                                         A crowd at the Women's March on Washington, DC on January 21, 2017.  Shannon Stapleton/Reuters          Financial firms like JPMorgan Chase, Aflac, KKR, Blackstone, and Och-Ziff Capital all added #MeToo language to their most recent annual reports, warning investors about potential company harm from harassment. Before 2018, the word \"sexual\" had only been mentioned once in the risk section a publicly traded financial company's annual report. So far in 2019, it has been in nine different financial companies' public filings. Even though the # MeToo movement has not brought the same reckoning on the finance industry as it has on Hollywood, politics, media, and other sectors, banks, insurance agencies, and hedge funds are still thinking about the risks of a possible scandal. Or, at least, their lawyers are. Public financial companies have significantly stepped up the use of several #MeToo words and phrases in their 2018 annual reports, according to a review of 10K filings by data company Sentieo, specifically in their sections focused on risks facing their businesses. While the word \"sexual\" wasn't listed as a risk factor for any financial companies in 2017, by the next year it appeared in filings for three such companies. So far in 2019, the word has appeared in nine companies' 10-Ks' risk section. The use of the word \"harassment\" has also increased. In 2017 and 2018, it appeared in seven finance firms' annual reports each year. So far in 2019, it has more than doubled, to 15 financial services companies. The updated language in companies' annual reports show that the impact of the movement is being closely monitored by the top brass of the financial industry. Companies that have added the word \"sexual\" to their risk sections over the last two years include: private equity giants KKR and Apollo Global Management; insurance company Aflac; and Ken Moelis's investment bank, Moelis & Co. Major companies like JPMorgan Chase, Carlyle Group and Blackstone were among the firms that have added \"harassment\" to their risk factors this year. Shayanne Gal/Business Insider \"We have seen #MeToo push out quite a few executives since the wave started so we are not surprised to see language around the topic make its way in SEC filings,\" said Nick Mazing, director of research at Sentieo. The movement, which started in 2017, has brought the alleged sexual misconduct of powerful men like Matt Lauer, Harvey Weinstein, Charlie Rose, and others to light. While there have been isolated incidents in the finance industry , the movement has had an impact on workplace culture, like a reluctance to have one-on-one meetings with women and a cutback in corporate holiday parties . Venture capital firms and investment banks have also pushed to add in a \" Weinstein clause \" to contracts to protect investments into companies that are then plagued by sexual harassment scandals. See more: D.E. Shaw fired a high-profile hedge-fund manager after an investigation into alleged inappropriate behavior, and now he's fighting back Some firms are more #MeToo targeted than others. Blackstone and Carlyle's risk factors sections added the language to focus on companies the private equity firms invest in potentially violating \"anti-harassment\" laws, but did not mention the firms' own employees. JPMorgan added in a line that said the firm could be in trouble if employees \"engaged in discriminatory behavior or harassment\" — a catch-all statement that would protect against a variety of potential scandals. See more: Hedge funds are watching a key lawsuit involving LinkedIn to see if they can spend billions on web-scraped data Yet other additions are more clearly #MeToo related. Och-Ziff Capital Management specifically tweaked its language to include a line on employee misconduct and other \"inappropriate or unlawful behavior\" that is \"directed to other employees.\" Apollo Global Management added a line to its annual report saying \"sexual harassment\" by employees, sub-contractors or consultants could hurt the company's brand and reputation \"regardless of ultimate outcome\" because of the headline risk. Moelis states that \"sexual harassment\" by employees would hurt not only the firm's recruitment of clients but also talent retention due to negative publicity. \"It is not always possible to deter employee misconduct, and there can be no assurance that the precautions we take to prevent and detect misconduct will be effective in all cases,\" Moelis' most recent annual report reads. The companies named above either declined to comment or did not respond to requests for comment except for Aflac, which said in a statement that \"we regularly review our disclosures to reflect the current business environment in a variety of ways. We believe that this is a responsible approach and will continue to pursue it going forward.\" The disclosures, says Charles Elson, director of the John L. Weinberg Center for Corporate Governance at the University of Delaware, are an acknowledgement of the \"business environment right now.\" \"It's protection against securities fraud,\" he said. \"If something does happen, you don't want investors coming to you and saying 'why didn't you warn us about this.'\" And don't expect the language to be removed from filings if the movement dies down, said Greg Kramer, a partner at Haynes and Boone who focuses on securities law. The focus on adding #MeToo-related clauses to public filings is reminiscent to him of how companies added language about sleazy accounting practices that resulted in several corporate scandals in the late 1990s and early 2000s. \"Companies adopted internal accounting controls to prevent these type of accounting practices to happen again, while also listing out in their public filings that this is a risk,\" Kramer said. \"The most important thing here is for companies to have strong policies and procedures around this type of action so they can prevent something like this from happening.\" Sign up here for our weekly newsletter Wall Street Insider, a behind-the-scenes look at the stories dominating banking, business, and big deals.  This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content.      NOW WATCH: Watch Apple debut its own no-fee credit card         More:  BI Prime  Shayanne Gal  BI Graphics  JP Morgan Chase      #MeToo campaign  Blackstone Group  KKR  Ken Moelis  Dan Och                                           Popular       A GOP senator brought a giant picture of Ronald Reagan riding a dinosaur onto the Senate floor to argue against Democrats' Green New Deal      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       Trump's national emergency declaration for a border wall survives after House fails to override veto      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}