{"author": "David Choi", "title": "'People love it when you attack the press': Trump reportedly gloats with Republicans after end of Mueller's Russia investigation", "description": "Trump reportedly suggested to Republican lawmakers not to leak information from the private meeting. It leaked anyway.", "url": "https://www.businessinsider.com/trump-gloats-with-gop-after-end-of-mueller-investigation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b91e1d68905f2f91e8b4e44-2560-1280.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  'People love it when you attack the press': Trump reportedly gloats with Republicans after end of Mueller's Russia investigation        David Choi  31m                                                         President Donald Trump listens as the crowd cheers at a campaign rally at the Big Sandy Superstore Arena on August 3, 2017 in Huntington, West Virginia.   Justin Merriman/Getty Images           President Donald Trump again renewed his attacks on the news media, days after special counsel Robert Mueller's Russia investigation ended, and praised Attorney General William Barr, The New York Times reported on Tuesday night. \"I love the [attorney general],\" Trump reportedly said during a luncheon with Republican senators. \"He works fast. I love this guy. You told me I would.\" \"People love it when you attack the press,\" he added, according to The Times. Trump reportedly suggested to the group not to leak information from the luncheon. President Donald Trump again renewed his attacks on the news media and praised Attorney General William Barr for his \"fast\" work at the Justice Department, a person with knowledge of his remarks said in a New York Times report published Tuesday. \"I love the [attorney general],\" Trump reportedly said during a luncheon with Republican senators. \"He works fast. I love this guy. You told me I would.\" \"People love it when you attack the press,\" Trump said, according to The Times. Trump reportedly asked the group not to leak information from the luncheon. The president has been publicly gloating in the days since the Justice Department delivered a summary of the special counsel Robert Mueller's Russia investigation. Barr's four-page summary said Mueller \"did not establish\" that Trump or his campaign conspired to collude with Russia during the 2016 US presidential election. However, Mueller declined to answer the question of whether Trump obstructed justice in the course of the investigation, instead leaving that for the Justice Department to answer. Barr and the Deputy Attorney General Rod Rosenstein concluded that the evidence Mueller gathered during the investigation was \"not sufficient to establish ... an obstruction-of-justice offense.\" The public has not yet seen Mueller's findings, and there are still many unknowns about what the special counsel discovered over the course of the nearly two-year-long investigation. The inquiry has led to the indictments and convictions of several people who worked with Trump and his 2016 campaign — as well as several Russian nationals. Trump and his allies have relished in his recent slew of political victories , including the arrest of one of his fiercest opponents, attorney Michael Avenatti. Additionally, Trump's plan to divert unspent military funds to finance his border barrier was green-lit after the Senate failed to obtain a two-thirds majority vote to override his first presidential veto.      SEE ALSO:  Trump responds to Mueller report summary: 'Total EXONERATION'      NOW WATCH: Meet the stylist who turned LeBron James into a fashion icon         More:  Donald Trump  robert mueller  special counsel                                      Popular       Pilots in the Lion Air 737 Max crash tried to prevent it by hitting a switch again and again, unaware there were 3 other steps they needed to take, report says      Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}