{"author": "The Economist", "title": "Liberty of theological expression is challenged from left and right", "description": "Bad news for a Canadian conservative and an Ulster liberal", "url": "http://www.economist.com/erasmus/2019/03/25/liberty-of-theological-expression-is-challenged-from-left-and-right", "urlToImage": "https://cdn.static-economist.com/sites/default/files/20190330_BLP501.jpg", "publishedAt": "2019-03-25T14:22:07Z", "content": "     Topics Sections Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network Media Audio edition Economist Films Podcasts About The Economist Subscribe Log in or sign up Manage subscription Log In Forgot password? New to  The Economist ? Sign up now Activate your digital subscription Manage your subscription Renew your subscription Search Topics Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition Audio edition Economist Films Podcasts The Economist apps More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network About The Economist Subscribe Erasmus Religion and public policy Free speech and higher education in the UK Liberty of theological expression is challenged from left and right Bad news for a Canadian conservative and an Ulster liberal Erasmus Mar 25th 2019 by ERASMUS HERE ARE two stories about religion, free speech and higher education in the United Kingdom. Both make troubling news for anyone who thinks that students should be exposed to a broad range of ideas, including some they won’t agree with. One concerns a global celebrity, the other a man who is relatively little known outside his own specialist world. Jordan Peterson, a Canadian psychology professor and conservative culture warrior, revealed on March 20th that an invitation to take up a visiting fellowship at Cambridge University had been withdrawn. The University’s Divinity Faculty confirmed the decision in a laconic statement: “We can confirm that Jordan Peterson requested a visiting fellowship, and an initial offer has been rescinded after a further review.” Get our daily newsletter Upgrade your inbox and get our Daily Dispatch and Editor's Picks. Mr Peterson had quite a lot more to say about the matter. He recalled that he had visited the British city of Cambridge last autumn and made a successful appearance at a famous debating society. He had also had some enjoyable conversations with members of the Divinity Faculty which made him think that collaborating with them might be beneficial for one of his longer-term projects: a series of commentaries on the Hebrew scriptures which had already attracted millions of followers. (With his pronouncements on self-help and his appeal to relatively old-fashioned ideas about gender, the professor reaches far more people through the internet than will ever crowd into a lecture room.) He had some quite caustic things to say about the decision to disinvite him. ...It is deeply unfortunate that the authorities at the Divinity school in Cambridge decided that kowtowing to an ill-informed, ignorant and ideologically-addled mob trumped participating in an extensive online experiment in mass Christian and psychological education. Given the continued decline of church attendance, the rise in atheistic or agnostic sentiment, the increasing irrelevance of theological education and the collapse in interest in such mattters among young people, wiser and more profound decisions might have been made. Ideologically addled or otherwise, the Cambridge University Student Union hailed news of the dis-invitation, saying, “[Mr Peterson’s] work and views are not representative of the student body and...we do not see his [potential] visit as a valuable contribution to the University, but one that works in opposition to the principles of the University.” Mr Peterson dismissed this statement as barely intelligible. As it is, the Cambridge Divinity Faculty has always encompassed a wide range of metaphysical beliefs, from Christian to Muslim to agnostic. At Queen’s University Belfast, by contrast, the teaching of theology to undergraduates has at least until recently been delegated to one Christian denomination. The Union Theological College, a Presbyterian-run institution, has been responsible for delivering theology classes and hence for deciding who will teach that subject. A liberal-minded minister-cum-academic, Laurence Kirkpatrick, has just been fired from his post at the institution where he has worked for 22 years. The Presbyterian professor has been in dispute with the college since a radio interview he gave in June 2018 when he said its teaching staff were almost entirely elderly and male (“we must look like escapees from an old people’s home”) and also questioned the church’s increasingly hard-line teaching on same-sex relationships. (At the time, Northern Ireland’s Presbyterians were in the process of loosening links with their Scottish brethren in protest at the latter’s increasingly gay-friendly stance. Mr Kirkpatrick said: “I’d be broken-hearted if anyone said I’d been bigoted against a Catholic or gay student.”) This led to his suspension; in the last few days he has been formally dismissed. Apparently because of concerns about the way Mr Kirkpatrick was being treated, Queen’s University suspended the introduction of new students to the college last December. That could be a step towards the complete severance of connections between the University and the theological outfit. The professor said he was told by the college that he had been responsible for “fracturing” its relationship with the university. His radio interview had brought both the college and the Presbyterian church into “disrepute”, according to his letter of dismissal. He has said he will appeal to the Employment Tribunal. What Mr Peterson and Mr Kirkpatrick have in common is that both have confronted boldly the reality that theology in its conventional form is of little interest to young people. They may have rather different ideas on how that lacuna should be filled. But in both cases, there are people who do not want them to be given a hearing. Next Finding a new equilibrium after Christchurch won’t be easy Erasmus Mar 25th 2019 by ERASMUS Reuse this content About The Economist Apple Prime time With iPhone sales slowing, Apple bets on video, gaming, news and a credit card The company takes on tech giants, Hollywood and banks Free exchange Slower growth in ageing economies is not inevitable Asterix’s village Another day in the life of “a Europe that protects” Charlemagne’s notebook Daily chart Energy consumption increased at a record rate in 2018 When it's a matter of opinion, make your opinion matter Subscribe now Each week, over one million subscribers trust us to help them make sense of the world. Join them. Subscribe  to The Economist today or Sign up  to continue reading five free articles Subscribe Group subscriptions Contact us Help Keep updated Subscribe to The Economist newsletters Sign up to get more from The Economist Get 5 free articles per month, daily \n newsletters and more. About The Economist Advertise Reprints Careers Media Centre Published since September 1843 to take part in “a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.”  Terms of Use Privacy Cookie Policy Manage Cookies Accessibility Modern Slavery Statement Copyright © The Economist Newspaper Limited 2019 . All rights reserved.                ", "category": "business"}