{"author": "Troy Wolverton", "title": "This $100M software startup came out of Australia and got funded by Microsoft to help companies manage all their remote workers", "description": "Skedulo is helping companies manage a variety of employees, from insurance auditors and home healthcare workers to clowns.", "url": "https://www.businessinsider.com/skedulo-sees-opportunity-helping-companies-manage-remote-workers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9427af2cc74007b004bc97-1920-960.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  This $100 million software startup came out of Australia and got funded by Microsoft to help companies manage all their remote workers        Troy Wolverton  2h                                                         Skedulo CEO Matt Fairhurst.  Skedulo          Six years after its founding in Australia, Skedulo has offices in three continents and 60,000 people using its service. The startup charges companies a monthly per-user fee to help them manage remote workers. Skedulo recently raised $28 million from investors, including Microsoft's M12 venture arm. For many workers, a 9-to-5 office job is a thing of the past — if they ever experienced it at all. A large and growing number of people work remotely or out in the field, at least some of the time. Managing such a decentralized workforce can be a logistical nightmare, particularly as the number of remote workers a company employs grows larger. But a San Francisco startup has created a service that's designed to ease managers' pain. Skedulo offers an online scheduling service that allows companies to manage remote workers, keeping track of their hours, directing them to particular clients or customers, and providing them a means to send information, such as electronic signatures, back to the home office. The company offers a version of the service that corporate administrators can use back at headquarters and a mobile app for the remote workers themselves. \"For most people, we've become the operating system for their day,\" Matt Fairhurst, Skedulo's CEO, told Business Insider in a recent interview. Skedulo's service is replacing paper and white boards Although the remote workforce has been exploding in recent years across many industries, there haven't been many good technological solutions for companies to manage their off-site workers, Fairhurst said. Many companies that have adopted Skedulo's service were previously using Excel spreadsheets, calendar apps, custom software they created themselves, and even white boards and paper, he said. Read more: 9 traditional fields that are hiring more remote workers than ever \"This is a brand new category from a technology perspective,\" Fairhurst, who also cofounded the company, said. \"It's actually rarely the case that we're going in and ripping out alternative applications that were used to manage this process.\" Skedulo helps managers match up remote workers who have particular skills with customers in need of that expertise. Its service can do that automatically for certain companies or industries where that's a good match, Fairhurst said. Or it can just make it easier for managers to manually make those pairings in cases where automation isn't the best solution, he said. \"We're not assuming every company can deploy full optimization or automation all the time,\" he said. \"But it is a really important part of what we do.\" Skedulo's service, for which it charges customers a monthly per-user fee, hooks into other kinds of enterprises and management software and services, including Workday, ServiceNow, and Salesforce. It also can be customized and configured for particular industries. It's being used to schedule insurance auditors and clowns The company, which was founded in 2013 in Australia, has about 60,000 people using its service in countries and areas including Australia, the US, and Europe, Fairhurst said. Although Skedulo's service is used across several different industries, it's found particularly strong uptake in the home healthcare business, he said. Such companies represent more than 30% of Skedulo's customer base, he said. But the company has also seen strong adoption in the business-services sector and in training and education, he said. \"We've done everything from help companies schedule clowns to go into a hospital to juggle for sick kids all way to insurance auditors doing claims management in the field,\" Fairhurst said. With the remote workforce continuing to grow, the company sees a big opportunity ahead of it. And investors do, too. Earlier this month, Skedulo closed a $28 million Series B funding round that was led by M12, the name of Microsoft's in-house venture fund. The money, which brought the company's total funding to $40.5 million, gave it a valuation of more than $100 million, according to PitchBook. Skedulo, which has about 120 employees, plans to use the funds to bulk up its sales and marketing teams, which are mainly based in San Francisco, and its product and engineering teams, which are in Brisbane, Australia, and Ho Chi Minh City, Vietnam, Fairhurst said. \"We want to make sure we're building a team to support the demand we're seeing in the market,\" he said. Skedulo has an \"audacious mission,\" he continued, \"of touching every desk-less and mobile worker.\" Got a tip about a startup or other tech company? Contact this reporter via email at twolverton@businessinsider.com, message him on Twitter @troywolv , or send him a secure message through Signal at 415.515.5594. You can also contact Business Insider securely via SecureDrop . Read more about startups: The CEO of billion-dollar startup Airtable says it could go public any time it wants. Here's why he doesn't want to. Here's the pitch deck a Virginia startup used to raise $6 million after seven years of bootstrapping its business Here's the pitch deck AI startup Skymind just used to scoop up $11.5 million in funding Here's how Airtable raised $160 million last year — and got a valuation of about $1 billion — without a pitch deck  This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content.      SEE ALSO:  The era of the all-powerful tech CEO has only just begun, even though Facebook and Snap show why that's a bad thing      NOW WATCH: People are watching YouTubers study for hours and they say the popular trend helps them stay focused         More:  Enterprise Software  BI Prime  Skedulo  Venture Capital      Remote Workers  M12                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}