{"author": "Brittany Shoot", "title": "European Parliament Votes to Let the Sun Go Down on Daylight Saving Time", "description": "The European Union's Parliament voted to do away with Daylight Saving Time (DST) across EU member states starting in 2021.", "url": "http://fortune.com/2019/03/26/european-union-parliament-daylight-saving-time/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-73508058-e1553639978208.jpg", "publishedAt": "2019-03-26T22:40:54Z", "content": "                                                European Parliament Votes to Let the Sun Go Down on Daylight Saving Time                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Briefing      Daylight Saving Time        European Parliament Votes to Let the Sun Go Down on Daylight Saving Time                                            By Brittany Shoot  March 26, 2019       European Parliament has voted to end Daylight Saving Time in European Union-member nations by the year 2021, according to The Verge . After that year, individual EU-member states will have to decide whether they stick with DST or standard time.  Daylight saving time is when we roll clocks back one hour so the sun rises and sets at a later time in the day. Some of the ideas behind the century-old practice of switching to DST include having more daylight working hours and saving energy, but some recent studies have shown that modern-day time changes don’t do much for energy bills or the environment. However, changing time twice a year does seem to have an impact on public health, with people reporting more sleep problems and auto accidents becoming more common after the biannual time shift.    While Daylight Saving Time used to switch at the same time, Europe and the United States change the clocks at different times of the year thanks to new rules enacted in 2007 by President George W. Bush. But if enough Americans are as fed up with turning the clocks backwards and forwards every spring and fall, time changes could be a thing of the past in the U.S. as well. States and territories including Arizona, Hawaii, and Puerto Rico, have already opted out of Daylight Saving Time. And President Donald Trump has tweeted his support for permanent Daylight Saving Time , which has been suggested in legislation introduced by Florida lawmakers.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}