{"author": "Alyssa Pagano, Rob Ludacer", "title": "Marie Antoinette's pearl pendant sold for a record-breaking $32 million. Here's why pearls are so expensive.", "description": "Marie Antoinette's pearl pendant went for $32 million at auction. Pearls come in many different colors and sizes which help determine their value.", "url": "https://www.businessinsider.com/pearls-cultured-natural-jewelry-value-expensive-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8be04669e11c611231dde4-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                            Marie Antoinette's pearl pendant sold for a record-breaking $32 million. Here's why pearls are so expensive.        Alyssa Pagano and Rob Ludacer  5h                                                                 The most expensive natural pearl ever sold was Marie Antoinette's pendant . It went for $32 million in a 2018 Sotheby's auction. Celebrities like Rihanna , Uma Thurman , and Cardi B all adorned themselves in pearls for last year's Met Gala . Pearls come in many different colors and sizes, and these variables help determine their value. Following is a transcription of the video. Narrator: Pearls have been a symbol of elegance and class for centuries. The Maharajas of India and European queens adorned themselves with pearls, a symbol of their prestige. At 2018's Catholic Church-inspired Met Gala, celebrities walked the red carpet dripping in pearls. Uma Thurman's dress had over 3,000 white pearls sewn to it, while Rihanna's pope-inspired outfit was encrusted in pearls. At the 2019 Grammys, Cardi B was basically dressed like an oyster. The most expensive pearl ever sold was Marie Antoinette's pendant. It sold for $32 million in a 2018 auction. But what is it that makes pearls so expensive? Marie Antoinette's pearl was part of a diamond-studded pendant, and it has important historical significance, which increased its value. But there are several other factors that determine the value of a pearl. Tom Moses: Assessing the value of a pearl is probably the most complex gem to assess. Narrator: That's Tom Moses. He's a gemologist at the Gemological Institute of America where he oversees diamond grading, colored stone identification, and pearl identification. He says that part of the reason the Marie Antoinette pearl is worth so much is because it's a natural pearl, which brings us to one quality that determines a pearl's value. Natural versus cultured. Natural pearls are hard to find. They're rare, and this makes them worth more money. But let's rewind for a second. What is a natural pearl, and how are they formed? Natural pearls form when some kind of irritant, usually a small organism, makes its way into the shell of a mollusk like an oyster or a mussel. To protect itself from the invader, the mollusk starts to coat the debris with nacre, or mother-of-pearl, the same material that lines the inner layer of its shell. It continues doing this, and the irritant grows into a shiny pearl. Cultured pearls are formed by the same process, but instead of the irritant entering the shell accidentally, it's put there intentionally by a human. Pearl farmers insert a piece of mollusk tissue, which is called donor tissue, into the shell of the oyster where they want the pearl to grow. This triggers the oyster's defense response, and it starts coating that piece of tissue with nacre. The vast majority of pearls on the market are cultured pearls. The Gemological Institute of America uses X-rays to tell if a pearl is natural or cultured. If you look closely at these two images, you can see the difference. Moses: Think about the layers of an onion. So a natural pearl would have all of those concentric layers of growth from the very inside out. Narrator: A cultured pearl, on the other hand, is like an orange, with a large center and a thinner layer of pearl growth around that. The large center is the manmade irritant placed in the shell to encourage nacre formation. Cultured pearls date all the way back to around 500 AD in China. However, in 1893, the Japanese-born Kōkichi Mikimoto streamlined the process and eventually created perfectly round pearls. Today, Mikimoto is widely considered the grandfather of cultured pearls. He used Akoya pearls, which are the traditional white round pearls you're probably familiar with. By the 1920s, cultured pearls became more commercially available, which made them more affordable and accessible to people who weren't royalty. But just because you can grow a cultured pearl doesn't mean it's an easy process. Pearl farmers pry open the mollusk shell just enough to implant the piece of foreign tissue, then they put the oysters back in the water and wait anywhere from six months to two years for pearls to form, and not every pearl comes out the same, which brings us to another quality that can make one pearl worth more than another. Size. Moses: The larger the pearl, the more valuable, just like any other gem. Narrator: The size of the pearl largely depends on the size of the mollusk. Certain oysters grow bigger than others and can, therefore, make bigger pearls. For example, Akoya pearls can only grow to about 9 or 10 millimeters in diameter, but South Sea pearls and black Tahitian pearls can reach a diameter of around 15 or 16 millimeters. The larger size makes South Sea pearls and black pearls the most valuable type of pearl. On Mikimoto's website, this strand of South Sea cultured pearls is selling for $32,000. The other notable difference between pearl types is the color. Sometimes this goes hand in hand with size because the pearl's color is determined mostly by the mollusk it comes from. Tahitian black pearls are black because the inside of the Pinctada margaritifera oyster is black, but colors can vary slightly based on the culturing process as well. Moses: The main reason for the color difference is the species of the mollusk. Another very interesting influence is when a pearl is cultured, there is a donor tissue used from another living mollusk, and depending on the color of that tissue, it will influence the color of the final cultured pearl. Narrator: Take for example Akoya pearls. These are all white pearls, but the shade of white can still vary. Some strands might be slightly more pink, while others have more of a greenish tint. Tom says that pinker pearls are typically preferred over green hues. Along with size and color, the shape and surface of a pearl can have an impact on its value. Typically the rounder and smoother, the better. And finally, perhaps the hardest variable to measure: luster. Luster is essentially the way a pearl reflects light. The shinier the pearl, the better. But it's hard to tell how shiny a pearl is unless you have other pearls to compare it to. That's why Tom and the rest of the Gemological Institute have a collection of sample strands for comparison. That way they can look at how one strand of pearls compares to another and see where it falls on the luster scale. The quality of a pearl's luster is influenced by the layers of nacre that coat the center. One way to think of it is like the tiles of a roof. Picture a roof with all the tiles lined up so that everything fits together well. If you translate that to a pearl, it would result in a nice, high-luster pearl. A dull, low-luster pearl would be more like a roof with broken and fragmented tiles that don't line up. When you take into consideration all of these factors, finding or creating the perfect pearl is an art, and the fact remains they're grown inside an animal, so it's impossible to have complete control over how and when they form, especially in the wild. So if you ever bite down on something hard while you're eating an oyster, take a look at it before you chuck it. It might be more than a piece of sand.                    Most Popular Videos            Bud Light's 'Dilly Dilly' just made a comeback at the Super Bowl with a weird crossover ad with Game of Thrones — here's what the phrase means            There are serious health reasons why you shouldn't eat your boogers            Meet the three women who married Donald Trump            Earth's north magnetic pole is on the move — here's what will happen when our poles flip            Amazon will pay $0 in federal taxes this year — here's how the $793 billion company gets away with it          Most Recent Videos            A YouTuber has created a way to drive a car from the roof            Everyone's talking about foldable phones, but a few things need to happen before people start buying them            The NCAA brings in $1 billion a year — here's why it refuses to pay its college athletes            Watch Oprah and Tim Cook debut Apple's original-video service: Apple TV+            Watch Apple's March 2019 'Show Time' event in 13 minutes                                   Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}