{"author": "Brian Schwartz", "title": "Pete Buttigieg to attend 2020 fundraiser hosted by Broadway mogul Jordan Roth", "description": "Mayor Pete Buttigieg is attending a 2020 fundraiser hosted by Broadway executive Jordan Roth and his husband, movie producer Richie Jackson in New York.", "url": "https://www.cnbc.com/2019/03/26/pete-buttigieg-attending-broadway-mogul-jordan-roth-2020-fundraiser.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/20/105804227-1553089062028gettyimages-1129476258.1910x1000.jpeg", "publishedAt": "2019-03-26T22:57:40Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Politics     White House    Policy    Defense    Congress    Elections    Europe    China    Asia    World      Pete Buttigieg to attend 2020 fundraiser hosted by Broadway mogul Jordan Roth    South Bend, Indiana Mayor Pete Buttigieg is attending a 2020 fundraiser hosted by Broadway executive Jordan Roth and his husband Richie Jackson, according to an invite first obtained by CNBC. The suggested contributions for the event range from $250 to $2,800. Roth is the son of real estate titan Steven Roth, who has a net-worth of $1.1 billion.      Brian Schwartz | @schwartzbCNBC   Published 3 Hours Ago  Updated  48 Mins Ago  CNBC.com              Callaghan O'Hare | Bloomberg | Getty Images Pete Buttigieg, the mayor of South Bend, Indiana, and 2020 presidential candidate, pauses during the South By Southwest (SXSW) conference in Austin, Texas, U.S., on Saturday, March 9, 2019.   Mayor and 2020 hopeful Pete Buttigieg is making inroads into the New York donor circuit as he prepares to attend a campaign fundraiser hosted by Broadway executive Jordan Roth.   Roth, and his husband, Richie Jackson, who is a movie producer, will be holding a reception for the South Bend, Indiana mayor with suggested contributions from $250 to $2,800, according to an invite first obtained by CNBC .  Roth is the president and majority owner of Jujacmyn Theaters, which has presented a litany of award-winning Broadway shows including \"The Book of Mormon\" and \"Springsteen on Broadway.\" He's also the son of billionaire and real estate titan Steven Roth, who, according Forbes, has a net-worth of $1.1 billion.   The elder Roth, however, is a staunch supporter of Republican causes. He recently invested $100,000 into President Donald Trump's joint fundraising committee, Trump Victory and the same amount toward former House Speaker Paul Ryan's organization, Team Ryan.  For Buttigieg, an openly gay candidate for president and Afghanistan War veteran, the fundraiser represents a sign that he is making traction with donors and voters alike.  In a recent Emerson poll, the South Bend mayor picked up 11 percent of the vote in the early caucus state of Iowa. Nationally, Buttigieg has totaled 2 percent of the vote from Democratic primary voters, according to data compiled by Morning Consult. Notably, Buttigieg tied in that same poll with Minnesota Sen. Amy Klobuchar.  A spokeswoman for Buttigieg did not return a request for comment. Roth did not return an email seeking comment.                  Brian Schwartz Politics and Finance Reporter for CNBC.com                                      html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                  ", "category": "business"}