{"author": "David Slotnick", "title": "AmEx Platinum cardholders get automatic elite status at Marriott and Hilton — here's what that unlocks at thousands of hotels around the world", "description": "If you have the AmEx Platinum Card, you can automatically get Gold status at Marriott and Hilton hotels. Here are the perks you get.", "url": "https://www.businessinsider.com/amex-platinum-gold-status-hotel-benefits-hilton-marriott-starwood-2018-8", "urlToImage": "https://amp.businessinsider.com/images/5b803516959f34ee318b4939-480-240.jpg", "publishedAt": "2019-03-25T00:00:00Z", "content": "                         Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE           Edition                Prime    Intelligence     A vertical stack of three evenly spaced horizontal lines.     Edition   International Editions:    United States  US         International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                       BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation        Finance    Markets  Retail  Your Money  Markets Insider        Politics    Military & Defense  News        Strategy    Careers        Life    Entertainment  Travel  Sports        All       Coupons    Target  Walmart  EBay  Nike  Container Store            BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE           Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES            Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                           AmEx Platinum cardholders get automatic elite status at Marriott and Hilton — here's what that unlocks at thousands of hotels around the world        David Slotnick  2m                                      Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independent and objective. American Express/Instagram If you have the Platinum Card® from American Express , you can automatically get Gold elite status in the Marriott Bonvoy and Hilton Honors loyalty program without having to stay a certain number of nights. Even if you stay in hotels just five or six nights a year, the perks that come with Gold status can be particularly valuable, ranging from extra points to free breakfast. Read on to see the benefits you can get. The US version American Express Platinum Card offers a tremendous amount of value for cardholders , despite a large $550 annual fee. For instance, during my first year with the card, I got more than $2,000 in value , netting me more than three times the value of the annual fee. In addition to perks like airport-lounge access and travel credits, one big benefit of the Platinum Card is that just by holding it you're eligible for complimentary mid-tier elite status in the Marriott Bonvoy and Hilton Honors hotel loyalty programs. Without the Platinum Card , you'd generally need to spend at least 25 nights in Marriott hotels to earn Gold status in the Bonvoy, or a whopping 40 nights (or 20 stays) in Hilton hotels to earn Hilton Honors Gold. While the benefits of elite status are obviously more useful the more you use them — so the more often you stay in hotels — the status you get from the Platinum Card can still be worthwhile even if you just spend five or so nights in hotels each year. Just make sure to link your card to your loyalty accounts to activate the status. While both hotel statuses are called Gold, there are actually some pretty big differences between the benefits that this level of status comes with at each brand. Keep in mind that we're focusing on the rewards and perks that make the Platinum Card a great option, not things like interest rates and late fees, which can far outweigh the value of any rewards — plus, the Platinum Card is a charge card, meaning you have to pay the balance off in full each month. When you're working to earn credit-card rewards, it's important to practice financial discipline, like paying your balances off in full each month, making payments on time, and not spending more than you can afford to pay back. Basically, treat your credit card like a debit card . Marriott Bonvoy Marriott Bonvoy Gold status includes many valuable perks. Marriott As part of Marriott's merger with Starwood, the two brands' separate loyalty programs were brought under a unified set of benefits in August, and were officially combined this winter. With the unified program came revised benefits for each status level. Here's what you can get with Marriott Bonvoy Gold status from your Platinum Card (keep in mind that you'll have to book directly with the hotel to get your elite benefits, not through a third-party site). You can also get complimentary Gold status from the Marriott Bonvoy Brilliant™ American Express® Card . 25% bonus points on each stay This is fairly self-explanatory. You'll get a 25% bonus on every point you earn during your stay — this includes the points you earn on your room, plus the ones you earn when you charge incidentals to your room, such as the hotel restaurant or spa services. Room upgrades This benefit is pretty self-explanatory too. When you check in, you'll get an upgraded room type as long as there's availability. This can mean you get more space, a better view, or some other improvement. Late checkout As long as there's availability in the hotel, you can get a checkout time as late as 2 p.m. as a Gold elite member. Just make sure to request it at the front desk. Welcome gift When you check in for your stay, you'll get 250 to 500 bonus points as a thank you. It's not huge, but it's a nice way to help pad your points balance. Complimentary premium internet access in the room This one can be especially useful. When you have Gold status and log into the hotel's in-room WiFi network, you'll get the enhanced-speed option at no charge. Hilton Honors Hilton’s Waldorf Astoria luxury brand took over operation of the Mandarin Oriental in Las Vegas in August. Hilton Hilton Honors as a reward program has undergone some changes over the past few years, but generally I find it to be a useful program. Its Gold level comes with a handful of extremely valuable perks, of which I'm definitely a fan. Keep in mind you can also get complimentary Gold status with the Hilton Honors Ascend Card, or Diamond status with the Aspire Card . Here's what you get: 80% bonus points While Hilton points are generally worth a bit less than Marriott points — though not by that much anymore — Hilton makes up for this and more with a higher bonus on your earned points. Like with Marriott Bonvoy, this includes just about every room charge. Free breakfast This is a big one — enough that I often lean toward staying at Hilton hotels more than Marriott ones Hotel breakfasts can be expensive, but sometimes it's the best option — especially if you want to maximize your vacation time. As a Gold member, you and a travel companion who's in the same room as you can get a free breakfast every morning. The savings from this can add up quickly, especially since the continental-breakfast buffet can be $20 or more per person. Late checkout The details on this benefit are a bit ambiguous, but as a Hilton Honors Gold member, you can get a late checkout time on request, subject to availability. Fifth reward night free Anytime you book a four-night stay using points, you can stay for a fifth night for free. Obviously this can be an excellent benefit if you're saving up points for a vacation — you'll have enough for your stay sooner. Two free bottles of water There's nothing quite as frustrating as checking into your room, tired and thirsty after a long flight or drive, and grabbing a water bottle waiting for you on your nightstand only to realize it's a wildly inflated hotel-minibar price. If you're a Gold elite member, there's nothing to worry about — two water bottles are free. Room upgrade You'll get a room upgrade when you check in if it's available. While this generally excludes executive suites, some hotels will give you a top upgrade anyway. Keep in mind that you may need to ask for the upgrade. Learn more about the AmEx Platinum Card from Insider Picks' partner The Points Guy.   Disclosure: This post is brought to you by the Personal Finance Insider team. We occasionally highlight financial products and services that can help you make smarter decisions with your money. We do not give investment advice or encourage you to adopt a certain investment strategy. What you decide to do with your money is up to you. If you take action based on one of our recommendations, we get a small share of the revenue from our commerce partners. This does not influence whether we feature a financial product or service. We operate independently from our advertising sales team. If you have questions or feedback, we'd love to hear from you. Email us at yourmoney@businessinsider.com. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independent and objective.       SEE ALSO:  I got more than $2,000 worth of value from the American Express Platinum credit card in my first year — despite its $550 annual fee       More:  Insider Picks Credit Cards  Platinum Card from American Express  Marriott Rewards  Starwood Preferred Guest      Credit Card Rewards  American Express  Credit Cards  Hotels  Hilton Honors  Hilton Hotels  PFI TPG                                           Popular       Rob Gronkowski saved his entire $54 million career earnings in the NFL by following one simple money rule      Popular       A British Airways flight from London to Germany took off in the wrong direction and landed in Scotland, 525 miles from its destination      Popular       Apple’s big event was much different than any other, and it’s a sign that the company is moving in a new direction      Popular       Apple's new Apple Card credit card doesn't have any hidden fees or late-payment charges      Popular       Avocados are being recalled in 6 states because of listeria contamination — here's how worried you should be                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US         International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}