{"author": null, "title": "Magazine | Fortune", "description": "Read the latest stories about Magazine on Fortune", "url": "http://fortune.com/magazine/", "urlToImage": "http://fortune.com/img/misc/og-default.png", "publishedAt": null, "content": "                                                Magazine      Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                     Magazine         See More                          Workers and Retirees Alike Are Paying More for Health Care     Out-of-pocket costs are rising at a steady clip for both workers on employe...  Out-of-pocket costs are rising at a steady clip for both workers on employer-sponsored plans and Medicare beneficiaries.                          How Medicare for All Could Eliminate the $600 Billion Private Insurance Industry     Democrats running for President have the industry on edge.  Democrats running for President have the industry on edge.                     The 'Apple of Housewares' Tests Its Products to the Extreme. Here's How     Simplehuman, the high-end home-essentials maker, takes product testing seri...  Simplehuman, the high-end home-essentials maker, takes product testing seriously. The obsession appears to be paying off.                     Spotify Wants You to Listen to Less Music     Why podcasts equal profit.  Why podcasts equal profit.                        Why Your Next Cocktail Will Be Premixed     Sacrificing the craft of cocktails for speed.  Sacrificing the craft of cocktails for speed.                        The Global Electric-Car Showdown Is Officially on in China     Tesla, General Motors, and Volkswagen are betting big on the world’s larges...  Tesla, General Motors, and Volkswagen are betting big on the world’s largest market for electric vehicles. But the country’s domestic manufacturers, like BJEV, have a huge head start.                        Buying Stock in Tech Building Blocks     In the cloud-computing era, companies that make APIs—connectivity tools for...  In the cloud-computing era, companies that make APIs—connectivity tools for coders—are emerging as big winners.              Most Popular Stories                                  Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}