{"author": "The Economist", "title": "Energy consumption increased at a record rate in 2018", "description": "That bodes ill for climate change", "url": "http://www.economist.com/graphic-detail/2019/03/26/energy-consumption-increased-at-a-record-rate-in-2018", "urlToImage": "https://cdn.static-economist.com/sites/default/files/images/2019/03/articles/main/20190330_woc112.png", "publishedAt": "2019-03-26T00:00:00Z", "content": "     Topics Sections Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network Media Audio edition Economist Films Podcasts About The Economist Subscribe Log in or sign up Manage subscription Log In Forgot password? New to  The Economist ? Sign up now Activate your digital subscription Manage your subscription Renew your subscription Search Topics Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition Audio edition Economist Films Podcasts The Economist apps More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network About The Economist Subscribe Daily chart Energy consumption increased at a record rate in 2018 That bodes ill for climate change Mar 26th 2019 MATHEMATICAL MODELS of climate change predict that the severity of natural disasters will increase as the world warms. The cyclone that hit Mozambique on March 14th, killing perhaps 1,000 people, has further focused attention on the risks posed by rising temperatures. Even so, the man-made carbon emissions that drive global warming continue to grow. According to a new report from the International Energy Agency (IEA), a think-tank based in Paris, energy-related CO2 emissions rose by 1.7% last year, to 33.1 gigatonnes. The increase, of 560 metric tonnes compared with 2017, was equivalent to a full year’s worth of emissions from international aviation. Carbon emissions have been driven higher by increasing demand for all types of energy. Broadly speaking, changes in energy demand track the fortunes of the world economy. Robust global GDP growth of 3.7% last year caused energy demand to rise by some 2.3%, its fastest pace for a decade. And although energy efficiency did improve and use of renewable sources did increase—solar power generation rose by 31%—these gains were dwarfed by the growth in the use of fossil fuels, which accounted for 70% of the rise in global energy consumption. Get our daily newsletter Upgrade your inbox and get our Daily Dispatch and Editor's Picks. Burning of coal, the most egregious source of carbon, accounted for a third of the growth in emissions. A new generation of coal-fired power plants in Asia was responsible for nearly all the additional global demand. Those power plants are expected to remain active for another 40 years. Much more encouragingly, and despite President Donald Trump’s advocacy for America’s coal industry, America’s abundant supply of natural gas has led firms rapidly to switch from coal to gas power. Natural-gas consumption in the United States increased by 10% last year, equivalent to Britain’s total annual consumption. Perhaps the most worrying finding in the report is the threat of a feedback loop between severe weather events and carbon emissions. According to the IEA, a hotter-than-average summer and colder-than-average winter led to greater use of heating and air conditioning, which together were responsible for about half of the rise in energy demand in America and roughly a fifth of the worldwide increase. If humans keep burning fuel to shield themselves from extreme temperatures, and the emissions produced by that activity cause temperatures to become ever more extreme, the worst-case scenarios for climate change are more likely to materialise. Mar 26th 2019 Reuse this content About The Economist Apple Prime time With iPhone sales slowing, Apple bets on video, gaming, news and a credit card The company takes on tech giants, Hollywood and banks Free exchange Slower growth in ageing economies is not inevitable Asterix’s village Another day in the life of “a Europe that protects” Charlemagne’s notebook Daily chart Energy consumption increased at a record rate in 2018 When it's a matter of opinion, make your opinion matter Subscribe now Each week, over one million subscribers trust us to help them make sense of the world. Join them. Subscribe  to The Economist today or Sign up  to continue reading five free articles Subscribe Group subscriptions Contact us Help Keep updated Subscribe to The Economist newsletters Sign up to get more from The Economist Get 5 free articles per month, daily \n newsletters and more. About The Economist Advertise Reprints Careers Media Centre Published since September 1843 to take part in “a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.”  Terms of Use Privacy Cookie Policy Manage Cookies Accessibility Modern Slavery Statement Copyright © The Economist Newspaper Limited 2019 . All rights reserved.                ", "category": "business"}