{"author": "Sonam Sheth, John Haltiwanger", "title": "Prosecutors left a trail of breadcrumbs about Trump's finances, and House Democrats are now digging deeper", "description": "Trump said investigators would cross a \"red line\" if they delved into his finances. House Democrats are doing just that.", "url": "https://www.businessinsider.com/house-democrats-trump-finances-mueller-sdny-hints-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9937f086d56e5a6838a912-2732-1366.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  Prosecutors left a trail of breadcrumbs about Trump's finances, and House Democrats are now digging deeper        Sonam Sheth and John Haltiwanger  2h                                                         President Donald Trump.  Reuters          The special counsel Robert Mueller's work is over, but his investigation's end does not mean President Donald Trump's legal woes are done. House Democrats have taken a keen interest in digging deeper into Trump's finances, using clues from the Mueller probe and investigations by federal prosecutors in New York. Among other issues, House Democrats are zeroing in on obtaining Trump's tax returns while scrutinizing the Trump Organization and the president's inaugural committee. Prosecutors investigating President Donald Trump and his finances left a trail of breadcrumbs that House Democrats are picking up on after the special counsel Robert Mueller wrapped up his work on the Russia investigation last week. Mueller was tasked with investigating Russia's interference in the 2016 US election and whether the Trump campaign coordinated with Moscow to tilt the race in his favor. Encompassed in that investigation was the FBI's counterintelligence inquiry into whether Trump is acting as a Russian agent. As part of the counterintelligence probe, Mueller's team was known to have examined Trump's business dealings to determine whether he had any financial interests related to Russia that could affect his ability to conduct US policy. Trump maintains that he has no financial links to Russia. \"I don't make money from Russia,\" he said in 2017. Read more : Here's a glimpse at Trump's decades-long history of business ties to Russia The comment appears to stand in contrast to those made by Trump's eldest son, Donald Trump Jr., in a 2008 New York Times op-ed . The younger Trump wrote, \"In terms of high-end product influx into the US, Russians make up a pretty disproportionate cross-section of a lot of our assets ... We see a lot of money pouring in from Russia.\" Eric Trump said the same to a reporter . He later backtracked and said the Trump Organization's funding came as a result of \"incredible cash flow.\" Pablo Martinez Monsivais/Associated Press Federal prosecutors probe Trump Organization, Trump Tower Moscow negotiations, and the Trump inaugural committee Mueller's team demonstrated an interest in the Trump Organization when prosecutors subpoenaed documents from the company last year. Most significantly, prosecutors also asked several witnesses about the Trump Organization's negotiations to build a Trump Tower in Moscow. Those negotiations took place at the height of the 2016 campaign, and Justice Department veterans told INSIDER that prosecutors likely asked about the project to gauge whether there was any quid pro quo in which the Trump campaign offered to soften the US's stance toward Russia in exchange for the Kremlin's approval for the project. Then there's the lingering mystery of why Alfa-Bank, one of the largest banks in Russia, was looking up the address of the Trump Organization's computer server nearly every day during the 2016 campaign. Between May and September 2016, Alfa-Bank looked up the Trump Organization's domain more than 2,000 times, according to The New Yorker. Read more : The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says In a separate case that Mueller referred to the Southern District of New York (SDNY), federal prosecutors implicated Trump in campaign-finance violations related to hush-money payments that his former lawyer Michael Cohen facilitated to two women who said they had affairs with Trump. Michael Cohen. AP Photo/Julie Jacobson Cohen pleaded guilty to several counts of tax evasion, bank fraud, and campaign-finance violations as part of the SDNY's investigation. While Trump was not specifically named in the charging document, he is widely believed to be the person whom prosecutors referred to as \"Individual-1\" in the court filing, which legal experts say makes the president an unindicted coconspirator. New York federal prosecutors have also recently signaled an interest in Trump's inaugural committee. Cohen is still cooperating with prosecutors in the SDNY's investigation, as well as other ongoing criminal inquiries. But he shed more light on Trump's financial dealings during a blockbuster hearing before the House Oversight Committee last month. Read more : The 8 biggest takeaways from Michael Cohen's blockbuster testimony against Trump In addition to implicating Trump Jr. and Allen Weisselberg, the Trump Organization's chief financial officer, in \"garden variety financial fraud\" related to the hush-money payments, Cohen also said it was possible Trump may have inflated or deflated the value of his financial assets for insurance and tax purposes. Rep. Jerrold Nadler in 2007. Reuters 'We're not leaving any stone unturned' House Democrats have seized on Mueller's and the SDNY's findings, as well as Cohen's testimony, to launch a sprawling inquiry into every aspect of Trump's life: his campaign, his business, his defunct charity, his personal affairs, his inaugural committee, and more. House Democrats have also zeroed in on Trump's tax returns , which have still not been made public. \"We're not leaving any stone unturned,\" one congressional aide on the House Judiciary Committee, which is conducting the investigation, told INSIDER on Tuesday. This person added that House Judiciary Committee Chairman Jerry Nadler believes getting Mueller's full report on the Russia investigation — as opposed to Attorney General William Barr's concise summary — is crucial to determining the motivations behind the myriad contacts between Trump associates and Russians, as well as why Trump has shown deference to Russian President Vladimir Putin since the campaign. Read more : Mueller turned his final report in to Attorney General William Barr, but the Russia probe is nowhere near finished House Democrats are not limited by the same rules as the special counsel's office, and unlike prosecutors in New York, they do not face any jurisdictional constraints. Rep. Adam Schiff. Getty Images In early February, House Intelligence Committee Chairman Adam Schiff announced a sweeping probe into the president's finances, including potential ties to Russia but also well beyond that — including possible money laundering by the Trump Organization. \"Our job involves making sure that the policy of the United States is being driven by the national interest, not by any financial entanglement, financial leverage or other form of compromise,\" Schiff said in announcing the expansive investigation. Schiff and other top Democrats are looking into why German-based Deutsche Bank was willing to lend the Trump Organization money for many years, even as other banks had turned it down. \"The concern about Deutsche Bank is that they have a history of laundering Russian money,\" Schiff said in December . \"And this, apparently, was the one bank that was willing to do business with the Trump Organization.\"      SEE ALSO:  Here's a glimpse at Trump's decades-long history of business ties to Russia      NOW WATCH: What serving in the military taught beauty YouTuber Jackie Aina         More:  robert mueller  Mueller investigation  Russia  Donald Trump      New York  Russia investigation  Russia Newsletter  mueller report  mueller probe  House Judiciary Committee  House Intelligence Committee  Adam Schiff  Jerry Nadler                                           Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       A mysterious syndrome that makes marijuana users violently ill is starting to worry doctors      Popular       NATO will lose its next air war to Putin's 'formidable beasts' if it waits for the F-35 to save it                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}