{"author": "Adam Lashinsky", "title": "Why Apple's New Services Will Succeed Even if They Don't Impress", "description": "Apple invited Oprah Winfrey and other stars to debut its Apple TV+ video streaming service. It also showed a credit card and gaming play.", "url": "http://fortune.com/2019/03/26/apple-services-arcade-card-tv-plus/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1132806316-e1553605360166.jpg", "publishedAt": "2019-03-26T15:34:54Z", "content": "                                                Why Apple's New Services Will Succeed Even if They Don't Impress                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Commentary      Apple        Why Apple's New Services Will Succeed Even if They Don't Impress                                            By Adam Lashinsky  11:34 AM EDT       This article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here .  Zack Van Amburg, an Apple executive for not quite two years, already has mastered the company’s art of aspirational dissembling. Monday morning, he helped announce the technology giant’s yet-to-launch Apple TV Plus subscription product with a show of force and money that included Steven Spielberg and Oprah Winfrey. “It’s not just another streaming service,” he declared. He was partly right: Amazon Prime, Netflix , Hulu, HBO Go, and others have apps and pricing plans. So far Apple TV Plus has neither. Other than that, Apple’s looked quite similar.  In fact, Apple unveiled nothing at its big event that others haven’t done before. Its credit card offers cash back . That’s not new. (As I was reading a New York Times review of the day I saw an ad for a Capital One “unlimited 2% cash back” offer.) Apple bought its way into offering oodles of magazines in its subscription Apple News Plus product, though it didn’t mention Texture, the magazine industry joint venture it purchased last year. Apple obviously hasn’t re-invented television; its offerings, while exciting, are top-flight conventional programs bought at auction with the best money that iPhone profits can buy. Apple’s most exciting idea of the day may have been the resuscitation of Oprah’s book club.    The cognoscenti sniffed at Apple’s bid for services greatness. Breakingviews, in a dismissive report titled “Spray and pray,” said Apple is “paving a trail of mediocrity.” Fortune ’s Rick Tetzeli lamented that Apple showed only its power and not its creativity of old. On Wall Street, Apple’s stock fell back 1%, while rival Roku (roku)  jumped ahead 5% .  The critics may be right. It’s also possible they are missing the point. I suspect Apple can in fact buy a seat at the television-production table and then sufficiently feed its eventual TV service. Its news aggregation service, which pays news organizations for their work, is certainly better than what Facebook and Google have been paying. If Apple makes using a credit card brain-dead easier than it already is, I suspect it will succeed there, too.  Greatness is tough to achieve, and Apple (aapl) may not be after it anyway. Reigniting growth is the imperative right now.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}