{"author": "The Economist", "title": "Why Prosur is not the way to unite South America", "description": "Attempts at regional integration always seem to stumble over politics", "url": "http://www.economist.com/the-americas/2019/03/23/why-prosur-is-not-the-way-to-unite-south-america", "urlToImage": "https://cdn.static-economist.com/sites/default/files/images/print-edition/20190323_AMD001_0.jpg", "publishedAt": "2019-03-21T15:41:10Z", "content": "     Topics Sections Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network Media Audio edition Economist Films Podcasts About The Economist Subscribe Log in or sign up Manage subscription Log In Forgot password? New to  The Economist ? Sign up now Activate your digital subscription Manage your subscription Renew your subscription Search Topics Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition Audio edition Economist Films Podcasts The Economist apps More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network About The Economist Subscribe Bello Why Prosur is not the way to unite South America Attempts at regional integration always seem to stumble over politics  Print edition | The Americas Mar 21st 2019 I T IS NOT often that a country pulls out of an international organisation of which it is the host. Yet that is what Ecuador’s president, Lenín Moreno, did on March 13th. Ecuador joined six other countries who have withdrawn from the South American Union (Unasur), a talking shop which once included all 12 of the continent’s nations, criticising it for the “perverse politicking of the self-styled 21st-century socialists”. For good measure he said he wants his country to repossess Unasur’s gleaming, cantilevered $65m headquarters near Quito, opened in 2014 and paid for by his predecessor, Rafael Correa, calling it “an ode to waste”. He wants to turn it into a university for indigenous people. Mr Moreno is among several South American presidents who may go to Santiago on March 22nd to launch a replacement for Unasur called Prosur. This is a brainchild of Iván Duque, Colombia’s new conservative president, and his Chilean counterpart, Sebastián Piñera, of the centre-right. Unveiling the idea in January, Mr Duque said that rather than a bureaucratic organisation, Prosur will be a “co-ordination mechanism” supporting democracy and the market economy. Mr Piñera has invited all but one of the 12 countries. The exception is Venezuela. Get our daily newsletter Upgrade your inbox and get our Daily Dispatch and Editor's Picks. Prosur is a sign of the changing political climate in South America. After a period of hegemony for the left, of various strands, the region has swung to the right in recent elections. Yet, far from being an answer to regional disunity, Prosur looks like a restatement of the problem: that in Latin America regional institutions have become hostage to ideology and ephemeral political alignments. They rarely work to forward the co-operation that would be in the lasting interest of all their members. It was precisely these faults that doomed Unasur, a good idea traduced by misguided political leadership. Its origins lay in a Brazilian wish to talk about cross-border transport and energy projects. By the time it was formally constituted by treaty in 2008, those practical aims had succumbed to the overlapping ambitions of two leftist presidents, Brazil’s Luiz Inácio Lula da Silva and Venezuela’s Hugo Chávez, to create a body devoted to political solidarity and defence co-operation, implicitly against the United States. Unasur’s last secretary-general, Ernesto Samper, a former Colombian president, told Bello in 2015 that the body was the reflection of “a political scenario” in which most governments were of the left. Its commitment to democracy in the region, he said, was to “the real validity of social rights”—a formula that echoed Cuban and Venezuelan propaganda. Venezuela’s opposition and its many supporters came to see Mr Samper as a stooge for the Venezuelan government. When Mr Samper’s term ended, a broad coalition of countries proposed José Octavio Bordón, a shrewd centrist politician and diplomat from Argentina, as his replacement. Venezuela vetoed him. That was the final straw. Unasur’s fate is a symbol of the deep fracture caused by Venezuela’s regime and its remaining friends in South America. It is also a rebuke to Brazilian foreign policy under Lula and his successor, Dilma Rousseff. Yet walking away from Unasur rather than trying to bypass Venezuela and reform the organisation looks like a mistake. “You don’t overcome the fracture by setting up a new organisation composed only of your friends,” says a former South American foreign minister, who worries about the “improvisation” it embodies. Many South American officials who have no sympathy for chavista Venezuela are cool towards Prosur. Several countries may stay away. Pressing Venezuela to return to democracy is a task that the region has entrusted to the Lima group, an ad hoc body of 14 countries that works reasonably well. That it includes Canada is hardly an existential problem. And as described by its founders, Prosur will lack the heft to do the job Unasur should have done (but didn’t) of working for practical measures of integration—especially by acting as a bridge between the two economic blocs in South America, Mercosur and the Pacific Alliance. As for Unasur, it may not actually die, but join Latin America’s clutter of the moribund. Laurence Whitehead of Oxford University has written that the penchant of Latin America’s elites for the latest ideological fashion has turned the region into a “mauseolum of modernities”. That now applies to its institutions of integration. This penchant is a luxury that a region which is falling behind economically cannot afford. This article appeared in the  The Americas  section of the print edition under the headline  \"Mausoleum of broken institutions\"  Print edition | The Americas Mar 21st 2019 Reuse this content About The Economist Apple Prime time With iPhone sales slowing, Apple bets on video, gaming, news and a credit card The company takes on tech giants, Hollywood and banks Free exchange Slower growth in ageing economies is not inevitable Asterix’s village Another day in the life of “a Europe that protects” Charlemagne’s notebook Daily chart Energy consumption increased at a record rate in 2018 When it's a matter of opinion, make your opinion matter Subscribe now Each week, over one million subscribers trust us to help them make sense of the world. Join them. Subscribe  to The Economist today or Sign up  to continue reading five free articles Subscribe Group subscriptions Contact us Help Keep updated Subscribe to The Economist newsletters Sign up to get more from The Economist Get 5 free articles per month, daily \n newsletters and more. About The Economist Advertise Reprints Careers Media Centre Published since September 1843 to take part in “a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.”  Terms of Use Privacy Cookie Policy Manage Cookies Accessibility Modern Slavery Statement Copyright © The Economist Newspaper Limited 2019 . All rights reserved.                ", "category": "business"}