{"author": "Lizzy Gurdus", "title": "'There's no way' we're headed for recession—five experts on the bond market's warning sign", "description": "A well-known recession indicator doesn't have analysts and economists as worried about the fate of U.S. markets as some might think.", "url": "https://www.cnbc.com/2019/03/26/no-way-were-headed-for-recessionexperts-talk-bond-market-warning.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/09/104272125-GettyImages-53042001.1910x1000.jpg", "publishedAt": "2019-03-26T20:21:46Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Trading Nation     Videos    Trader Bios    Commentary      'There's no way' we're headed for recession—five experts on the bond market's warning sign    Lizzy Gurdus | @lizzygurdus   Published 8 Hours Ago  CNBC.com                show chapters               Stocks shake off bond market warning signs — Watch five experts weigh in on what's next   9 Hours Ago |  05:25        U.S. stocks are holding steady despite what many see as a reliable recession indicator , and Wall Street experts are similarly unfazed — at least for now.   On Friday, the spread between 3-month and 10-year Treasury notes dipped below 10 basis points for the first time since 2007, indicating an inverted yield curve — when short-term yields rise above longer-term yields.  To many, an inverted yield curve signals an oncoming recession. But analysts and economists are largely split — and mostly underwhelmed — by the latest test of the market's resilience.   Bespoke Investment Group co-founder Paul Hickey, for one, said the significance of the inversion will depend on how long it lasts:  \"The importance of the yield curve is how long are we going to be inverted for? [...] The longer you have this situation, the higher the risk goes. I think if we can go a few days inverted and then start to steepen again, I don't think the concerns are as worrisome. ... Our big area of focus is the semiconductors, and they've been a great leadership [group] for the market overall over the last six years. Every major sell-off in the stock market has been preceded by underperformance.\"  James Camp, Eagle Asset Management's managing director of strategic income, was more bearish:  \"The issue for the equity market is the bond market telling you that global growth has really rolled over in a material sense, and we think that's likely. We also think that the problems in Europe … [are] indicative of what's happening in the bunds market. We now have negative yields back in Germany, so their 10-year now is back to that negative territory that had us all spooked just a couple of years ago. So I think the yield curve is signaling slowdown, no inflation, and that risk asset prices are vulnerable. [...] I think the bond market's basically telling you, 'Look, the next move is lower, not higher, on short-term rates.'\"  Mohamed El-Erian, chief economic advisor at Allianz, was not convinced that a recession is in store:  \"When something happens for the first time since 2007, people pay attention, and that's what happened on Friday when you got the inversion. However, when you look at the economy ... and also when you look at the determinants of the yield curve shape and move, this is not signaling recession. This is signaling some very peculiar technicals in the market that have to do with what's happening in Europe, that have to do with what's happening in the Fed, rather than what's happening in the economy. This economy, unless it gets disrupted by a major policy mistake, is on its way to 2.5 to 3 percent growth for this year. [...] This is a strong labor market. We continue to have average monthly job creation well above what you would expect at this time of the cycle. You're having real wage growth, and people are coming back into the labor market. Business investment is picking up; that's good news for this year and next year. And, yes, the effects of the tax cuts are eroding, but against that, government spending is increasing. So, put it all together: this still has momentum. This economy still has momentum for this year. There's no way you're going to get a recession.\"  Bank of America-Merrill Lynch Global Research's head of U.S. equity and quantitative strategy, Savita Subramanian, noted that the market typically sees 12 months of gains following an inversion, and that creates opportunity:  \"The Fed's tone has shifted so aggressively to a dovish stance that I think the real opportunity today is in consumer discretionary stocks. In fact, we just upgraded the sector from underweight to overweight, ... and what's interesting is that consumer discretionary has been left for dead. And what I mean is the average mutual fund has a lower weight exposure in consumer discretionary stocks than they have since the financial crisis. [...] Normally, this late in the cycle, the U.S. consumer would look very different, but this time around, consumers haven't taken on as much leverage. Again, if you look at all of the balance sheet measures for consumers, they look really unusually healthy at this point relative to where they ought to be given how much the government has tried to encourage us to take on more and more debt.\"  Tom Lee, head of research at Fundstrat Global Advisors, made an even bolder call:  \"I know the yield curve's inverted, but the front end is like Chicken Little. It has inverted as early as four years before a recession. The real curve to watch is the 10-Year/30-Year , and that's been steepening. So it might be too early for people to get neutral. And then we did a report last week to show that there's a lot of indicators that show we're mid-cycle in the U.S. [...] I think it's contrarian to say we're mid-cycle, but if you look at [the] employment-to-population [ratio], usually, it peaks at 64 percent. That's 10 million more jobs, or about 300,000 a year for three more years.\"        Disclaimer               Lizzy Gurdus Multimedia Producer    Related Securities      Symbol  Price    Change  %Change      U.S. 10 Yr/30 Yr Spread   ---                          Trading Nation         'There's no way' we're headed for recession—five experts on bond market warning   A well-known recession indicator doesn't have analysts and economists as worried about the fate of U.S. markets as some might think.            3 tech safety trades you can hide in as bond yields fall   For those seeking safety in the tech trade, these three plays could provide shelter, says Oppenheimer's Ari Wald.            Wall Street's Art Hogan sees pain lurking in popular defensive play   Economic slowdown jitters are driving investors to a sector that has little potential for gains, according to National Securities’ Art Hogan.            Tesla could rally nearly 40 percent, but it may not be a buy: Analyst   Analysts are torn on Tesla, but technician Ari Wald says he's still in the negative camp even if he sees a potential 40 percent rally ahead.     More From Trading Nation    Stock market winners list this year features odd bedfellows in 'FANG' and utility stocks     Financials are back in correction, and it could get much worse     From Lyft to Airbnb, new round of IPOs is no market top: Nick Colas     Stocks tumble as economic worries grip investors—four experts react to the drop     GE's stock is having one of its best quarters in five decades, but analysts are unconvinced     Three stocks to hedge against an economic slowdown     Don't chase Apple into this 'battleground' range, says chart analyst     Levi Strauss shares soar after company's second IPO — four experts react     Bet on higher bond prices after Fed's dovish coo, technician says     Stock market's fourth-quarter crash and comeback draws comparisons on Wall Street to '87, '95       Videos             Chipotle's outlook is good, but anything can send this stock down: Pro     Frank Cappelleri of Instinet and Erin Gibbs of S&P Global discuss why Chipotle shares are soaring and whether the fast-casual chain's stock is a buy with CNBC's Mike Santoli            Stocks shake off bond market warning signs — Watch five experts weigh in on what's next     Stocks are rising, but investors remain worried about the yield curve inverting, which could be a sign of a pending recession. Five market experts break down what they're watching.            Lyft is about to go public. Here's what to expect     One of the hottest IPOs is coming this week: Lyft. Tom White of D.A. Davidson breaks down what to expect.      Trades to Watch              If a North Korean conflict plays out, this is what will happen globally     Gina Sanchez of Chantico Global says a North Korean attack, should one occur, isn't likely to cause significant long-term market impact.            This under-the-radar report could be crucial for the market     Boris Schlossberg of BK Asset Management says the ISM non-manufacturing report is key to watch ahead the jobs data released Friday.            When the dollar is weak, here's the sector that wins     Chad Morganlander of Washington Crossing Advisors is watching the dollar this week and expects it'll begin to strengthen heading into the second half of the year.      Trader Bios            Stacey Gilbert   Stacey Gilbert is the head of derivative strategy at Susquehanna.           Lawrence McDonald   Managing Director, ACG Analytics           Rich Ross   Managing Director, Head of Technical Analysis, Evercore ISI     About  Trading Nation is a multimedia financial news program that shows investors and traders how to use the news of the day to their advantage. This is where experts from across the financial world – including macro strategists, technical analysts, stock-pickers, and traders who specialize in options, currencies, and fixed income – come together to find the best ways to capitalize on recent developments in the market. Trading Nation: Where headlines become opportunities.      Michael Santoli  Michael Santoli joined CNBC in October 2015 as a Senior Markets Commentator, based at the network's Global Headquarters in Englewood Cliffs, N.J.  Santoli brings his extensive markets expertise to CNBC's Business Day programming, with a regular appearance on CNBC's Closing Bell (M-F, 3PM-5PM ET). In addition, he contributes to CNBC and CNBC PRO, writing regular articles and creating original digital videos.  Previously, Santoli was a Senior Columnist at Yahoo Finance, where he wrote analysis and commentary on the stock market, corporate news and the economy. He also appeared on Yahoo Finance video programs, where he offered insights on the most important business stories of the day, and was a regular contributor to CNBC and other networks.  Follow Michael Santoli on Twitter @michaelsantoli  Read more      Connect  Tweets by @TradingNation                       To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                    ", "category": "business"}