{"author": "Fortune Editors", "title": "The 60 Best Workplaces in Finance and Insurance", "description": "Edward Jones tops the 2019 list from Fortune research partner Great Place to Work.", "url": "http://fortune.com/2019/03/26/60-best-workplaces-finance-insurance/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/02/american-fidelity-assurance-best-workplaces-financial-services-2019.jpg", "publishedAt": "2019-03-26T11:00:33Z", "content": "                                                The 60 Best Workplaces in Finance and Insurance                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Careers      Best Workplaces        The 60 Best Workplaces in Finance and Insurance                                            By Fortune Editors  March 26, 2019       This year’s list of best workplaces in finance and insurance is topped by Edward Jones, which led the list last year as well. The companies on the 2019 list, compiled by Fortune research partner Great Place to Work , include both large and small companies. They’re known for being innovative, in addition to valuing their employees. Take a look at the full list of companies below. To learn more about the methodology behind the list, click here .  Top Large Companies  (Scroll down for the top small & medium companies.)  1. Edward Jones             Courtesy of Edward Jones      Headquarters: St. Louis, Missouri  Number of employees: 43,851  U.S. revenue: $7,135,000,000  Vertical: Investments    Employees say:  “Edward Jones is like a family, we encourage each other, we take care of each other, and sometimes (although rare) we are at odds with each other, but we ALWAYS have each other’s backs—like all healthy families!”  Read the Great Place to Work review here .  2. Pinnacle Financial Partners             Courtesy of Pinnacle Financial Partners      Headquarters: Nashville, Tennessee  Number of employees: 2,258  U.S. revenue: $688,000,000  Vertical: Banking/Credit Services   Employees say:  “If I needed anything or wanted to express an opinion, I could reach out to the very top and always get a response. CEO Terry Turner actually comes into our offices and visits with us, asks us questions and for our opinions! Our voice truly matters.”  Read the Great Place to Work review here.  3. Veterans United Home Loans             Courtesy of Veterans United      Headquarters: Columbia, Missouri  Number of employees: 2,367  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “VU is focused on people, and values, and purpose, instead of just making money. It’s a really unique and beautiful thing to care so deeply about your customers, your co-workers and your community and see the blossoming results of that investment.”  Read the Great Place to Work review here.  4. Plante Moran             Courtesy of Plante Moran      Headquarters: Southfield, Michigan  Number of employees: 3,081  U.S. revenue: $540,790,600  Vertical: Accounting    Employees say:  “Leaders live out the culture each and every day. A people focus is thread through every meeting, decision, and discussion. It’s truly remarkable and very rare in my experience with other organizations.”  Read the Great Place to Work review here.  5. Progressive Insurance             Courtesy of Progressive Insurance      Headquarters: Mayfield Village, Ohio  Number of employees: 35,833  U.S. revenue: Confidential  Vertical: Auto Insurance/Home Insurance    Employees say:  “I’ve never worked for a company who gives so many opportunities to advance or explore other positions to those who apply themselves. I genuinely feel that I can go as far as I want as long as I take the initiative and put in the work.”  Read the Great Place to Work review here.  6. PrimeLending                 Headquarters: Dallas, Texas  Number of employees: 2,902  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “No matter what situation I am facing, I know that within this company someone is willing to help. Everyone goes our of their way to make things happen. We always use the hashtag #oneteamonepurpose—it’s very motivating.”  Read the Great Place to Work review here.  7. Navy Federal Credit Union             Courtesy of Navy Federal Credit Union      Headquarters: Vienna, Virginia  Number of employees: 16,385  U.S. revenue: $6,025,501,475  Vertical: Banking/Credit Services    Employees say:  “Management cares, and is there to listen when you have a concern or issue. And on top of it, our business structure allows for its employees to feel empowered to make decisions, because after all, we all work as leaders here.”  Read the Great Place to Work review here.  8. Bell Bank                 Headquarters: Fargo, North Dakota  Number of employees: 1,159  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “Bell truly values the employees. We are treated very well and recognized and appreciated for the work we do. The company mission of ‘Happy employees, happy customers’ is lived out daily; it is not just a statement.”  Read the Great Place to Work review here.  9. Baird             Courtesy of Baird      Headquarters: Milwaukee, Wisconsin  Number of employees: 3,294  U.S. revenue: $1,468,842,000  Vertical: Investments, Accounting, Banking/Credit Services    Employees say:  “There is an emphasis placed on inclusion that isn’t just lip service. From the time I started here when I was the newest person on the team my ideas were heard and implemented. Everyone I work with seems to have an openness and willingness to listen.”  Read the Great Place to Work review here.  10. Credit Acceptance Corporation             Courtesy of Credit Acceptance      Headquarters: Southfield, Michigan  Number of employees: 1,888  U.S. revenue: $1,100,000,000  Vertical: Banking/Credit Services    Employees say:  “The leadership of this company is fantastic. I have a lot of confidence in their expertise and guidance into the future. The company is growing as a result of many bright minds collectively working together, and it’s fantastic to be a part of it.”  Read the Great Place to Work review here.  11. New American Funding             Courtesy of New American Funding      Headquarters: Tustin, California  Number of employees: 2,957  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “This company gives you a lot of personal responsibility. We are able to operate with quite a bit of autonomy and no micro-management, yet have a huge support network there at all times when we need it.”  Read the Great Place to Work review here.  12. Quicken Loans             Courtesy of Quicken Loans      Headquarters: Detroit, Michigan  Number of employees: 15,307  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “This is a place that truly embraces team members as individuals. You don’t have to cover your tattoos, you can wear your hair how you want, your race and sexuality have no bearing on your success. I can bring my whole self to work every day.”  Read the Great Place to Work review here.  13. American Express             Courtesy of American Express      Headquarters: New York, New York  Number of employees: Confidential  U.S. revenue: $24,737,000,000  Vertical: Banking/Credit Services    Employees say:  “Integrity and doing things the right way is a core value for the company. American Express not only wants you to know this is a core value, they want you live it.”  Read the Great Place to Work review here.  14. Allianz Life Insurance Company of North America             Courtesy of Allianz Life      Headquarters: Golden Valley, Minnesota  Number of employees: 1,989  U.S. revenue: $11,000,000,000  Vertical: Life Insurance    Employees say:  “I’ve never seen a company have so many career paths set up for all employees—it’s a great place to start your career at and move your way up in the organization.”  Read the Great Place to Work review here.  15. Cornerstone Home Lending             Courtesy of Cornerstone Lending      Headquarters: Houston, Texas  Number of employees: 1,663  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “We hold ourselves to a higher standard, and because of that, the people who work here are genuinely exceptional. Management and HR do a great job for not simply hiring the best people, but the RIGHT people for the job.”  Read the Great Place to Work review here.  16. Capital One Financial Corporation             Courtesy of Capital One      Headquarters: McLean, Virginia  Number of employees: 42,685  U.S. revenue: $25,837,000,000  Vertical: Banking/Credit Services    Employees say:  “Capital One makes you feel like family. They give you all the tools to help you succeed in your career, and encourage you to step out of your comfort zone and try new things. Management backs you up and encourages work-life balance.”  Read the Great Place to Work review here.  17. USAA             Courtesy of Capital One      Headquarters: San Antonio, Texas  Number of employees: 33,786  U.S. revenue: $30,016,000,000  Vertical: Banking/Credit Services    Employees say:  “Our dedication to the people who serve our country and their families. We take a great deal of pride in the honor everyday. This is not a job but rather a commitment to every life we touch.”  Read the Great Place to Work review here.  18. American Fidelity Assurance Company             Courtesy of American Fidelity Assurance      Headquarters: Oklahoma City, Oklahoma  Number of employees: 1,841  U.S. revenue: $116,900,000  Vertical: Life Insurance    Employees say:  “I truly do believe that there is a genuine family feel here-from management down. People take an interest in others on a personal level and rally together to help colleagues during difficult or trying times.”  Read the Great Place to Work review here.  19. Bank of America             Courtesy of Bank of America      Headquarters: Charlotte, North Carolina  Number of employees: 175,176  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “This company has a strong commitment to diversity and inclusion and is working hard to ensure that all areas of the organization commit to those values.”  Read the Great Place to Work review here.  20. First Horizon National Corp.             Courtesy of First Horizon National Corp      Headquarters: Memphis, Tennessee  Number of employees: 5,693  U.S. revenue: $1,332,533,000  Vertical: Banking/Credit Services    Employees say:  “Core values are truly lived out in the work place. The belief and value that personal and family life play a part of employees’ success gives me a sense of peace. I don’t feel I have to compromise those values of my life to be a great employee.”  Read the Great Place to Work review here.  21. Nationwide             Courtesy of Nationwide      Headquarters: Columbus, Ohio  Number of Employees: Confidential  U.S. revenue: $43,900,000,000  Vertical: General Insurance    Employees say:  “Nationwide is a very caring company—we care for our employees, our customers, and our communities. This shows in our actions of how we treat people, where we spend our resources, and in our strategies.”  Read the Great Place to Work review here.  22. Goldman Sachs Group             Courtesy of Goldman Sachs      Headquarters: New York, New York  Number of employees: Confidential  U.S. revenue: $19,564,530,000  Vertical: Banking/Credit Services    Employees say:  “You really have the best and brightest in a place where they foster teamwork. A tough combination to pull off.”  Read the Great Place to Work review here.  23. First American Financial Corporation             Courtesy of First American Financial      Headquarters: Santa Ana, California  Number of employees: 12,253  U.S. revenue: $5,465,435,578  Vertical: Home Insurance    Employees say:  “It’s all about the people! Everyone I deal with (inside or outside my department) is friendly, willing to help others, collaborative, and supportive. And management encourages and supports that culture through living our values.”  Read the Great Place to Work review here.  24. Third Federal Savings & Loan             Courtesy of Third Federal Savings and Loan      Headquarters: Cleveland, Ohio  Number of employees: 1,022  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “We are treated like family. Our value system is unlike any other company. Our CEO Marc is personable and approachable. He will hold an elevator for you, call you by name, and buy you lunch in the cafeteria.”  Read the Great Place to Work review here.  25. West Bend Mutual Insurance Company             Courtesy of West Bend      Headquarters: West Bend, Wisconsin  Number of employees: 1,270  U.S. revenue: $1,193,688,000  Vertical: General Insurance    Employees say:  “We are treated like family. Our value system is unlike any other company. Our CEO Marc is personable and approachable. He will hold an elevator for you, call you by name, and buy you lunch in the cafeteria.”  Read the Great Place to Work review here.  26. Farmers Insurance             Courtesy of Farmers Insurance      Headquarters: Woodland Hills, California  Number of employees: 20,541  U.S. revenue: $19,908,000,000  Vertical: General Insurance    Employees say:  “Farmers makes extensive efforts to be inclusive and respectful, and to be involved with the community. There is a positive, inclusive, and friendly mentality that is pervasive throughout the company.”  Read the Great Place to Work review here.  27. Synchrony             Courtesy of Synchrony      Headquarters: Stamford, Connecticut  Number of employees: Confidential  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “This is a very open-minded company with an edge in technology and a full understanding of our customer and partners. I love the fact that I can be myself and grow as fast as I can/want.”  Read the Great Place to Work review here.  28. Lake Michigan Credit Union             Courtesy of Lake Michigan Credit Union      Headquarters: Grand Rapids, Michigan  Number of employees: 1,305  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “I absolutely love how upper management treats everyone as an equal. I have never met anyone in the company who made me feel like I didn’t matter. I feel like my manager genuinely cares for me as a person and is interested in my well-being.”  Read the Great Place to Work review here.  29. Blackstone             Courtesy of Blackstone      Headquarters: New York, New York  Number of employees: 1,757  U.S. revenue: Confidential  Vertical: Investments    Employees say:  “The intelligence of people who work at Blackstone outshines the competition. Integrity, honesty, teamwork, and the drive to create better products and services for our customers are what set Blackstone apart.”  Read the Great Place to Work review here.  30. Experian             Courtesy of Experian      Headquarters: Costa Mesa, California  Number of employees: 5,113  U.S. revenue: $2,646,000,000    Employees say:  “There is a cultural mindset at Experian that embraces diversity—of all kinds. This is what is making our company such a great place to work!”  Read the Great Place to Work review here.  Small & Medium Companies  1. First American Equipment Finance             Courtesy of First American Equipment Finance      Headquarters: Fairport, New York  Number of employees: 233  U.S. revenue: $63,720,000  Vertical: Banking/Credit Services    Employees say:  “People here embrace innovation to the fullest extent, and empower one another in the process. No matter your age, tenure, or expertise, you are supported and encouraged to drive ideas forward.”  Read the Great Place to Work review here.  2. Bankers Healthcare Group             Courtesy of Bankers Healthcare Group      Headquarters: Davie, Florida  Number of employees: 414  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “Amazing the access we have to the three owners and how willing they are to share their successes, failures, concerns. Each one will look you in the eye and have a conversation at the drop of a hat.”  Read the Great Place to Work review here.  3. Evergreen Home Loans             Courtesy of Evergreen Home Loans      Headquarters: Bellevue, Washington  Number of employees: 812  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “At EHL I feel like I am much more than an employee. I truly feel like I am part of a family. Everyone treats everyone with respect and decency.”  Read the Great Place to Work review here.  4. Kabbage, Inc.             Courtesy of Kabbage      Headquarters: Atlanta, Georgia  Number of employees: 328  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “A thriving culture that promotes a positive environment and a startup mentality that pushes you from behind making hard work feel like fun. This is a place to be, grow, and thrive.”  Read the Great Place to Work review here.  5. Alliant Credit Union             Courtesy of Alliant Credit Union      Headquarters: Rolling Meadows, Illinois  Number of employees: 541  U.S. revenue: $329,449,629  Vertical: Investments, Banking/Credit Services    Employees say:  “Even as we’re growing larger every year I still feel the opinions of every individual, from individual contributors to executives, matter. We all have a voice and a way to contribute to change within the organization.”  Read the Great Place to Work review here.  6. Walker & Dunlop             Courtesy of Walker & Dunlop      Headquarters: Bethesda, Maryland  Number of employees: 668  U.S. revenue: $711,856,867  Vertical: Investments    Employees say:  “Positive reinforcement and compliments about a job well done are always given. It makes the work you do feel appreciated and important—keeps you wanting to work hard and do your best.”  Read the Great Place to Work review here.  7. Promontory Interfinancial Network             Courtesy of Promontory Interfinancial      Headquarters: Arlington, Virginia  Number of employees: 189  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “The company goes above and beyond to show appreciation to their employees. They are always trying new ways to make everyone feel cared for, welcome, and included. The company is filled with very intelligent people that are also humble and fun.”  Read the Great Place to Work review here.  8. ESL Federal Credit Union             Courtesy of ESL Federal Credit Union      Headquarters: Rochester, New York  Number of employees: 775  U.S. revenue: $218,441,000  Vertical: Banking/Credit Services    Employees say:  “It is truly a great feeling knowing that employees care about others and are always willing to help. I also feel like every member of management is invested in my success and is willing to help at any time.”  Read the Great Place to Work review here.  9. Civic Financial Services             Courtesy of Civic Financial Services      Headquarters: Redondo Beach, California  Number of employees: 182  U.S. revenue: $37,998,993    Employees say:  “I appreciate the commitment to transparency, communication, and harmony. I work in a special place full of thoughtful and professional people who strive for integrity, production, purpose, and genuine culture in the workplace.”  Read the Great Place to Work review here.  10. Allied Mortgage Group             Courtesy of Allied Mortgage Group      Headquarters: Bala Cynwyd, Pennsylvania  Number of employees: 216  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “Everybody has an opportunity to make an impact. We continuously see workplace improvements that initiate from an employee sharing an idea or sharing a pain point with a leader. It means a lot to know that your ideas are listened to and acted on.”  Read the Great Place to Work review here.  11. Grow Financial Federal Credit Union             Courtesy of Grow Financial Federal Credit Union      Headquarters: Tampa, Florida  Number of employees: 549  U.S. revenue: $122,400,000  Vertical: Banking/Credit Services    Employees say:  “Grow understands that a big part of the community is its team members. We have great work/life balance, excellent pay and benefits, and take time to have fun! Because of everything Grow does for its employees, I enjoy coming to work every day.”  Read the Great Place to Work review here.  12. Advisors Excel             Courtesy of Advisors Excel      Headquarters: Topeka, Kansas  Number of employees: 554  U.S. revenue: Confidential  Vertical: Investments    Employees say:  “This is the most community-centered company I have ever been a part of, and people truly love giving back to the community. The company also cares more about the employee experience and work/life balance than any I have ever been a part of.”  Read the Great Place to Work review here.  13. SECURA Insurance                 Headquarters: Appleton, Wisconsin  Number of employees: 751  U.S. revenue: $615,772,680  Vertical: General Insurance    Employees say:  “People are valued in the company for both their contributions to the organization as well as their lives outside of work. Most people are genuinely focused on doing their best to help the company succeed and our CEO communicates openly to all levels.”  Read the Great Place to Work review here.  14. Reliance Partners  Headquarters: Chattanooga, Tennessee  Number of employees: 66  U.S. revenue: $51,00,000  Vertical: General Insurance, Auto Insurance, Home Insurance  Employees say:  “There’s constant collaboration—we all work together well. Managers take time to teach you and explain things. Upper management is very approachable and easy to confide in/talk to. And the words ‘thank you’ are used often for everything we do!”  Read the Great Place to Work review here.  15. Collective Health             Courtesy of Collective Health      Headquarters: San Francisco, California  Number of employees: 411  U.S. revenue: Confidential  Vertical: Health Insurance    Employees say:  “I’ve never been part of a company that was so transparent. I’ve seen every slide that gets shared to our board, I have access to our roadmaps, I understand our strategy, and I hear from the leadership every step of the way. It’s pretty amazing.”  Read the Great Place to Work review here.  16. Assurance             Courtesy of Assurance      Headquarters: Schaumburg, Illinois  Number of employees: 497  U.S. revenue: $105,447,751  Vertical: General Insurance    Employees say:  “This company is focused on fostering my professional development and providing the flexibility I need to both do my job and live my life. In addition, employees are constantly appreciated in ways that are sometimes big and often small and personal.”  Read the Great Place to Work review here.  17. Blue Cross and Blue Shield of Vermont             Courtesy of Blue Cross and Blue Shield of Vermont      Headquarters: Berlin, Vermont  Number of employees: 416  U.S. revenue: $930,000,000  Vertical: Health Insurance    Employees say:  “Our culture is unique. We place a great deal of focus on doing what is right for not only our customers but also our employees. It is a very supportive environment that encourages empowerment, decision-making, and ongoing learning and development.”  Read the Great Place to Work review here.  18. Funeral Directors Life             Courtesy of Funeral Directors Life      Headquarters: Abilene, Texas  Number of employees: 175  U.S. revenue: $275,890,198  Vertical: Life Insurance    Employees say:  “The emphasis put on bettering each and every employee mentally, spiritually, and physically as well as the effort put forth to give back to the community make this company a uniquely great place to work.”  Read the Great Place to Work review here.  19. Nations Lending Corporation             Courtesy of Nations Lending Corporation      Headquarters: Independence, Ohio  Number of employees: 771  U.S. revenue: $112,904,646  Vertical: Banking/Credit Services    Employees say:  “No matter which location, branch, or position held, when someone needs help, or has a moment to be celebrated or mourned, everyone comes together. I am very happy to have earned a position here and hope I’ll be working here for a long time.”  Read the Great Place to Work review here.  20. 49 Financial             Courtesy of 49 Financial      Headquarters: Austin, Texas  Number of employees: 101  U.S. revenue: $8,567,974  Vertical: Investment    Employees say:  “This is one of the only places that encourages employees to grow personally and professionally. That stems from the foundation of the company being built on values above all else. People are genuinely loved and poured into like family.”  Read the Great Place to Work review here.  21. Castle & Cooke Mortgage, LLC             Courtesy of Castle & Cooke Mortgage Company      Headquarters: Draper, Utah  Number of employees: 342  U.S. revenue: Confidential  Vertical: Banking/Credit Services    Employees say:  “The executive management, along with support in the corporate office, are all approachable and responsive. Service to the community and a healthy work-life balance are explicitly encouraged.”  Read the Great Place to Work review here.  22. Richwood Bank  Headquarters: Richwood, Ohio  Number of employees: 130  U.S. revenue: $20,417,000  Vertical: Investments, Banking/Credit Services  Employees say:  “There’s an incredible amount of warmth and joy that comes from saying I work at Richwood Bank. I’m welcome to speak to the CEO or COO if need be without an appointment, and they genuinely embody everything they set forth in the values of the company.”  Read the Great Place to Work review here.  23. Greenleaf Trust             Courtesy of Greenleaf Trust      Headquarters: Kalamazoo, Michigan  Number of employees: 118  U.S. revenue: Confidential  Vertical: Investments    Employees say:  “We have an great group of people working here. Everyone is determined to help their team succeed and to deliver outstanding service to our clients. My teammates are smart, creative, and caring. We are truly a family.”  Read the Great Place to Work review here.  24. The PURE Group of Insurance Companies             Courtesy of PURE Group of Insurance Companies      Headquarters: White Plains, New York  Number of employees: 602  U.S. revenue: $781,333,326  Vertical: General Insurance, Home Insurance, Auto Insurance    Employees say:  “Enthusiasm here is infectious amongst employees. People are inspiring, welcoming, friendly, energetic, and want you to succeed. Truly a great place to work!”  Read the Great Place to Work review here.  25. Lendio             Courtesy of Lendio      Headquarters: South Jordan, Utah  Number of employees: 148  U.S. revenue: Confidential  Vertical: Investments, Banking/Credit Services    Employees say:  “I’ve never worked anywhere that gives employees so much autonomy to do their jobs. That freedom from red tape improves efficiency and is very motivating. I appreciate the trust they put in me.”  Read the Great Place to Work review here.  26. Baldwin Krystyn Sherman Partners             Courtesy of Baldwin Krystyn Sherman Partners      Headquarters: Tampa, Florida  Number of employees: 170  U.S. revenue: Confidential  Vertical: General Insurance    Employees say:  “Management really wants everyone to grow and supports that. They also are extremely flexible to find what works for you to show you are an asset to the company.”  Read the Great Place to Work review here.  27. MSU Federal Credit Union             Courtesy of MSU Federal Credit Union      Headquarters: East Lansing, Michigan  Number of employees: 866  U.S. revenue: $180,931,921  Vertical: Banking/Credit Services    Employees say:  “As a woman, I am happy to work at a company with strong female leaders that not only are a great role models, but also can influence the society we live and work in.”  Read the Great Place to Work review here.  28. Hagerty             Courtesy of Hagerty      Headquarters: Traverse City, Michigan  Number of employees: 863  U.S. revenue: Confidential  Vertical: Auto Insurance    Employees say:  “The culture at Hagerty promotes constant growth and development on an individual, team, and corporate level. I appreciate how much the leaders (not just my direct supervisor) acknowledge my contribution at work.”  Read the Great Place to Work review here.  29. Alpine Investors             Courtesy of Alpine Investors      Headquarters: San Francisco, California  Number of employees: 33  U.S. revenue: Confidential  Vertical: Investments    Employees say:  “Alpine empowers people. Talent is not about what you have done, but what you can do—from the internship program to the CEO in Training platform, Alpine is a place to catapult your career and influence!”  Read the Great Place to Work review here.  30. Plenary Group USA Ltd.             Courtesy of Plenary Group      Headquarters: Los Angeles, California  Number of employees: 29  U.S. revenue: Confidential  Vertical: Investments  Employees say:  “They truly invest in their employees and the employee culture. Plenary has a very entrepreneurial approach and every bit of the business is fun and challenging. I will be here for the long haul and to see Plenary grow.”  Read the Great Place to Work review here.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}