{"author": "The Economist", "title": "With iPhone sales slowing, Apple bets on video, gaming, news and a credit card", "description": "The company takes on tech giants, Hollywood and banks", "url": "http://www.economist.com/business/2019/03/26/with-iphone-sales-slowing-apple-bets-on-video-gaming-news-and-a-credit-card", "urlToImage": "https://cdn.static-economist.com/sites/default/files/images/2019/03/articles/main/20190330_blp903.jpg", "publishedAt": "2019-03-26T04:00:00Z", "content": "     Topics Sections Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network Media Audio edition Economist Films Podcasts About The Economist Subscribe Log in or sign up Manage subscription Log In Forgot password? New to  The Economist ? Sign up now Activate your digital subscription Manage your subscription Renew your subscription Search Topics Latest updates Leaders Briefing United States The Americas Asia China Middle East and Africa Europe Britain International Business Finance and economics Science and technology Books and arts Graphic detail Obituary Special reports Technology Quarterly Debates Open Future Blogs Bagehot’s notebook Bartleby Charlemagne’s notebook Democracy in America Erasmus Free exchange Game theory Gulliver Prospero The Economist explains Current edition Audio edition Economist Films Podcasts The Economist apps More Apps & Digital Editions The Economist apps Espresso Global Business Review World in Figures Other Publications 1843 magazine The World In The World If From The Economist Group Events Online GMAT prep Online GRE prep Executive Education Navigator Which MBA Jobs Board Learning.ly The Economist Store The Economist Intelligence Unit The Economist Corporate Network About The Economist Subscribe Apple Prime time With iPhone sales slowing, Apple bets on video, gaming, news and a credit card The company takes on tech giants, Hollywood and banks Business and finance Mar 26th 2019 | NEW YORK IT WAS NOTHING like Steve Jobs introducing the iPhone. But the two-hour show on March 25th put on by Tim Cook, Jobs’s less histrionic successor as boss of Apple, may nevertheless be remembered as a milestone for the company—and the entertainment industry. Mr Cook did not announce the latest sleek gadget. Instead, he unveiled a suite of products and services, including video streaming, news, games and even a credit card. As theatre, it was underwhelming—star-studded supporting cast including Oprah Winfrey notwithstanding. As a business case, it looks more compelling. Apple’s 900m iPhones worldwide, more than six times as many as Netflix has subscribers, grant it access to a massive potential audience. Analysts speculate that Apple will eventually offer them a variant of Amazon Prime, where customers pay a flat monthly fee for some combination of news, games, cloud storage, music and video, and which could possibly connect with the company’s iPhone subscriptions. Mr Cook stopped short of announcing a unique subscription service, promising instead to roll out five separate offerings, some of which are merely older services in nicer packaging. Together, they nevertheless threaten fellow tech giants, Hollywood and banks. Get our daily newsletter Upgrade your inbox and get our Daily Dispatch and Editor's Picks. Apple TV+, which got featured billing from Mr Cook, will offer original programming from Ms Winfrey, Reese Witherspoon, Sesame Street and others in more than 100 countries. The money Apple plans to spend on original shows—perhaps $1bn to $2bn thus far—is dwarfed by that of Netflix, which will splurge as much as $15bn this year on original and licensed content, or Disney, whose own video-streaming is expected shortly. But Apple’s high-profile shows are for now meant chiefly to lure customers into its universe of apps and services. That includes subscription services for games, a catalogue of big American magazines (and a few newspapers, including the Wall Street Journal ), and, in America, pay-TV networks such as HBO, Showtime and Starz. You can pay for it all using your new Apple Card, developed with bankers at Goldman Sachs. The credit card puts Apple in direct competition with banks: it has no fees and will give users 2% cash back on purchases made via Apple Pay, the company’s payments system—or 3% on purchases of Apple kit and services. Although Apple continues to earn most of its money from devices, its business in services is growing quickly, accounting for nearly $40bn of revenues of $266bn in 2018 (see chart). The new subscription offerings, which are easier to click and buy than their predecessors, should accelerate that trend. Its new partners hope to be along for the ride. Analysts at Goldman Sachs reckon that Apple may convert 10% of the 85m monthly users of its free News app into paying subscribers, for instance. Amazon Channels, which Apple TV channels aped, has boosted subscriptions for HBO, Showtime and Starz. Apple gets a cut of newspaper and TV subscriptions sold through its services, just as it gets a cut of sales in its app store. Some content providers are leery. The New York Times and Washington Post have spurned Apple’s advances on behalf of its news service. Netflix and Disney will not partake in Apple TV+, which they view as more a threat than an opportunity. They are right to be cautious. The future of media will belong to whoever controls relationships with consumers, industry insiders say. Thanks to its ubiquitous devices, Apple has hundreds of millions of customer relationships. With that comes the power to get more of their time and money, and to cut out competitors. Mr Cook may put on a lacklustre show, but his rivals had better watch him regardless. Business and finance Mar 26th 2019 | NEW YORK Reuse this content About The Economist Apple Prime time With iPhone sales slowing, Apple bets on video, gaming, news and a credit card The company takes on tech giants, Hollywood and banks Free exchange Slower growth in ageing economies is not inevitable Asterix’s village Another day in the life of “a Europe that protects” Charlemagne’s notebook Daily chart Energy consumption increased at a record rate in 2018 When it's a matter of opinion, make your opinion matter Subscribe now Each week, over one million subscribers trust us to help them make sense of the world. Join them. Subscribe  to The Economist today or Sign up  to continue reading five free articles Subscribe Group subscriptions Contact us Help Keep updated Subscribe to The Economist newsletters Sign up to get more from The Economist Get 5 free articles per month, daily \n newsletters and more. About The Economist Advertise Reprints Careers Media Centre Published since September 1843 to take part in “a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.”  Terms of Use Privacy Cookie Policy Manage Cookies Accessibility Modern Slavery Statement Copyright © The Economist Newspaper Limited 2019 . All rights reserved.                ", "category": "business"}