{"author": "Richard Feloni", "title": "The US CEO of Siemens used to get told all the time that she wasn’t 'executive material,' and it taught her the most important leadership lesson of her career", "description": "Siemens USA CEO Barbara Humpton said it was critical to learn that there is not a single right way to be a leader.", "url": "https://www.businessinsider.com/siemens-usa-ceo-says-executive-material-is-a-myth-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c992e76ffcb2755573a9024-1536-768.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                             Tech       Finance       Politics       Strategy       Life       All       Tech   Tech Insider  Media  Science  Transportation   Finance   Finance  Markets Insider  Retail  Your Money     Politics   Politics  Military & Defense   Strategy   Strategy  Advertising  Careers     Life   Life  Coupons  Entertainment  Insider Picks  Sports   Featured    Better Capitalism    Embracing Disruption    Insider TV      Subscribe   BI Intelligence  BI Prime   About BI   About  Careers  Contact Us  Advertise  Contributors FAQ  Corporate  Corrections Policy     Follow BI   Newsletters  Events  RSS  Facebook  Twitter  Instagram  YouTube  LinkedIn                BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition                BI Prime    Intelligence       A vertical stack of three evenly spaced horizontal lines.       Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                                         BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE               Tech    Enterprise  Science  advertising  Media  Transportation          Finance    Markets  Retail  Your Money  Markets Insider          Politics    Military & Defense  News          Strategy    Careers          Life    Entertainment  Travel  Sports          All       Coupons    Target  Walmart  EBay  Nike  Container Store              BI ACCOUNTS     BUSINESS INSIDER    BI PRIME  SIGN OUT    BI INTELLIGENCE                    Edition   US  INTL  DE  AUS  FR  IN  IT  JP  MY  NL  SE  PL  SG  ZA  ES                Follow us on:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net                                  The US CEO of Siemens used to get told all the time that she wasn’t 'executive material,' and it taught her the most important leadership lesson of her career        Richard Feloni  4m                                                         Siemens USA CEO Barbara Humpton.  Siemens             Barbara Humpton became CEO of Siemens USA last year, after a decade of executive positions. She was long told she did not \"fit the mold\" of being an executive. She learned that there is no correct way to be a leader, as long as you utilize your strengths to drive results. C-Suite Insider is a collection of exclusive interviews with leaders of the world's largest companies. \"I had leaders communicate to me all the time in my mid-career, 'Hey, Barb, we really like you and you make great contributions — you're just not executive material,'\" Siemens USA CEO Barbara Humpton told Business Insider . Humpton became CEO of the German engineering conglomerate's American branch last June, after a decade of executive roles at various corporations. She credits her career success to recognizing that the whole idea of \"executive material\" was a lie. \"I had this core feeling in my heart that wait, business needs more of what I'm bringing to the table,\" she said. She's naturally an optimist, she said, and is energetic and enthusiastic. The bias was also linked to overt sexism: As she told Time last year, a leader at IBM once said in 1990 that she had to choose between being a mother or being an executive. But even if someone had the best intentions with their advice, the prevailing wisdom of the day was that Humpton would have to be more stern and suppress part of her personality. \"In the first 20 years of my career, management theory at the time was they wanted to teach us how to correct our deficiencies. 'We want to teach you how to be the leader that you need to be and so we're going to send you to school,' and I wasn't one to fit the mold.\" The mold certainly didn't equate with good leadership. As business consultant Marcus Buckingham noted in his best-selling management guide from 1999, \" First, Break All the Rules ,\" the best leaders foster strengths rather than try to correct weaknesses and end up with a team of similarly well-rounded individuals. Humpton saw \"executive material\" equated with management through \"fear and intimidation,\" but knew that her proclivity for \"engagement and inspiration\" would lend themselves to leadership. \"Looking at my leadership team today here in the US, what I love about this team, we all have different styles, but we all get stuff done,\" she said. It's important that they share goals, like a commitment to creating long-term value and developing their workforce, she said — but the only aspect of their leadership style that matters is that it works for their particular team. (And if someone has more of that old-school, heavy-handed approach to leadership and it works for that person's team, then that's great, she said.) \"Something fundamental that I've learned over these last few years, is that, first of all you're going to be most effective when you're your authentic self,\" Humpton said. \"The best thing possible is if you can get yourself into a job that aligns well with your natural capabilities — and this one does.\"  This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content.      SEE ALSO:  The head of Siemens USA explains why it's making open-source training programs available across industries, as it looks to benefit from a new age of automation      NOW WATCH: Barbara Corcoran reveals how to successfully ask for a raise — and what you should never say to your boss         More:  Barbara Humpton  Siemens  BI Prime  Leadership      career advice                                           Popular       A GOP senator brought a giant picture of Ronald Reagan riding a dinosaur onto the Senate floor to argue against Democrats' Green New Deal      Popular       JCPenney is closing 27 stores — see if your local store is on the list      Popular       UPS just beat out Amazon, FedEx, and Uber to make America's first revenue-generating drone delivery      Popular       Trump's national emergency declaration for a border wall survives after House fails to override veto      Popular       The White House will get the Mueller report before the public does in case it wants to make redactions, Barr says                                     Follow us on:                  Also check out:           * Copyright © 2019 Insider Inc. All rights reserved. Registration on or use of this site constitutes acceptance of our  Terms of Service  ,  Privacy Policy  and  Cookies Policy .     Sitemap    Disclaimer    Commerce Policy    Coupons    Made in NYC   Stock quotes by finanzen.net        Edition   International Editions:    United States  US           International  INTL      Deutschland  DE      Australia  AUS      France  FR      India  IN      Italy  IT      Japan  JP      Malaysia  MY      Netherlands  NL      Nordic  SE      Poland  PL      Singapore  SG      South Africa  ZA      Spain  ES                   ", "category": "business"}