{"author": "Evelyn Cheng", "title": "China's economy picks up as companies pile on debt, survey finds", "description": "The latest China Beige Book report released Wednesday found \"an unmistakable first-quarter recovery\" driven by increased credit, running counter to Beijing's stated efforts to reduce reliance on debt.", "url": "https://www.cnbc.com/2019/03/27/chinas-economy-improves-as-companies-debt-rise-china-beige-book.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/02/20/105749493-1550658679041gettyimages-1091972374.1910x1000.jpeg", "publishedAt": "2019-03-27T04:03:55Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 China Economy   China's economy picks up as companies pile on debt, survey finds    The latest China Beige Book report released Wednesday found \"an unmistakable first-quarter recovery“ in China driven by increased credit. Reports of corporate borrowing in the first three months of this year reached the highest point since the middle of 2013, said the report, based on a survey of more than 3,300 Chinese businesses. However, the cost of that borrowing increased, with bank loan rates rising, according to the report. \"They're going to have to subsidize the rates if they want this to continue,\" Leland Miller, chief executive officer of China Beige Book, tells CNBC.      Evelyn Cheng | @chengevelyn   Published 27 Mins Ago  CNBC.com              Giulia Marchi | Bloomberg | Getty Images A Chinese national flag flies in front of a building under construction in the central business district of Beijing, China.   Beijing can still engineer growth on paper — at an ever-increasing cost, according to a report released on Wednesday.   The latest report by research firm China Beige Book found \"an unmistakable first-quarter recovery“ driven by increased credit, running counter to Beijing's efforts to reduce reliance on debt, or the process of deleveraging.  Revenue and profits, investment and hiring improved nationwide, as compared with both the previous quarter and year-ago period, the report said.          show chapters               China's proposed property tax could have a 'huge impact': Soho China   20 Hours Ago |  02:51        \"I don't think people understood the level (to which) there was a decision by Beijing, they were going to reverse course on deleveraging and all the progress they made,\" Leland Miller, chief executive officer of China Beige Book, said in a phone interview. \"The idea that deleveraging has continued through 2018 and into 2019, that's laughable.\"  The firm publishes a quarterly review of the economy based on a survey of more than 3,300 Chinese businesses.  Growth in the world's second largest economy slowed last year under pressure from Beijing's efforts to reduce reliance on debt — which critics say was overly harsh — and trade tensions with the U.S. In the second half of last year, Beijing jumped to stimulate with announcements of cuts to taxes and financing costs.  In the months since, the Chinese government has also repeatedly told the large state-owned banks to lend to smaller, privately-run businesses . Those firms contribute to the bulk of economic growth and employment but have traditionally had a more difficult time getting loans than the larger, state-owned corporations, causing many to turn to shadow banking. To alleviate the situation, the People's Bank of China even announced in December a special tool for lending to smaller businesses called the Targeted Medium-Term Lending Facility .      \"In China what really regulates growth is, at least at the moment, the availability of liquidity. And the availability of liquidity is a government-directed thing.\"  -David Wong, partner, PAG    All those efforts have opened the spigots of financing. The China Beige Book found that the rate of borrowing by private companies in the first quarter was greater than that of state-owned enterprises.  The survey also found that reports of corporate borrowing reached the highest point since the middle of 2013. More worryingly, the survey said the proportion of loans made through the murky world of shadow banking increased for a second-straight quarter to the highest level since the second quarter of 2016, another period marked by stimulus.  However, the cost of that borrowing increased. Every single sector and region of China saw credit costs rise in the first quarter compared with the prior quarter, the report said. The average bank loan rate was up 101 basis points to 6.9 percent, and the average non-bank rate up 426 basis points to 11.42 percent.  \"They're going to have to subsidize the rates if they want this to continue,\" Miller said. \"Again, this is China (but just) because they're able to foster a rebound in Q1 doesn't mean the rest of 2019 is going to be a clear rally.\"           GET YOUR ESSENTIAL TECH INSIGHT FROM ACROSS THE GLOBE     PODCAST SERIES  Subscribe      E-NEWSLETTER  Sign up        A short-term alleviation in China's growth concerns could be a welcome turn of events for global investors. The Shanghai composite was one of the worst performing stock indexes in the world last year, but is up more than 20 percent for 2019 so far.  \"In China what really regulates growth is, at least at the moment, the availability of liquidity. And the availability of liquidity is a government-directed thing,\" David Wong, partner at Asian alternative investment group PAG, said during a panel at the AVCJ China Forum in Beijing last week.  Besides, debt fears could be overblown, according to Wong. From a leverage perspective, the dollar-denominated debt of the Chinese government and corporations in the country is \"minuscule\" compared with the levels of most southeast Asian countries during the Asian Financial Crisis in the late 1990s, he said.  \"Given this (and the tax revenue base), I think we're not at an overleveraged situation in China,\" Wong said. \"Therefore in the foreseeable future this supercycle of growth would continue, until the point that leverage cannot continue to be sustained, even within a closed capital account system.\"          Evelyn Cheng Beijing Correspondent    Related Securities      Symbol  Price    Change  %Change      SHANGHAI   ---                                               To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}