{"author": "Andrew Martin, David Voreacos, David Kocieniewski, Bloomberg", "title": "William Barr's Letter on the Mueller Report Left These 16 Pressing Questions Unanswered", "description": "Attorney General William Barr's four-page report on the 22-month Robert Mueller Trump-Russia investigation left many unanswered questions.", "url": "http://fortune.com/2019/03/26/william-barr-robert-mueller-report-trump-russia-investigation/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/03/gettyimages-1138157372.jpg", "publishedAt": "2019-03-26T23:39:47Z", "content": "                                                William Barr's Letter on the Mueller Report Left These 16 Pressing Questions Unanswered                                Subscribe                 Home    Subscribe                                            40 Under 40    100 Best Companies to Work For    Fortune 500    Global 500    Most Powerful Women    World's 50 Greatest Leaders    World's Most Admired Companies    All Rankings        Automotive    Careers    Design    Energy    Finance    Health    International    Leadership    Luxury    Retail    Sports    Technology    Commentary    Most Powerful Women    The Ledger    Briefing    Focus    Humor    Venture    Infographics    Photography    Newsletters    Magazine    Fortune Knowledge Group    Fortune Data Store    Fortune Conferences        The 21st Century Corporation    Brainstorm Reinvent    Digital Health    Discovering Luxury    Innovation By Design    Looking Forward    Mastering the Market    MPW Mentorship    MPW Next Gen    State of the Market        About Us    Subscribe    Give a Gift    Customer Service    EU Customer Service    Work at Fortune      Stay Connected                                                                         Briefing      Mueller report        William Barr's Letter on the Mueller Report Left These 16 Pressing Questions Unanswered                                            By Andrew Martin , David Voreacos , David Kocieniewski ,\n          \n                      \n                    \n                       \n                        and Bloomberg  March 26, 2019       Attorney General William Barr’s four-page letter to Congress made clear that Special Counsel Robert Mueller’s 22-month investigation into Russian election interference was exhaustive—generating 500 search warrants, more than 2,800 subpoenas and interviews of 500 witnesses. Barr delivered a verdict on it in 48 hours, leaving many questions unanswered .  Many of those could be revealed when Barr releases a more detailed accounting of Mueller’s probe in a matter of weeks, not months, a Justice Department official said. Democrats are pushing for the release of Mueller’s entire report . In the meantime, here are some of the most pressing:  1. Why didn’t Mueller reach a finding on whether Trump tried to obstruct justice?  This is perhaps the most puzzling aspect of Barr’s letter. According to the attorney general, Mueller didn’t come to a conclusion on whether President Donald Trump obstructed justice. “While this report does not conclude that the President committed a crime, it also does not exonerate him,” Barr quotes Mueller as saying—adding that the special counsel left the decision to Barr , who cleared Trump. A special counsel is appointed in part to conduct an independent investigation, free from conflicts. So the decision to leave it to a Trump appointee and established critic of the obstruction probe is sure to draw questions from Congress.    2. Why did Mueller let Trump submit written answers, rather than sitting for an interview?  Mueller’s team long sought to interview the president. But in November, Trump’s lawyers submitted written responses to Mueller’s questions about the period before Trump became president, and about Russia-related topics. Trump declined to provide answers to questions related to his time as president or those concerning obstruction of justice.  Mueller could have subpoenaed Trump, a move that would have forced the president to choose between the potential legal risk of being interviewed under oath or the political risk of declining and taking the Fifth or claiming executive privilege. Did Mueller make a political concession to protect his investigation from Trump’s wrath? Democrats are certain to pursue this question.  3. Without interviewing the president, how is it possible to make a decision about obstruction of justice?  In his letter, Barr says prosecutors need to satisfy three legal questions to charge a person with obstruction. Did Trump have corrupt intent? Did he engage in obstructive conduct? And, did that affect a pending or contemplated proceeding? Barr said that Mueller wasn’t able to reach the legal threshold on any of those questions. But Democrats will surely want to know how they reached such a conclusion without interviewing Trump.   4. Barr’s letter suggests some instances of potential obstruction weren’t made public. Are there any clues about what they are?  Not in Barr’s letter. However, several elements of a potential obstruction case against Trump are well known. They include former FBI Director James Comey’s claim that Trump asked him to “let this go”—referring to the investigation of former National Security Adviser Michael Flynn—followed by Comey’s May 2017 firing. There was also Trump’s drafting of a misleading memo for his son to give the New York Times about the June 2016 meeting at Trump Tower with Russians. In his letter, however, Barr said “most” of the obstruction claims had been the subject of public reporting. Mueller’s report could fill in the blanks.  5. Whom did Mueller’s team interview?  As of February 2018, Trump lawyer John Dowd wrote that 20 White House officials had provided information to Mueller’s team, and 17 campaign staff members had spoken to the special counsel or congressional investigators, according to the Washington Post . That’s far short of the overall 500 witnesses that the special counsel’s office interviewed, according to Barr. Many of those names are likely to remain secret.    6. How wide-ranging is Mueller’s report?  It may be far from exhaustive, at least judging by Barr’s summary. Even its length is unclear. The attorney general says the report is divided into two parts. First are the results of the investigation into Russia’s interference in the 2016 elections. Second is a discussion of the actions by Trump “related to Russian election interference” that could raise obstruction of justice concerns.  The Russian interference component, in Barr’s telling, consists of two efforts that Mueller has already narrated in public charges—alleged disinformation operations by a Russian troll farm, and a Russian government-led hacking operation to steal and spread Democrats’ emails to influence the election. Mueller asked whether any Americans, including those in the Trump campaign, joined in. What’s unclear is whether Mueller focused narrowly on whether Americans aided those two efforts specifically, or if his report outlines investigations that veer outside those lines.    7. What conclusions did Mueller draw from the Trump campaign’s apparent discussions regarding sanctions relief and Ukraine that would be favorable to the Kremlin—at a time when Trump was negotiating to build a Trump Tower in Moscow?  Because Barr says the “principal conclusions” of Mueller’s report center on the two Russian cyber-efforts to influence the election, it leaves open the question of whether there are secondary conclusions, and how extensive those might be. There’s no direct indication in Barr’s letter that the report could delve into Russian-American interactions that weren’t related to those two efforts. There’s also no indication that Mueller’s report would cover, say, any discussions over post-election U.S. policy.  8. What unreported lines of investigation did Mueller spin off?  Barr notes that the special counsel referred several matters to other authorities. Some are known, such as a campaign-finance investigation that’s now being undertaken by federal prosecutors in Manhattan and has led to the sentencing of ex-Trump lawyer Michael Cohen. Are there others?  9. What was Mueller’s standard of proof?  Proof beyond a reasonable doubt is required for a conviction in a criminal case. Barr says he and Deputy Attorney General Rod Rosenstein applied that standard in determining that Trump didn’t obstruct justice. But lawmakers aren’t bound by such a high standard of proof in their investigations, and may have another view on what Barr said was Mueller’s other main revelation—that he “did not find that the Trump campaign or anyone associated with it conspired or coordinated with Russia in its efforts to influence the 2016 U.S. presidential election.”    10. What evidence did Mueller gather about the Trump team’s efforts to establish a back channel with Russia?  Jared Kushner, the president’s son-in-law and a senior adviser, and Michael Flynn, then an adviser on national security, both discussed setting up a secret channel of communications with influential Russians during the campaign and transition, according to media reports. During the president’s first month in office, Erik Prince, an informal Trump adviser, reportedly met with the Russian Direct Investment Fund in the Seychelles. What did Mueller’s team learn about the purpose of that meeting and the administration’s alleged efforts to sidestep normal diplomatic channels? How many of those episodes ultimately fell within Mueller’s purview?  11. What about the infamous Trump Tower meeting?  Donald Trump Jr., Paul Manafort, Kushner, and others met on June 9, 2016, with a Russian lawyer who they believed would give “dirt” on Hillary Clinton. Did Mueller learn more about that meeting than has already been made public?    12. What did Mueller conclude about then-Trump campaign chairman Manafort’s campaign-season meeting with a Russian suspected of ties to the country’s intelligence service?  Manafort met Konstantin Kilimnik—his longtime associate, whom authorities have linked to Russian intelligence—at an upscale Manhattan cigar bar on Aug. 2, 2016. That much is known from filings in Manafort’s case, which also indicate that Manafort handed Kilimnik polling data from the Trump campaign. But key details of the events remain blacked out in court filings. A Mueller prosecutor said the meeting went to the “heart” of the special counsel’s investigation. Just how it does so is a mystery the full report may answer.  13. What did Mueller conclude about longtime Trump ally Roger Stone’s interactions regarding WikiLeaks?  Starting in June 2016, anti-secrecy organization WikiLeaks began publishing Democratic emails that Mueller has said were stolen by Russian hackers. Stone told Trump campaign officials that he had information about WikiLeaks releasing documents that would be damaging to Clinton, according to prosecutors. Trump campaign officials allegedly pressed Stone to find out when more dumps of Clinton material would be coming. And Stone used Twitter to contact Guccifer 2.0, which Mueller said was an alias for the Russian intelligence officers who stole the emails.    There was speculation that Stone could have been a conduit to WikiLeaks—but no direct connection has been established. (Stone has pleaded not guilty to charges he lied to congressional investigators about the matter and engaged in witness tampering.)  14. What happened to the draft charges against Jerome Corsi, the political gadfly who allegedly acted as an intermediary between Stone and WikiLeaks?  Mueller’s team was said to have offered Corsi a deal in which he would have pleaded guilty to perjury over statements he made about his interactions with WikiLeaks. He refused, gave copies of the draft agreement to the news media and ridiculed Mueller’s investigation in interviews. Because Corsi wasn’t charged, details about the investigation of him may remain under wraps.  15. Will we ever know if Russia’s sabotage attempts swayed the 2016 election?  It’s hard to know if Mueller addressed this question. One problem is that it’s hard to measure the impact of disparate social media campaigns and the flood of hacked Democratic emails, though they surely hurt Clinton’s campaign.  16. Did Mueller recommend ways to prevent foreign interference in future U.S. elections?  Mueller already laid out, in indictments last year, the two alleged conspiracies by the Russian government to disrupt the 2016 U.S. elections. That gave his team access to a wide range of grand jury testimony and other confidential material that could inform the U.S.’s actions to prevent future attacks on the electoral system.                 SPONSORED FINANCIAL CONTENT        You May Like                 Read More      Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                        EDIT POST                                Subscribe & Save  Subscribe today and save 79% off the cover price.    SUBSCRIBE NOW                  Sign Up for Our Newsletters  Sign up now to receive FORTUNE's best content, special offers, and much more.    SUBSCRIBE                                         40 Under 40  100 Best Companies to Work For  Fortune 500  Global 500  Most Powerful Women in Business  World's 50 Greatest Leaders  World's Most Admired Companies  Brainstorm Reinvent  All Rankings       Home  Automotive  Careers  Design  Energy & Environment  Executive Travel  Finance  Commentary       Health  International  Leadership  Luxury  Markets  Most Powerful Women  Retail  Sports       Technology  The Ledger  Venture  Photography  Podcasts  Videos  Newsletters  Magazine       Fortune Knowledge Group  Fortune Data Store  Fortune Conferences  Customer Service  EU Customer Service  Site Map  Privacy Policy  Advertising       About Us  Subscribe  Give a Gift  Ad Choices  Terms of Use  Your California Privacy Rights     © 2018 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy ( Your California Privacy Rights ). Fortune may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by Interactive Data . ETF and Mutual Fund data provided by Morningstar , Inc. Dow Jones Terms & Conditions: http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html . S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions . Powered and implemented by Interactive Data Managed Solutions . | EU Data Subject Requests        ", "category": "business"}