{"author": "Leslie Josephs", "title": "Southwest Boeing 737 Max made an emergency landing in Orlando; FAA cites engine issue unrelated to recent crashes", "description": "A Southwest Airlines Boeing 737 Max made an emergency landing in Orlando Tuesday because of an engine issue unrelated to recent crashes, the FAA said.", "url": "https://www.cnbc.com/2019/03/26/southwest-boeing-737-max-reportedly-made-an-emergency-landing-at-orlando-international-airport.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/13/105792022-1552509922326gettyimages-1135177343r.1910x1000.jpg", "publishedAt": "2019-03-26T20:32:35Z", "content": "                                                        html × LOG IN SIGN UP Keep Me Logged In Sign In Pro Watchlist Make It USA INTL Markets Pre-Markets U.S. Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Watchlist Business Economy Finance Health & Science Media Real Estate Energy Transportation Industrials Retail Wealth Small Business Investing Invest In You Personal Finance Financial Advisors Trading Nation Futures Now Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity Enterprise Internet Media Mobile Social Media Venture Capital Tech Guide Politics White House Policy Defense Congress Elections CNBC TV Live TV Live Audio Latest Video Top Video Business Day Shows Primetime Shows Digital Originals Full Episodes Menu SEARCH QUOTES                 Airlines     Airlines    Transportation Infrastructure    Road and Rail    Autos    Outer Space      Southwest Boeing 737 Max makes emergency landing in Orlando; FAA cites engine issue unrelated to recent crashes    The crew of a Southwest Airlines Boeing 737 Max declared an emergency shortly after takeoff from Orlando. They reported an engine problem, unrelated to issues that prompted the FAA to ground the planes, the agency says. No passengers were aboard the plane. Southwest is ferrying the planes for storage in California.      Leslie Josephs | @lesliejosephs   Published 5 Hours Ago  Updated  4 Hours Ago  CNBC.com                show chapters               Southwest Boeing 737 Max flight makes emergency landing following engine issue   5 Hours Ago |  01:23        The crew of a Southwest Airlines  Boeing 737 Max declared an emergency shortly after takeoff and returned to Orlando's main airport on Tuesday after reporting an engine problem, the Federal Aviation Administration said.   The FAA grounded this type of aircraft earlier this month following two fatal crashes of the popular model.  Airlines aren't allowed to fly passengers under the FAA's order. The Southwest plane, which was not carrying passengers, was bound for Victorville, Calif., where the carrier is storing the aircraft in a facility in the western Mojave Desert.   The FAA on March 13 joined dozens of other countries in grounding the planes, following the crash of Ethiopian Airlines Flight 302, a Boeing 737 Max 8. All 157 passengers on board were killed and investigators said the crash had \"clear similarities\" with a Lion Air flight in October, operated by the same type of plane, plunged into the Java Sea in Indonesia, killing the 189 people on board.  The FAA said it is investigating the Southwest incident on Tuesday and that the issue was not related to other concerns about the 737 Max that led the agency to ground the plane.  Southwest Flight 8701, the ferry flight, returned to Orlando International Airport shortly before 3 p.m. EDT after the pilots \"reported a performance issue with one of the engines shortly after takeoff,\" Southwest said in a statement. \"The crew followed protocol and safely landed back at the airport.\"  A Southwest spokesman said the plane did not experience any issues with control, such as the controversial automated anti-stall system Boeing added to the planes before their debut in 2017.  Investigators in the Lion Air crash suspect that pilots were battling the Maneuvering Characteristics Augmentation System, or MCAS, which automatically pushes the nose of the plane down to avoid a stall. That can be catastrophic if the plane's sensor erroneously signals to the plane that it is in a stall when it is not.  Boeing has tweaked the system, which was tested by pilots over the weekend in Renton, Wash., where the company assembles the plane. The changes include using data from two sensors instead of one and limiting the number of nose-down positions the plane will take if the system is engaged.  Pilots received a short computer course before transitioning to the Max from older 737s and said they did not know the MCAS system existed until after the Lion Air crash.  Boeing submitted its certification plan for the software update to the FAA in January and conducted a test flight with new software along with the FAA on March 12. That flight showed the 737 Max with the new software \"still meets certification requirements,\" a company official said Tuesday.  — CNBC's  Phil LeBeau  contributed to this report.          Leslie Josephs Airline Reporter for CNBC.com    Related Securities      Symbol  Price    Change  %Change      BA   ---      LUV   ---                                               To view this site, you need to have JavaScript enabled in your browser, and either the Flash Plugin or an HTML5-Video enabled browser. Download the latest Flash player and try again.       Playing      Share this video...    ×    Watch Next...        html Subscribe to CNBC PRO Licensing & Reprints Join the CNBC Panel Supply Chain Values Advertise With Us Closed Captioning Digital Products Terms of Service Privacy Policy News Releases Internships Corrections About CNBC AdChoices Site Map Podcasts Contact Careers Help News Tips Got a confidential news tip? We want to hear from you. Get In Touch CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox Sign Up Now Get this delivered to your inbox, and more info about our products and services. Privacy Policy. © 2019 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by                                                   ", "category": "business"}