{"author": "James Vincent", "title": "Europe’s controversial overhaul of online copyright receives final approval", "description": "The European Parliament has voted in favor of the final text of the Copyright Directive — controversial new legislation that redefines copyright in Europe for the internet age.", "url": "https://www.theverge.com/2019/3/26/18280726/europe-copyright-directive", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9sqgyakAq8K6gEdOfjUht15jxK4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13054499/mdoying_180915_1777_0001.jpg", "publishedAt": "2019-03-26T12:00:10Z", "content": "                                                                           Log In or Sign Up     Log In    Sign Up              Tech     Reviews     Science     Entertainment     Video    Features    Podcasts    Newsletters    Store    More                   Tech      Video    Amazon    Apple    Facebook    Google      Microsoft    Samsung    Tesla    AI    Cars      Cybersecurity    Mobile    Policy    Privacy    Scooters     All Tech      Reviews      Phones    Laptops    Headphones    Cameras      Tablets    Smartwatches    Speakers    Drones      Accessories    This is my Next    How-to    Good Deals     More from Verge Guidebook      Science      Video    Space    NASA    SpaceX      Health    Energy    Environment     All Science      Entertainment      Film    TV    YouTube      Games    Fortnite    Books      Comics    Music     All Entertainment      Video    Features    Podcasts    Newsletters    Store   ✕                  Policy      US & World      Tech       Europe’s controversial overhaul of online copyright receives final approval     New,   85  comments      The much-criticized ‘upload filter’ and ‘link tax’ will soon become law in EU nations  By  James Vincent    Mar 26, 2019,  8:00am EDT        Share     Tweet        Share     Share  Europe’s controversial overhaul of online copyright receives final approval      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Graphics by Michele Doying / The Verge     The European Parliament has given final approval to the Copyright Directive, a controversial package of legislation designed to update copyright law in Europe for the internet age.  Members of parliament voted 348 in favor of the law and 274 against. A last-minute proposal to remove the law’s most controversial clause — known as Article 13 or the ‘upload filter’ — was narrowly rejected by just five votes. The directive will now be passed on to EU member states, who will have 24 months to translate it into national law.  The Copyright Directive has been in the works for more than two years, and has been the subject of fierce lobbying from tech giants, copyright holders, and digital rights activists.  a “dark day for internet freedom”  Julia Reda, an MEP for the German Pirate Party who led much opposition to the directive, said it was a “dark day for internet freedom.” Andrus Ansip, vice president of the European Commission and a key advocate for the law, said it was a “big step ahead” that would unify Europe’s digital market while protecting “online creativity.”  Details of legislation will have to be decided by individual EU member states, but the law will likely have a huge impact on how the internet works in Europe and further afield. As we saw with GDPR, the EU’s data protection legislation , European laws can influence US policy.  Advocates of the directive say it will balance the playing field between American tech giants and European content creators, giving copyright holders power over how internet platforms distribute their content. But critics say the law is vague and poorly thought-out, and will end up restricting how content is shared online, stifling innovation and free speech.    Dark day for internet freedom: The @Europarl_EN has rubber-stamped copyright reform including #Article13 and #Article11 . MEPs refused to even consider amendments. The results of the final vote: 348 in favor, 274 against #SaveYourInternet  pic.twitter.com/8bHaPEEUk3 — Julia Reda (@Senficon) March 26, 2019     The internet’s new police: the ‘link tax’ and ‘upload filter’  Despite setbacks , the most controversial clauses in the Copyright Directive — Article 11 or the ‘link tax’ and Article 13 or the ‘upload filter’ — have remained largely intact.  Article 11 lets publishers charge platforms like Google News when they display snippets of news stories, while Article 13 (renamed Article 17 in the most recent draft of the legislation) gives sites like YouTube new duties to stop users from uploading copyrighted content.  In both cases, critics say these well-intentioned laws will create trouble. Article 13, for example, could lead to the introduction of “upload filters” that will scan all user content before it’s uploaded to sites to remove copyrighted material. The law does not explicitly call for such filters, but critics say it will be an inevitability as sites seek to avoid penalties.  Advocates for the directive say that claims Article 13 will “kill off memes” are exaggerations, and that the legislation includes protections for parody. But experts say any filters that are introduced will likely be error-prone and ineffective. They also note that given the cost of deploying such technology, the law may have the opposite effect to its intent — accidentally solidifying the dominance of US tech giants over online spaces.  The possible effects of the link tax are equally tricky to predict. The law is mainly focused on services like Google Search and Google News, which show snippets of news articles. Google has said that if newspaper choose to charge licenses for this material it will be forced to strip back the content it shows in search and shutter Google News altogether.  Critics have accused the company of deploying scare tactics, circulating stripped-down screenshots of Google Search like the one below. But the link tax has been introduced in both Germany and Spain, and both times it was a failure.            Google’s proposal for what Google Search could look like under Article 11 of the copyright directive.  Credit: Google    ACTIVISTS COMMISERATE, COPYRIGHT HOLDERS CELEBRATE  The approval of the copyright directive will be upsetting for many across Europe. More than one hundred thousand individuals have protested the legislation over the past few weeks, and more than five million signed a petition calling for the removal of Article 13. Last week, sites including Reddit, PornHub, and Wikipedia also protested the legislation.  Most individuals are worried that their experience of the web will be adversely affected, but the legislation will also have a huge affect on business people. “Anyone developing a platform with EU users that involves sharing links or content faces great uncertainty,” said Tal Niv, vice president of law and policy at code depository GitHub, in a statement. “The ramifications include being unable to develop features that web users currently expect, and having to implement very expensive and inaccurate automated filtering.”  Google said that the will “lead to legal uncertainty and will hurt Europe’s creative and digital economies.” The company added that the exact implementation of the directive by member states would be crucial. “The details matter, and we look forward to working with policy makers, publishers, creators and rights holders,” said a spokesperson.  Despite these reactions, industry groups from the world of music, publishing, and film celebrated the passage of the law. “This is a vote against content theft,” said Xavier Bouckaert, president of the European Magazine Media Association in a press statement. “Publishers of all sizes and other creators will now have the right to set terms and conditions for others to re-use their content commercially, as is only fair and appropriate.”  Experts in copyright law said that despite both jubilant and unhappy reactions, the real test is yet to come. “This outcome is unpopular with digital services and importantly, many European voters,” said Raffaella De Santis, technology and media lawyer at Harbottle & Lewis in a statement. “The key focus now will be on how the directive is implemented across the EU over the next two years.”       Next Up In Tech                         Most Read                  Apple announces Apple Card credit card  Coming summer 2019              The Apple Card is Apple’s thinnest and lightest status symbol ever  There was one hardware announcement at Apple’s services event              All the things Apple didn’t tell us about its streaming TV service  Apple TV Plus is more mysterious than familiar                        Command Line Command Line delivers daily updates from the near-future.    email address...    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 13. The sidebar size is medium.         Loading comments...            Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved          tweet     share    ", "category": "technology"}