{"author": "Matthew Beedham", "title": "‘First cryptocurrency football club’ is still paying players’ salaries in fiat", "description": "Contrary to what was promised last year, semi-professional football team Gibraltar United is still not paying its players in cryptocurrency. In July 2018, The Guardian reported the Gibraltar Premier division team will be the first one to “pay players in cryptocurrency.” Club founder and majority owner, Pablo Dana, said all player contracts will include payment […]", "url": "https://thenextweb.com/hardfork/2019/03/26/gibraltar-united-hasnt-paid-cryptocurrency/", "urlToImage": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F03%2Fgibraltar-united-gibraltar-united-cryptocurrency-blockchain-quantocoin-dana-salar-bonus.png&signature=c6d8eb0e52b47197ad85224fc0f2dab9", "publishedAt": "2019-03-26T14:16:01Z", "content": "         TNW News   Latest  Hard Fork  Plugged  The Next Police  IoT Lab  Investing 2.0  Fundamentals     More TNW   News  Events    - TNW Conference 2019    - Hard Fork Decentralized 2018     Enterprise  Intelligence  Answers  Spaces   About TNW   About  Team  Advertise  Jobs  Contact                News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces    About  Team  Advertise  Jobs  Contact      Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.    Got it!  or More info                The TNW2019 map is here – 40,000m2 of tech festival! Check it out →              Powered by      Blockchain, cryptocurrencies, and insider stories by TNW.            Insights  Gibraltar  Cryptocurrency  Wallet  Fiat money  Mobile app  blockchain   ‘First cryptocurrency football club’ is still paying players’ salaries in fiat  Gibraltar United yet to see through on its promise                            Story by  Matthew Beedham       67  Shares                Contrary to what was promised last year, semi-professional football team Gibraltar United is still not paying its players in cryptocurrency.  In July 2018, The Guardian reported the Gibraltar Premier division team will be the first one to “pay players in cryptocurrency.” Club founder and majority owner, Pablo Dana, said all player contracts will include payment agreements in cryptocurrency by next season.     “All players and staff will be requested to open a digital wallet and they will be able to choose to receive their salaries in fiat or QTC [Quantocoin],” a Gibraltar United spokesperson told Hard Fork in an email last August. “This said all future bonuses will exclusively be paid in crypto.”  Indeed, there were even plans to integrate cryptocurrency payments into other clubs owned by Dana. “This will also be the case for the other teams where [Dana’s holding] is a shareholder in Italy, Spain and Portugal,” the spokesperson added. “Gibraltar is the starter. We announced this already back in January this year that the start of the 2018-2019 season would see the team adopt the cryptocurrency.”  Despite these lofty ambitions though, the season is nearing its end and there is still no sign that players are receiving their salaries in digital assets.  What happened?  The plan was to manage players’ payroll with an app called Quantocoin. To receive salaries in cryptocurrency, players would have to download the app and open a wallet, where they could receive Quantocoin’s native token, QTC. Claiming to be a “blockchain bank,” Dana told Hard Fork in August that players would be able to convert QTC tokens into other cryptocurrencies (and perhaps even fiat) directly from the app.  This model, Dana said, would help players avoid some of the challenges they face when setting up local bank accounts. Quantocoin thought it could help players by providing an alternative banking platform.  “Once the players receive the QTCt, they can change them into altcoins or fiat at their own wish,” Dana told Hard Fork when the news first dropped. “QTCt shall be on major exchanges within days,” he added.  That was back in August, 2018. Eight months later, QTCt is yet to start trading on any cryptocurrency exchanges. This means that even if the salaries and bonuses were distributed in cryptocurrency, players would have no easy way of using them outside of the Quantocoin app – let alone converting them to fiat.  It should also be noted that Dana is a major investor in Quantocoin and is listed on its website as one its “key people.” He clearly stands to benefit if Quantocoin becomes popular.   At press time, Quantocoin claims to be in the final stage of its initial coin offering (ICO), which it has branded as a distributional token offering (DTO). This appears to be the only way of acquiring tokens, yet there is nowhere to actively trade them.  The update  Hard Fork contacted staff and players at Gibraltar United to find out when, or if at all, players could expect to be paid in cryptocurrency.  One player confirmed to Hard Fork that neither he, nor anyone else in the team, has received any salary or bonus payments in cryptocurrency to date.  “There is an agreement in place to receive prize money or bonuses in Quantocoin,” the player continued. “Once the app is fully running we will also have the option to get paid in Quantocoin or in normal currency as we are now.”  While the Quantocoin app is available on Google play, it has not been updated since it launched last June and has had barely any downloads; just 50 at the time of writing.               The player didn’t know when it would be fully functional. While there is an “agreement” for players to receive prize money or bonuses in cryptocurrency, none of them have actually received any.  Even so, the player believes the team is “keen on bonuses [being] paid in crypto as it’s a growing thing in Gibraltar.”  Hard Fork contacted Dana to inquire about Quantocoin’s status, but the Gibraltar United president declined to comment on both occasions.  “We lost enough time with you,” Dana told us, referring to a previous line of inquiry Hard Fork initiated back in August, when Gibraltar United first made headlines with its intention to pay players in cryptocurrency.  At the time, Dana boasted Gibraltar United will be the first football club in the world to integrate cryptocurrency payments for salaries and bonuses. Indeed, the announcement attracted coverage from a number of outlets, including CCN and Bitcoin.com , among many others.  As we already mentioned, the news even made it to The Guardian.  But for all the press Gibraltar United received, the club has yet to deliver on its promises.  A familiar story  Last year, a similar story came to light after reports suggested Argentina would be getting 1,600 Bitcoin ATMs before the end of 2019 , 150 of which would be installed by the end of 2018. However, months later after being contacted by Hard Fork the Bitcoin ATM operator, Odyssey, began backtracking on its promises.  Odyssey had previously said that it had installed 200 BATMs in Argentina in 2017, but months later, retreated on promises when questioned.  The blockchain and cryptocurrency industry relies heavily on making promises of what the future will be like if these promises come to fruition. In many cases, Gibraltar United included, it’s these visions that are being sold , rather than a working technology.  Last August, Dana told Hard Fork he believes blockchain has lots to offer to the sports industry.  “Football must become more transparent and less corrupted, and blockchain is the right way to showcase this reality,” he said. “For us, it is a fabulous opportunity to lead the way and finally bring real transparency to the table.”  He also predicted that we’re close to mass adoption, and we will all be getting paid in cryptocurrency soon enough – without any need to convert our salaries to fiat.  Asked about when he foresees cryptocurrencies will hit the mainstream, he responded confidently: “24 months.”  Additional reporting by Mix  Did you know? Hard Fork has its own stage at  TNW2019 , our tech conference in Amsterdam.  Check it out .  Published March 26, 2019 — 14:16 UTC               Matthew Beedham  March 26, 2019 — 14:16 UTC     Read more        Most popular      Facebook is hiring 22 people for its secretive blockchain division          Learn to trade                        The Heart of Tech™      More TNW   News  Events  Enterprise  Intelligence  Answers  Spaces       About TNW   About  Team  Advertise  Jobs  Contact          Stay tuned    Thank you!       Weekly     Daily     Breaking         OK                  Copyright © 2006—2019.  All rights reserved.  Made with ♥ in Amsterdam.               ", "category": "technology"}