{"author": "Rachel Kaser", "title": "Blizzard tweaks loot boxes in Heroes of the Storm amid gambling controversy", "description": "Players of Blizzard's Heroes of the Storm noticed something in the latest patch notes: the developers were removing the ability to buy loot boxes with real money. Given the battle that ...", "url": "https://thenextweb.com/gaming/2019/03/26/blizzard-loot-boxes-heroes-of-the-storm-gambling/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F03%2FHeroes-of-the-Storm.jpg&signature=bf99f5ddbfe8f55c5f3a5ea844cedb6f", "publishedAt": "2019-03-26T15:20:03Z", "content": "                                                                                  News  Events   Index  TQ  Deals  Answers  TNW X     News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces     Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.    Got it!  or More info                          Sections   Latest  Insights  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0     About TNW   About Team Advertise Jobs Contact   TNW Sites   News Conference Hard Fork Decentralized Index TQ Deals Answers Cyberspace Culture        The TNW2019 map is here – 40,000m2 of tech festival! Check it out →             Blizzard tweaks loot boxes in Heroes of the Storm amid gambling controversy    by Rachel Kaser — in Gaming        Credit:\n        Blizzard      33  shares                                                      Players of Blizzard’s Heroes of the Storm noticed something in the latest patch notes: the developers were removing the ability to buy loot boxes with real money. Given the battle that game publishers are fighting with officials across the globe over loot boxes, it’s possible this is an sign of things to come — an experiment Blizzard is running with one of its smaller games that could prevent trouble for its bigger ones, and gauge how an invested community of gamers will respond.  According to the Heroes patch notes, “Loot chests are no longer available for Gem purchase… Rare loot chests are now available for Gold purchase (3000 each).” For those not familiar, Gems are the only form of in-game currency that can be obtained with real-world money. Players get Gold by playing. It’s hard not to see this as an attempt to separate Heroes from the accusations of loot box gambling that have plagued the games industry for a few years now.      Check out the lineup so far for TNW2019  Google, Reddit, and Slack will be there.   Join them    While daily developments on the loot box front have cooled somewhat from the fever pitch at which they burned over the last few years, they’re still a controversial topic in the industry. The FTC is reportedly still in the process of investigating the practice , to see if they constitute a threat to consumers, though the investigation was suspended during the government shut-down. Some European countries have already taken legal steps against them, including Belgium (which has outlawed them) and the Netherlands (which is reportedly forcing some games to modify them, though authorities haven’t disclosed which ones).  The controversy has always been that when you buy loot boxes, you don’t know what you could be buying, and therefore it’s a little closer to gambling than anyone would like — particularly since kids play the games. To be clear, you can still buy specific heroes, gameplay boosts, and other items within the game with Gems. You just can’t use Gems to buy loot chests, meaning it’s technically no longer gambling. It’s not the most thorough solution — that would be to do away with loot chests entirely — but it’s a way of wriggling out of the more problematic aspects of the game feature.  For players of the game, this is neither the biggest nor most serious change to the game in the last few months. Blizzard has been steadily scaling back support for Heroes , up to and including dismantling its official esports league . This relative obscurity makes Heroes the perfect guinea pig for changes that could cause major upset in one of the company’s bigger games. Overwatch , for example, still has purchasable loot boxes, but that’s a game with a much more robust esports scene and an ardent community whose reaction is harder to predict. By starting with Heroes , Blizzard is testing the change in a smaller pond. So far, gamers barely seem to have noticed, and those who do are positive about it.  We’ve contacted Blizzard for more information. The changes in this patch are now live in the game.  TNW Conference 2019 is coming! Check out our glorious new location, inspiring line-up of speakers and activities, and how to be a part of this annual tech bonanza by clicking here .   Read next:  Here’s how to exhibit your startup for free at TNW2019    Tech       Share on Facebook (14)      Share on Twitter (19)             Most popular      1   European Parliament votes ‘yes’ on controversial Copyright Reform     Már Másson Maack            2   Inside GitHub’s fight to protect devs from EU’s disastrous Copyright Reform     Már Másson Maack            3   Apple announces Apple Card, a titanium credit card that aims to revolutionize payments     Rachel Kaser            4   Facebook is hiring 22 people for its secretive blockchain division     Matthew Beedham            5   Xiaomi's new 100W charger will charge your phone in just 17 minutes     Ivan Mehta             Never miss out  Stay tuned with our weekly recap of what’s hot & cool by our CEO Boris .     T h a n k  y o u !          Do it     Join over 260,000 subscribers!    Who's Hiring Add your company         Latest      1   This app exposes which cryptocurrency a user is most likely to shill on Twitter     David Canellis            2   Here’s how to exhibit your startup for free at TNW2019     Ailsa Sherrington            3   Blizzard tweaks loot boxes in Heroes of the Storm amid gambling controversy     Rachel Kaser            4   CERN’s new study brings us closer to understanding antimatter and why we exist     The Conversation            5   Google accidentally promoted a malicious Bitcoin wallet on YouTube     Yessi Bello Perez                               Events  About  Team  Advertise  Jobs  Contact        © 2006–2019 The Next Web B.V.  Made with ♥ in Amsterdam.  Powered by        Stay tuned     Treat yourself  Sit back and let the hottest tech news come to you by the magic of electronic mail.    T h a n k  y o u !          Sign up     Prefer to get the news as it happens? Follow us on social media.       1.76M followers         1M likes           Help us out     Who are you?  Got two minutes to spare? We'd love to know a bit more about our readers.  Start!   All data collected in the survey is anonymous.                                                          ↑  ↓ Navigate up/down   Enter Go to article   / Search new term   Esc Close search  ", "category": "technology"}