{"author": "Jean Twenge", "title": "Teens have less face time with their friends – and are lonelier than ever", "description": "In the late 1970s, 52 percent of 12th-graders hung out with their friends almost every day. By 2017, only 28 percent were doing so.", "url": "https://theconversation.com/teens-have-less-face-time-with-their-friends-and-are-lonelier-than-ever-113240", "urlToImage": "https://images.theconversation.com/files/264693/original/file-20190319-60956-6picsy.jpg?ixlib=rb-1.1.0&rect=22%2C1123%2C5005%2C2502&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2019-03-20T17:36:56Z", "content": "            Editions    Africa  Australia  Canada  Canada (français)  España  France  Global Perspectives  Indonesia  New Zealand  United Kingdom  United States      Sections    Home    Arts + Culture    Economy + Business    Education    Environment + Energy    Ethics + Religion    Health + Medicine    Politics + Society    Science + Technology   En Español     Search        Services    Newsletter     Read on Play Newsstand    Read on Apple News    Read on Flipboard      Information   Who we are  Our charter  Our team  Partners and funders  Republishing guidelines  Contact us   Donate   Friends of The Conversation  Privacy policy  Terms and conditions  Corrections                   Edition:     Available editions    United States       Africa    Australia    Canada    Canada (français)    España    France    Global Perspectives    Indonesia    New Zealand    United Kingdom        Donate        Become an author    Sign up as a reader    Sign in          Get newsletter                               Search           Academic rigor, journalistic flair      Arts + Culture    Economy + Business    Education    Environment + Energy    Ethics + Religion    Health + Medicine    Politics + Society    Science + Technology            Follow Topics     Ebola    ISIS    Explainer    Foundation essays US                   Teens have less face time with their friends – and are lonelier than ever     March 20, 2019 1.36pm EDT      Teens aren’t necessarily less social, but the contours of their social lives have changed. pxhere           Teens have less face time with their friends – and are lonelier than ever     March 20, 2019 1.36pm EDT          Jean Twenge , San Diego State University     Author      Jean Twenge   Professor of Psychology, San Diego State University       Disclosure statement  Jean Twenge does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.    Partners  View all partners    Republish this article   Republish our articles for free, online or in print, under Creative Commons license.          Email     Twitter     Facebook     LinkedIn     WhatsApp     Messenger       Ask a teen today how she communicates with her friends, and she’ll probably hold up her smartphone. Not that she actually calls her friends; it’s more likely that she texts them or messages them on social media.  Today’s teens – the generation I call “ iGen ” that’s also called Gen Z – are constantly connected with their friends via digital media, spending as much as nine hours a day on average with screens.  How might this influence the time they spend with their friends in person?  Some studies have found that people who spend more time on social media actually have more face time with friends .  But studies like this are only looking at people already operating in a world suffused with smartphones. They can’t tell us how teens spent their time before and after digital media use surged .  What if we zoomed out and compared how often previous generations of teens spent time with their friends to how often today’s teens are doing so? And what if we also saw how feelings of loneliness differed across the generations?  To do this, my co-authors and I examined trends in how 8.2 million U.S. teens spent time with their friends since the 1970s. It turns out that today’s teens are socializing with friends in fundamentally different ways – and also happen to be the loneliest generation on record.  Less work, but fewer hangs?  After studying two large, nationally representative surveys, we found that although the amount of time teens spent with their friends face to face has declined since the 1970s, the drop accelerated after 2010 – just as smartphones use started to grow.  Compared with teenagers in previous decades, iGen teens are less likely to get together with their friends. They’re also less likely to go to parties, go out with friends, date, ride in cars for fun, go to shopping malls or go to the movies.  It’s not because they are spending more time on work, homework or extracurricular activities. Today’s teens hold fewer paid jobs, homework time is either unchanged or down since the 1990s, and time spent on extracurricular activities is about the same.  Yet they’re spending less time with their friends in person – and by large margins. In the late 1970s, 52 percent of 12th-graders got together with their friends almost every day. By 2017, only 28 percent did. The drop was especially pronounced after 2010.   Today’s 10th-graders go to about 17 fewer parties a year than 10th-graders in the 1980s did. Overall, 12th-graders now spend an hour less on in-person social interaction on an average day than their Gen X predecessors did.  We wondered if these trends would have implications for feelings of loneliness, which are also measured in one of the surveys. Sure enough, just as the drop in face-to-face time accelerated after 2010, teens’ feelings of loneliness shot upward.  Among 12th graders, 39 percent said they often felt lonely in 2017, up from 26 percent in 2012. Thirty-eight percent said they often felt left out in 2017, up from 30 percent in 2012. In both cases, the 2017 numbers were all-time highs since the questions were first asked in 1977, with loneliness declining among teens before suddenly increasing.   A new cultural norm  As previous studies have shown, we did find that those teens who spent more time on social media also spent more time with their friends in person.  So why have in-person social interactions been going down, overall, as digital media use has increased?  It has to do with the group versus the individual.  Imagine a group of friends that doesn’t use social media. This group regularly gets together, but the more outgoing members are willing to hang out more than others, who might stay home once in a while. Then they all sign up for Instagram. The social teens are still more likely to meet up in person, and they’re also more active on their accounts.  However, the total number of in-person hangs for everyone in the group drops as social media replaces some face-to-face time.  So the decline in face-to-face interaction among teens isn’t just an individual issue; it’s a generational one. Even teens who eschew social media are affected: Who will hang out with them when most of their peers are alone in their bedrooms scrolling through Instagram?  Higher levels of loneliness are just the tip of the iceberg. Rates of depression and unhappiness also skyrocketed among teens after 2012, perhaps because spending more time with screens and less time with friends isn’t the best formula for mental health.  Some have argued that teens are simply choosing to communicate with their friends in a different way , so the shift toward electronic communication isn’t concerning.  That argument assumes that electronic communication is just as good for assuaging loneliness and depression as face-to-face interaction. It seems clear that this isn’t the case. There’s something about being around another person – about touch, about eye contact, about laughter – that can’t be replaced by digital communication.  The result is a generation of teens who are lonelier than ever before.       Generations    Loneliness    Friendship    High school    Dating    Digital age    Teens    Generation X    Social interaction          Tweet     Share      Get newsletter  Newsletter         You might also like          Between 2009 and 2017, rates of major depression among 20- to 21-year-olds more than doubled.  Ana Ado/Shutterstock.com     The mental health crisis among America’s youth is real – and staggering            Edward Hopper’s ‘Office in a Small City’ (1953).  Gandalf's Gallery     A history of loneliness            Joshua Speed found his BFF in Abraham Lincoln.  Wikimedia Commons     Did Abraham Lincoln’s bromance alter the course of American history?            Is a relationship that’s quick to form quick to fall apart?  \"Chatting\" via www.shutterstock.com     Are dating apps killing long-term relationships?              Most popular on The Conversation   Escalator etiquette: Should I stand or walk for an efficient ride?  White nationalism, born in the USA, is now a global terror threat  Jupiter’s Great Red Spot: A 300-year -old cyclone persists but is shrinking  Thich Nhat Hanh, the Buddhist monk who introduced mindfulness to the West, prepares to die  New evidence for a human magnetic sense that lets your brain detect the Earth’s magnetic field    Why Trump’s recognition of the Golan Heights as Israeli territory matters  Skip this chore: Cleaning your air conditioner condenser probably won’t make it work better  Your pet on pot, or even CBD: Not a good thing, a vet toxicologist explains  Boeing is doing crisis management all wrong – here’s what a company needs to do to restore the public’s trust  Boeing 737 Max: The FAA wanted a safe plane – but didn’t want to hurt America’s biggest exporter either       Expert Database    Find experts with knowledge in: *          Want to write?  Write an article and join a growing community of more than 81,600 academics and researchers from 2,779 institutions.   Register now             The Conversation      Community    Community standards  Republishing guidelines  Friends of The Conversation  Research and Expert Database    Analytics   Our feeds    Donate       Company    Who we are  Our charter  Our team  Partners and funders  Resource for media  Contact us  Work with us  En Español      Stay informed and subscribe to our free daily newsletter and get the latest analysis and commentary directly in your inbox.        Email address   ✔          Follow us on social media                     Privacy policy  Terms and conditions  Corrections    Copyright © 2010–2019 , The Conversation US, Inc.              ", "category": "technology"}