{"author": "Anthony Ha, Jordan Crook", "title": "Original Content podcast: 'Triple Frontier' sends famous faces on a grim hike over the Andes", "description": "Even by the standards of the often, ah, “wide-ranging” conversations on the Original Content podcast, this latest episode covers a lot of ground. The initial focus is “Triple Frontier,” a film directed by J.C. Chandor and starring Ben Affleck, Oscar Isaac, Pedro Pascal, Char…", "url": "https://techcrunch.com/2019/03/26/original-content-triple-frontier/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/TF_UNIT_0009_F.jpg?w=600", "publishedAt": "2019-03-26T21:47:57Z", "content": "                        Original Content podcast: ‘Triple Frontier’ sends famous faces on a grim hike over the Andes     Anthony Ha  Jordan Crook  14 hours         Even by the standards of the often, ah, “wide-ranging” conversations on the Original Content podcast , this latest episode covers a lot of ground.  The initial focus is “Triple Frontier,” a film directed by J.C. Chandor and starring Ben Affleck, Oscar Isaac, Pedro Pascal, Charlie Hunnam and Garrett Hedlund as friends who served in the special forces together, and who reunite to rob an infamous drug lord.  The film starts off as a relatively straightforward thriller, but in its second half, it becomes increasingly focused on the morality of these former soldiers, and even more on the mechanics of the robbery — not how you’d steal $250 million in cash, but how you’d actually get that money home.  As you probably guessed, things do not go according to plan, and we’re soon treated to multiple shots of handsome men grimly dragging duffel bags of money over the mountains. It’s an intriguing idea, even if it doesn’t quite deliver the emotional payoff that we’d hoped for.  Because we’re joined by the podcast’s original co-host Darrell Etherington, we also take some time to recap the latest season of “The Bachelor,” and to debate Netflix’s decision to test out different episode orders for the anthologies series “Love, Death & Robots,” which then leads to a discussion of a recent piece by the critic Sean T. Collins arguing that Netflix is taking a depressingly derivative and uninspired approach to TV.  We close the episode with a spoiler-filled discussion of “The Umbrella Academy” — which we reviewed a few weeks ago , but seemed worth revisiting, now that we’ve all finished the first season.  You can listen in the player below, subscribe using Apple Podcasts or find us in your podcast player of choice. If you like the show, please let us know by leaving a review on Apple. You also can send us feedback directly . (Or suggest shows and movies for us to review!)                         ", "category": "technology"}