{"author": "Connie Loizos", "title": "A new lawsuit involving Stanford and Sequoia Capital highlights fights to come over cell-free DNA testing", "description": "This morning, a publicly traded transplant diagnostics company called CareDx, along with Stanford University, sued another publicly traded genetic testing company, Natera, for patent infringement. Much appears to be at stake and it all centers on cell-free DNA testing, a type of technology that has…", "url": "https://techcrunch.com/2019/03/26/a-new-lawsuit-involving-stanford-and-sequoia-capital-highlights-fights-to-come-over-cell-free-dna-testing/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2016/03/boxing-gloves-businessman.jpg?w=600", "publishedAt": "2019-03-26T21:36:29Z", "content": "                        A new lawsuit involving Stanford and Sequoia Capital highlights fights to come over cell-free DNA testing     Connie Loizos   @Cookie  / 14 hours         This morning, a publicly traded transplant diagnostics company called CareDx , along with Stanford University, sued another publicly traded genetic testing company, Natera , for patent infringement.  Much appears to be at stake, and it all centers on cell-free DNA testing, a type of technology that has already been at the crux of numerous lawsuits and looks poised to play center stage again in future corporate battles.  Loosely defined, cell-free DNA (or cfDNA) technology involves blood tests that enable physicians to understand what’s happening in someone’s body. They’re not looking at red or white blood cells (thus the “cell free” part) but at plasma, which carries pieces of broken-up DNA, among other things.  Companies like newly public Guardant Health are using it to try to ensure that cancer patients receive the right drugs. Prenatal cfDNA screening has meanwhile become a common way to screen for specific chromosomal problems in a developing baby — including Down syndrome, trisomy 13 and trisomy 18. The latter has become particularly popular as an alternative to amniocentesis, a more intrusive, and sometimes high-risk, procedure in which a small amount of amniotic fluid is sampled from the amniotic sac surrounding a developing fetus.  Yet another way that cfDNA testing can monitor clinical conditions and make a major impact on healthcare is by distinguishing the relative proportion of DNA molecules in a patient’s blood after that person has had an organ transplant. Though traditionally, recipients have had to undergo biopsies to gauge whether or not their new organ was being accepted or rejected, it’s now possible to measure through the far-less traumatic process of providing blood samples. (Broadly speaking, if, over time, the amount of donor DNA increases in the patient’s blood, things aren’t going well.)  It’s an important, if relatively new, development, and CareDx, a 19-year-old, Brisbane, Calif.-based company that went public in 2014, claims in its newly filed lawsuit that two patents it controls give it the exclusive right to non-invasively diagnose graft rejection in a great many organ transplant patients via cfDNA testing. What we mean: one of the patents covers “kidney transplant, a heart transplant, a liver transplant, a pancreas transplant, a lung transplant, a skin transplant, and any combination thereof.” The second patent covers 16 different methods, devices, compositions and kits for diagnosing or predicting transplant status or patient outcome.  The patents were awarded in recent years to Stanford academics, including Stephen Quake, a renowned professor of bioengineering and applied physics. Though Stanford owns the patents, however, it licenses them to CareDx, and they’ve dramatically enhanced the company’s prospects. Indeed, while its shares were priced at $10 apiece at the time of its IPO, they’ve been trading at $40 each more recently, thanks largely to its AlloSure test, which is designed specifically for kidney transplant patients and, critically, is now covered by Medicare.  Indeed, CareDx’s lawsuit against 15-year-old Natera, which went public in 2015, accuses it of “preparing to develop and commercialize” a too-similar kidney transplant rejection test beginning in the middle of last year. It’s seeking cash compensation and a court order that blocks the sale of Natera’s offering.  It’s an offensive move, too, seemingly, given all those other organs at stake and the markets they could unlock.  Natera, which counts Sequoia Capital’s Roelof Botha as a board member, did not provide an executive to comment on the suit. Botha also declined through a Sequoia spokesperson to comment. But Natera told us in a statement that it’s “confident that we will prevail in this suit should it proceed and do not expect this suit to impact our commercialization plans or disrupt our operations in any way.” Added the company, “We are not surprised that CareDx would attempt to disrupt the imminent commercialization of Natera’s innovative organ transplant rejection test, which does not require donor genotyping, and will compete with CareDx’s older test. In recently published studies, Natera demonstrated superior analytical and clinical test performance.”  What happens next remains to be seen, but it’s not the first imbroglio in which Natera finds itself.  A year ago, the gene-testing company Illumina filed a lawsuit against Natera, alleging that the company’s non-invasive prenatal testing infringes a patent that Illumina controls and that relies on analysis of cell-free DNA present in maternal blood. That case is still moving toward a trial . In the meantime, Illumina last year separately won a $26.7 million jury verdict in a lawsuit accusing a subsidiary of Roche Holdings of using patented prenatal testing technology without authorization.  Last year, Natera also agreed to pay $11.4 million to settle a lawsuit with the U.S. government, after it alleged that Natera submitted false claims to several government health programs based on tips by two former Natera employees who filed an earlier whistleblower lawsuit against the company.  Natera — whose founding CEO, Matthew Rabinowitz, stepped down from his position in January of this year, replaced by longtime Natera employee and COO Steve Chapman — denied the allegations and, as part of the settlement terms, did not admit any wrongdoing.  Either way, Natera, CareDx and Illumina aren’t the only ones duking it out over cell-free DNA testing.  In 2017, for example, Guardant filed a lawsuit against rival Foundation Medicine, alleging that Foundation’s advertising for its own liquid and tissue tests harmed both Guardant and cancer patients by misleading oncologists about the relative accuracy and sensitivity of the competing genomic tests. Foundation later sued Guardant , alleging infringement of a patent that covers methods for analyzing a cancer patient’s tissue or blood sample to detect multiple classes of genomic alterations.  The two companies later settled both without disclosing the terms of their agreement, but Guardant has more recently sued Foundation again . It is also embroiled in an ongoing lawsuit against another rival called Personal Genome Diagnostics over its cell-free DNA technology.                        ", "category": "technology"}