{"author": "Eric Berger", "title": "Vice President directs NASA to return to the Moon by 2024", "description": "\"If our current contractors can't meet this objective, then we'll find ones that will.\"", "url": "https://arstechnica.com/science/2019/03/vice-president-directs-nasa-to-return-to-the-moon-by-2024/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/pence1-760x380.jpg", "publishedAt": "2019-03-26T20:21:01+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Get fast, y'all    —  Vice President directs NASA to return to the Moon by 2024  \"If our current contractors can't meet this objective, then we'll find ones that will.\"    Eric Berger - Mar 26, 2019 8:21 pm UTC         Enlarge  / Vice President Mike Pence speaks at the US Space & Rocket Center in Huntsville, Ala. NASA     reader comments  187  with 110 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      On Tuesday, at a museum within a stone's throw of Marshall Space Flight Center in Alabama, Vice President Mike Pence delivered a significant space policy speech that called for American men and women to return to the Moon by 2024. If the Trump administration follows through on the policies Pence outlined—admittedly a huge if —this was arguably the most consequential space speech since President Kennedy's Moon speech in 1962.  However, Pence's comments, and some of the plan later outlined by NASA administrator Jim Bridenstine, raised significant questions about the viability of these ideas.  Further Reading Vice President may tell NASA to accelerate lunar landings  During a 30-minute speech that Ars previewed last week, Pence said NASA has moved too slow for too long. Half a century ago, the agency only took eight years to go to the Moon, Pence said, when NASA didn't know how to do the job. Therefore, he was not satisfied with NASA's stated aim of landing humans on the Moon by 2028, which would come 11 years after President Trump first established the goal of returning humans to the lunar surface.  \"Ladies and gentlemen, that's just not good enough,\" Pence told the National Space Council during its meeting at the US Space & Rocket Center in Huntsville, Alabama. \"We're better than that.\"  A bold speech  In setting a goal of 2024 for landing humans on the Moon—at the lunar South Pole, no less—Pence said NASA must proceed with \"urgency\" if it is to achieve these aims. \"It's up to this generation to meet the challenge of our time,\" he said.  Critically, Pence also noted that NASA's oft-delayed Space Launch System rocket has been problematic from a budget and schedule standpoint. In calling for a \"major course correction\" at NASA, Pence said the agency must be willing to consider commercial alternatives for rockets and lunar landers if they can do the job and save the government money.  \"I call on NASA to adopt new policies and embrace a new mindset,\" Pence said. \"If our current contractors can't meet this objective, then we'll find ones that will.\" This was likely a reference, at least in part, to lower-cost rockets built by SpaceX and Blue Origin.  Further Reading How I learned to stop worrying and love the big $60B NASA rocket  This was a bold speech ( see full text ). In his remarks, the vice president plainly stated what has been an open—but rarely talked about—secret in space policy circles. Large contractors on the Space Launch System, Orion, and other programs have under-delivered for the billions of dollars they have received. The agency has basically been in \"development mode\" for deep-space exploration for 15 years with no actual exploration to show for it, and it's on course to remain so for a while.  After Pence's speech, NASA Administrator Jim Bridenstine was invited to speak for a few minutes about how NASA might achieve this goal. \"You have given us a charge today, and it is right on time,\" Bridenstine said. \"Thank you for that vision and that leadership. Our agency, NASA, is going to do everything in its power to meet that deadline.\"  To accomplish this, however, Bridenstine doubled down on the Space Launch System rocket. \"If we want to achieve 2024, we have to have SLS,\" Bridenstine said. The rocket will be delayed no more, he said. In fact, although internally NASA engineers say the booster cannot be ready before 2021, its launch date will be brought forward.  Further Reading Here’s why NASA’s administrator made such a bold move Wednesday  On Tuesday, Bridenstine said Exploration Mission-1, which involves flying an uncrewed version of Orion around the Moon, will proceed on the SLS booster in 2020. This announcement came less than two weeks after his suggestion that maybe NASA should launch the first lunar flight of Orion on commercial rockets due to ongoing SLS delays.  In another surprising turnaround, Bridenstine also said the agency must now accelerate work on an advanced upper stage for the SLS rocket, known as the Exploration Upper Stage. This will be needed for the third or fourth flight of the SLS rocket (presumably part of the build-up for lunar missions). But Bridenstine did not say why. By contrast, the president's budget request released earlier this month called for deferring funding on this upper stage until such time as it was needed. Regardless, it is difficult seeing this upper stage, essentially a new rocket, being ready by 2024.  NASA will also simultaneously pursue the development of a Lunar Gateway (a small outpost near the Moon) to serve as a staging point in orbit for missions to the surface. And NASA will start (and complete) development of lunar landers, likely through commercial providers. That is a lot to put on NASA's plate, certainly too much if we go by past performance at the agency.  In summary  All of this is therefore ambitious, because Pence's vision seeks to shock NASA and its legacy contractors out of their business-as-usual posture.  What happens next is not entirely clear. Little was mentioned of budget. Unless NASA entirely scraps the SLS program and its $3 billion annual budget, the agency will have no funds for instituting a lunar landing program. But as an SLS demise seems unlikely to happen (at least for now), NASA's exploration program will require a multibillion-dollar infusion in order to be viable. Later at the meeting, Pence gestured toward James Herz, an associate director at the White House Office of Management and Budget. \"Well, we'll be coming to OMB,\" Pence said.  Further Reading New White House budget spells trouble for NASA’s SLS rocket  It is also not clear how moved Congress will be by this initiative. Clearly, Bridenstine's remarks Tuesday about launching Orion on SLS reflect pushback from Alabama Sen. Richard Shelby, who supports the development of the big rocket in his state at the Marshall Space Flight Center. The senator with power over NASA's budget has evidently said no to a commercially launched Orion and yes to funding for the Exploration Upper Stage.  In short, while Pence promised a revolutionary approach to spaceflight during his speech Tuesday, Bridenstine's proposed architecture—which includes the SLS rocket, Gateway, and Exploration Upper Stage—feels very much like business as usual.                reader comments  187  with 110 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Eric Berger Eric Berger is the senior space editor at Ars Technica, covering everything from astronomy to private space to NASA. A certified meteorologist, Eric lives in Houston.   Email  eric.berger@arstechnica.com  //  Twitter  @SciGuySpace              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}