{"author": "Rani Molla", "title": "Airbnb just beat Hilton in US consumer spending", "description": "US consumers spent more money on Airbnb last year than than they did on Hilton and its subsidiary brands like DoubleTree and Embassy Suites, according to new data from Second Measure, a company that analyzes billions of dollars in anonymized debit and credit card purchases. Their Airbnb spending is even catching up to Marriott, the world’s largest hotel company, which acquired Starwood hotels in 2016.", "url": "https://www.recode.net/2019/3/25/18276296/airbnb-hotels-hilton-marriott-us-spending", "urlToImage": "https://cdn.vox-cdn.com/thumbor/t31rfcXeBL9flVweat1qLCwkcl8=/0x0:1600x1000/fit-in/1200x630/filters:fill(ffffff)/cdn.vox-cdn.com/uploads/chorus_asset/file/15984803/export_ZIJ3U.png", "publishedAt": "2019-03-25T12:17:54Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Charts      Airbnb       American consumers spent more on Airbnb than on Hilton last year   That means Airbnb now owns about 20 percent of the entire US consumer lodging market.  By  Rani Molla @ranimolla    Mar 25, 2019,  8:17am EDT        Share     Tweet        Share     Share  American consumers spent more on Airbnb than on Hilton last year      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Much of Airbnb’s growth is coming from travelers who live in the central US.  Phillip Faraone/Getty Images for Wired25     Airbnb has long felt like an existential threat to hotel companies. New data shows that it actually is one.  US consumers spent more money on Airbnb last year than they did on Hilton and its subsidiary brands like DoubleTree and Embassy Suites, according to new data from Second Measure , a company that analyzes billions of dollars in anonymized debit and credit card purchases. Their Airbnb spending is even catching up to Marriott, the world’s largest hotel company , which added to its revenue by acquiring Starwood hotels in 2016.  The data shows roughly 30 percent growth last year in US consumer spending on Airbnb, which is expected to go public next year and is currently valued at about $38 billion .  Much of that growth, according to Second Measure, is coming from travelers who live in the central US. Currently, about a third of Airbnb’s US customers are from populous coastal states like California, New York, and Florida. That’s a departure from 2012, when people from those states made up half its customers.       This growth comes as Airbnb, which has traditionally been a way for people to rent space in their homes, branches out more directly into the hotel space. Last year, the company expanded its bookings to include boutique hotels . Earlier this month, Airbnb acquired the last-minute hotel booking site HotelTonight , bringing it even deeper into the mainstream hotel market.  Indeed, hotels, which have long lobbied against Airbnb, are increasingly competing for the same customers. Twelve percent of major hotel* customers also booked with Airbnb last year, up from 1 percent in 2013, according to Second Measure.  Out of all US consumer lodging spending last year, Airbnb made up nearly 20 percent, according to Second Measure data. HomeAway, its home-sharing competitor owned by the travel booking site Expedia, brought in 11 percent.**  That’s impressive considering the US hotel industry brings in more than $200 billion in revenue a year. Note that Airbnb only considers its revenue to be the fees it gets from renters and travelers, not the gross bookings — what consumers spend — that would be included in the Second Measure data. It’s a different revenue model from hotels, which take in all the gross bookings but also have much higher expenses like building and running the hotels.     Airbnb’s revenue in this data would include the total amount consumers spend on its lodgings and its “ experiences ,” while the hotel data would include room prices as well as food, beverages, and incidentals. Basically, everything that would show up on the consumer’s credit card bill under Airbnb or these hotels (and their subsidiary brands) would be included.  Second Measure’s data is for personal US credit cards, so people traveling from abroad or using corporate accounts wouldn’t be included. Hotels tend to be more popular among business travelers — and business travelers tend to be more lucrative than leisure ones — so including them would definitely move the data in hotels’ favor.  Airbnb, however, has been trying to eat into that business travel market as well with Airbnb for Work , its segment of highly rated lodgings that have hotel amenities and self-check-ins. Airbnb says it manages travel for 400,000 businesses, and business travelers are using the service for shorter trips — ones that might have once defaulted to hotels. The average stay with Airbnb for Work is five days, down from six days last year, according to Airbnb . The fastest-growing segment of business trips is three nights or fewer.  Analysts estimate Airbnb brought in more than $3 billion globally in 2018. Unlike a number of other startups planning to go public , it’s been profitable on an Ebitda basis for two years.  * Includes InterContinental Hotels Group, Hilton Worldwide, Marriott International, Starwood, Choice Hotels, Wyndham Hotel Group, La Quinta, Hyatt, and all of their subsidiary brands. ** HomeAway revenue includes VRBO and vacationrentals.com.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    Full Q&A: Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Recode Decode               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.              Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.              Apple’s plan for its new TV service: Sell other people’s TV services  Apple’s TV plans, explained. (Spoiler: Apple isn’t taking on Netflix yet.)              Canada is becoming a tech hub. Thanks, Donald Trump!  US companies are moving tech jobs to Canada rather than deal with Trump’s immigration policies.                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 20. The sidebar size is long.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}