{"author": "Kirsten Korosec", "title": "Linear Labs' next-gen electric motor attracts $4.5 million in funding", "description": "Linear Labs, a startup developing an electric motor for cars, scooters, robots, wind turbines and even HVAC systems, has raised $4.5 million in a seed round led by Science Inc. and Kindred Ventures.  Investors Chris and Crystal Sacca, Ryan Graves of Saltwater Ventures, Dynamic Signal CEO Russ Fradi…", "url": "https://techcrunch.com/2019/03/26/linear-labs-next-gen-electric-motor-attracts-4-5-million-in-funding/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/LInear-Labs-Motor.jpg?w=600", "publishedAt": "2019-03-26T18:07:44Z", "content": "                        Linear Labs’ next-gen electric motor attracts $4.5 million in funding     Kirsten Korosec  10 hours         Linear Labs, a startup developing an electric motor for cars, scooters, robots, wind turbines and even HVAC systems, has raised $4.5 million in a seed round led by Science Inc. and Kindred Ventures.  Investors Chris and Crystal Sacca, Ryan Graves of Saltwater Ventures, Dynamic Signal CEO Russ Fradin, Masergy executive chairman and former-CEO Chris MacFarland, as well as Ustream co-founder Gyula Feher also participated in the round.  The four-year-old company was founded by Brad and Fred Hunstable, who say they have invented a lighter, more flexible electric motor. The pair came up with the motor they’ve dubbed the Hunstable Electric Turbine (HET) while working to design a device that could pump clean water and provide power for small communities in underdeveloped regions of the world.  Linear Labs currently has 50 filed patents, 21 of which are issued, with 29 patents pending.  The founders come with a background in entrepreneurship and electrical engineering. Brad Hunstable is former CEO and founder of Ustream, the live-video-streaming service that sold to IBM in 2016 for $150 million. Fred Hunstable, who comes with a background in electrical engineering and nuclear power, led Ebasco and Walker Engineering’s efforts in designing, upgrading and completing electrical infrastructure, environmental and enterprise projects as well as safety and commercial-grade evaluation programs.  The HET uses multiple rotors that can adapt to varying conditions, according to the company. It also produces twice as much torque density and three times the power density than permanent magnet motors. Linear Labs says its motor produces two times the output per given motor size, and minimum 10 percent more range.  The HET design makes it ideally suited for mobility applications such as electric vehicles because it produces high levels of torque without the need for a gearbox. This helps cut production cuts, the company contends.  “The holy grail in electric motors has always been high torque and no gearbox, and the HET achieves both in a smaller, lighter and more efficient package that is more powerful than traditional motors,” Linear Labs CTO Fred Hunstable said in a statement.  The upshot could be electric vehicles with better range and more powerful electric scooters.  The commercialization of the electric motor will result in substantial leaps in terms of energy savings, reliability enhancement, and low-cost manufacturing, according to Babak Fahimi, founding director of the Renewable Energy and Vehicular Technology (REVT) Laboratory at the University of Texas at Dallas.  The company plans to use the seed funding to market its invention to customers. It’s also hiring talent and recently added new people to its leadership team, including John Curry as their president and Jon Hurry as vice president. Curry comes from KLA-Tencor and NanoPhotonics. Hurry has held positions at Tesla and Faraday Future.                        ", "category": "technology"}