{"author": "Sunil Rajaraman", "title": "'This is Your Life in Silicon Valley': Oakland Mayor Libby Schaaf discusses Prop C, Uber, Bay Area Sports and more", "description": "Welcome to this week’s transcribed edition of This is Your Life in Silicon Valley. We’re running an experiment for Extra Crunch members that puts This is Your Life in Silicon Valley in words – so you can read from wherever you are. This is your Life in Silicon Valley was originally started by…", "url": "https://techcrunch.com/2019/03/26/this-is-your-life-in-silicon-valley-transcribed-prop-c-uber-bay-area-sports-and-more/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/GettyImages-930727686.jpg?w=600", "publishedAt": "2019-03-26T18:38:37Z", "content": "                  ‘This is Your Life in Silicon Valley’: Oakland Mayor Libby Schaaf discusses Prop C, Uber, Bay Area Sports and more     Sunil Rajaraman  15 hours         Welcome to this week’s transcribed edition of This is Your Life in Silicon Valley. We’re running an experiment for Extra Crunch members that puts This is Your Life in Silicon Valley in words – so you can read from wherever you are.  This is your Life in Silicon Valley was originally started by Sunil Rajaraman and Jascha Kaykas-Wolff in 2018. Rajaraman is a serial entrepreneur and writer (Co-Founded Scripted.com, and is currently an EIR at Foundation Capital), Kaykas-Wolff is the current CMO at Mozilla and ran marketing at BitTorrent. Rajaraman and Kaykas-Wolff started the podcast after a series of blog posts that Sunil wrote for The Bold Italic went viral . The goal of the podcast is to cover issues at the intersection of technology and culture – sharing a different perspective of life in the Bay Area. Their guests include entrepreneurs like Sam Lessin, journalists like Kara Swisher and Mike Isaac, politicians like Mayor Libby Schaaf and local business owners like David White of Flour + Water.  This week’s edition of This is Your Life in Silicon Valley features Libby Schaaf, the Mayor of Oakland. Lots of ground is covered during this interview, including Uber’s proposed move to Oakland years back and some insight as to why it fell through. We discuss the Prop C battle from the election, as well as the future of Oakland sports.  If you enjoy hearing about the future of the Bay Area and one of its major cities then this episode is for you.   For access to the full transcription, become a member of Extra Crunch. Learn more and try it for free.   Sunil Rajaraman:  Welcome to season three of This is Your Life in Silicon Valley, a podcast about the Bay Area, technology, and culture. I’m your host, Sunil Rajaraman, and I’m joined by my cohost, Jascha Kaykas-Wolff.                         ", "category": "technology"}