{"author": "Megan Rose Dickey", "title": "The gender wage gap is shrinking among computer programmers, but it's still quite large", "description": "Glassdoor has released its latest gender pay gap data analysis. In the U.S., the unadjusted pay gap comes in at 21.4 percent, meaning women make just $0.79 for every $1 men earn. But, when controlling for variables like age, education, location, experience, occupation and industry, the pay gap is 4…", "url": "https://techcrunch.com/2019/03/26/the-gender-wage-gap-is-shrinking-among-computer-programmers-but-its-still-quite-large/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/05/programmergirl_preview.jpeg?w=710", "publishedAt": "2019-03-27T03:59:21Z", "content": "                        The gender wage gap is shrinking among computer programmers, but it’s still quite large     Megan Rose Dickey   @meganrosedickey  / 7 hours         Glassdoor has released its latest gender pay gap data analysis. In the U.S., the unadjusted pay gap comes in at 21.4 percent, meaning women make just $0.79 for every $1 men earn.  But, when controlling for variables like age, education, location, experience, occupation and industry, the pay gap is 4.9 percent. That’s a slight improvement from three years ago, when Glassdoor did its first analysis. That means, women make about $0.95 cents for every $1 men make.  In the tech industry, there is an adjusted wage gap of 5.4 percent, meaning, men generally make 5.4 percent more than women. On an adjusted basis, men make 11.8 percent more money than women.  In technical roles, while the wage gap is shrinking, it’s still quite large. Across the U.S., 79 percent of all computer programmers are male, according to the U.S. Bureau of Labor Statistics .  The wage gap between men and women is 11.3 percent, which comes out to about $0.88 for every $1 men make. In the tech industry, referred to as information technology, the wage gap is 5.4 percent (about $0.95 for every $1).   The wage gap among computer programmers represents the largest pay gap shrink (among the 15 job occupations with the highest wage gaps) since 2016, where the wage gap was 28.3 percent and women made about $0.72 for every $1 men made.  Other jobs with high pay gaps include pilot (number 1), professor, branch manager, C-suite and chef. Perhaps the tech industry is getting slightly better with equal pay, but it’s rather disconcerting that the computer programmer role is still among the top 15 jobs with the largest pay gaps.  “Knowing the facts about the gender pay gap is critical to helping close the gap,” Glassdoor senior vice president and head of product and UX/design Annie Pearl said in a statement. “Combining knowledge with leveraging valuable resources is the next step to ensuring equal pay for equal work everywhere… We all have a part to play to close the pay gap.”  The industries with the widest wage gap (6.4 percent) are retail and media. That means women make $0.93 for every $1 men earn. With that, I’m signing off.   Google found it paid men less than women for the same job                         ", "category": "technology"}