{"author": "Nick Statt", "title": "The Apple Card is a perfect example of Apple’s post-iPhone strategy", "description": "With the Apple Card credit card, Apple has decided that it needs a traditional product to promote Apple Pay. Just as Apple sees competing with Netflix and large cable companies as part of its future by creating its own TV shows and paying top dollar for Hollywood talent, the company no longer sees upending the status quo as a viable path forward.", "url": "https://www.theverge.com/2019/3/26/18282946/apple-card-credit-post-iphone-strategy-services-business-digital-wallet-payments", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9bvyBvVeuce82kPx5LwLF1c7UZ8=/0x47:2416x1312/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15988557/Screen_Shot_2019_03_26_at_1.46.09_PM.png", "publishedAt": "2019-03-26T21:49:12Z", "content": "                                                                           Log In or Sign Up     Log In    Sign Up              Tech     Reviews     Science     Entertainment     Video    Features    Podcasts    Newsletters    Store    More                   Tech      Video    Amazon    Apple    Facebook    Google      Microsoft    Samsung    Tesla    AI    Cars      Cybersecurity    Mobile    Policy    Privacy    Scooters     All Tech      Reviews      Phones    Laptops    Headphones    Cameras      Tablets    Smartwatches    Speakers    Drones      Accessories    This is my Next    How-to    Good Deals     More from Verge Guidebook      Science      Video    Space    NASA    SpaceX      Health    Energy    Environment     All Science      Entertainment      Film    TV    YouTube      Games    Fortnite    Books      Comics    Music     All Entertainment      Video    Features    Podcasts    Newsletters    Store   ✕                  Apple      Apps      Mobile       The Apple Card is a perfect example of Apple’s post-iPhone strategy     New,   56  comments      Apple is building its ecosystem not by reinventing the wheel, but by sprucing up traditional, boring products  By  Nick Statt @nickstatt    Mar 26, 2019,  5:49pm EDT        Share     Tweet        Share     Share  The Apple Card is a perfect example of Apple’s post-iPhone strategy      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Image: Apple     Among the most tangible announcements at Apple’s services event yesterday was also its most interesting: a credit card, aptly called the Apple Card, with both a physical and digital version that gives you up to 3 percent cash back. The product is, on the surface, a way for Apple to sell its brand on another everyday object you likely already own. But beneath the veneer of a titanium credit card with the Apple logo on it, the company is clearly charting out its post-iPhone future, one in which services reign supreme , by following a formula we’ve never quite seen it attempt before.  In this case, Apple has decided that it needs a traditional product, even one with the dubious moral baggage of a credit card, to promote Apple Pay. While the digital wallet and payment platform is growing fast, it’s still used by less than half of all global iPhone owners (and even less in the US). So just as Apple sees competing with Netflix and large cable companies as part of its future by creating its own TV shows and paying top dollar for Hollywood talent, the company no longer sees upending the status quo in payments as a viable path forward for Apple Pay.  “I think the strange optic here is that credit cards are not necessarily innovation in payments, even with better rates and loyalty,” says Rivka Gewirtz Little, a global research director at analyst firm IDC who specializes in payments. “So, to see a big tech firm, which hangs its hat on innovation, go such a traditional route – that’s what I think is a bit odd here. I’d like to see Apple get more innovative in transforming the way we pay.”  “The strange optic here is that credit cards are not necessarily innovation in payments.”  For years, as the iPhone has become ubiquitous and sales have started to slow, Apple has tried to emulate the paradigm-shifting success of the App Store and iTunes before it by barreling its way into TV and film, mobile payments, and news. But time and again over the last half-decade or so, Apple has run into the hard economic and logistic reality of trying to change industries that are far less malleable than mobile software and music.  And while Apple Pay may be a bold vision of the future, it’ll likely be years before contactless digital payments become truly mainstream in the US. In the meantime, Apple wants to sell you the benign and the boring — a credit card, a cable package, a magazine subscription — in hopes it can make its software and services as intrinsic a part of everyday life as its smartphone. Changing industries from the ground up is no longer Apple’s playbook, especially as it plays catch-up to companies like Netflix and Spotify.  Apple’s strategy mirrors that of Amazon. The e-commerce giant started out selling genuinely new and best-in-class products like the Kindle and then the AI-powered Echo speaker. But Amazon has since used the consumer goodwill it garnered and the power it wields over its digital storefront  to sell you everything from microwaves and wall clocks to white label clothing brands, home supplies, and AmazonBasics-branded AA batteries.            Image: Apple    Apple is doing the same, using the iPhone as the ultimate gateway to transform every iOS and Mac user into a series of multiple recurring revenue streams from products made first and in some cases made better by other companies, be it Apple Music, Apple News, iCloud, or the new TV app. Apple is stopping short of making its own version of Prime, in which all of these services could be bundled together, but the company appears to be taking its cues from Amazon’s subscription approach to further lock iPhone owners into a broader ecosystem.  With the Apple Card, the company is going one step further and trying to capture not just what you consume, but also the financial means you use to do so. Apple isn’t reinventing the wheel — the card, as reported by CNET , doesn’t have contactless capabilities like newer cards from competing banks, so you’ll need to slide it or input the chip into a reader to use it every time. Instead, Apple is giving users a no-frills credit card that’s a cleverly disguised way to juice Apple Pay adoption and usage.  The Apple Card is a way for Apple to become the way you pay for everything  Unlike the subscription services it plans to sell, the Apple Card comes with no annual fee, no late lees, and an interest rate supposedly lower than the industry average. On top of that, it has a pretty straightforward rewards program that incentivizes consumers to use Apple Pay to buy Apple products, for the most cash back at 3 percent thanks likely to the fact that Apple no longer has to hand over as high a processing fee as it does with a third-party card. If you have to use the physical Mastercard-branded card, you’ll get 1 percent back. (Granted, when it launches, the Apple Card will be one of the only cards on the market without a sign-up bonus, the primary incentivizing mechanism banks use to get people to open new lines of credit.)  To get customers to actually sign up, Apple is leaning heavily on its privacy-first approach. Effectively, Apple wants to be the only tech company you actually trust . Onstage yesterday, CEO Tim Cook said the card will not collect data on your transactions, and Apple will not let its partner bank, Goldman Sachs, sell any data to third parties. But of course that begs the question: how does it make money, and without those usual stipulations, is Apple not simply banking on users falling into debt and pocketing the insurance money they’re forced to pay for years to come?  The goal may not be to turn a profit, at least not on the service itself. It all comes back to Apple Pay. The reason Apple made a credit card in the first place is to spur adoption of Apple Pay, and to create a digital wallet that can be used not just in the real world, but also inside an iOS ecosystem that is increasingly being peppered with new, for-pay services.            Image: Apple    “Mobile wallets are still a small section of the market, so it’s understandable there needs to be a big push if your aim is more adoption,” says Rasha Katabi, CEO and co-founder of credit card and digital payments startup Brim Financial. “As the adoption of e-commerce increases, and we’ve seen that at an exponential rate over the past few years, the relevance of having a physical card or lack thereof will track really closely to the adoption and migration from physical shopping to fully online shopping.”  The only online shopping Apple truly cares about happens within its ecosystem: in-app subscriptions for its new services, microtransactions in mobile games like Fortnite , Venmo-style peer-to-peer payments with Apple Cash, and purchasing of Apple hardware from within the Apple Store mobile app. All of this qualifies for the 3 percent cash back bonus, Apple confirmed to The Verge . And that arrangement sheds an interesting light on the entire Apple Card approach.  The success of the Apple Card may hinge on whether it gets used for all in-app purchases  Through its incentives, Apple is creating a system where you’ll shop in the real world at Apple Pay partners for an extra cash back bonus, switch your App Store credit card to an Apple one with an even better bonus, and rely only on the physical card for when you absolutely have to. And all of it is underpinned by Apple’s privacy pledge and relatively solid security track record, as well as the luxury status symbol provided by an Apple-branded piece of titanium , with its number-less design that non-coincidentally makes it easy to gloat about on social media.    Apple pushing people to keep cash inside the Apple ecosystem is not to be underestimated! They are playing a long game here. If successful, this is very bad for the card networks. — Peter Berg (@peter) March 26, 2019     That may be enticing enough to get younger users, especially those without large stockpiles of reward points and years of credit built with existing banks and cards, to turn to Apple as their primary credit provider. Credit cards, especially those underwritten by Goldman Sachs and backed by dinosaurs like Mastercard, are not the most innovative products. Neither are TV bundles or magazine subscriptions.  But Apple’s services strategy, similar to its hardware strategy in the Tim Cook era, is not about being first, but about providing an Apple-centric option that’s good enough to keep you hooked in and uninterested in ever leaving.  Shannon Liao contributed to this report.       In this Storystream  Apple TV Plus: the latest developments from the keynote    The Apple Card is a perfect example of Apple’s post-iPhone strategy    Apple Arcade has game developers excited, but questions remain    View all 44 stories     Next Up In Tech                         Most Read                  Apple announces Apple Card credit card  Coming summer 2019              Europe’s controversial overhaul of online copyright receives final approval  The much-criticized ‘upload filter’ and ‘link tax’ will soon become law in EU nations              The Apple Card is Apple’s thinnest and lightest status symbol ever  There was one hardware announcement at Apple’s services event                 Huawei’s P30 Pro is a photographic powerhouse with a tiny notch  Huge battery, absentee bezels, and a promising new quad-camera system              All the things Apple didn’t tell us about its streaming TV service  Apple TV Plus is more mysterious than familiar                        Command Line Command Line delivers daily updates from the near-future.    email address...    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 34. The sidebar size is long.         Loading comments...            Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved          tweet     share    ", "category": "technology"}