{"author": "Peter Kafka", "title": "What’s in Apple’s video service, how much will it cost, and why should we pay for it?", "description": "Apple’s video launch event features celebrities, not answers", "url": "https://www.recode.net/2019/3/25/18281255/apple-tv-video-launch-subscriptions-strategy-oprah-winfrey-tim-cook-reese-witherspoon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pMIhOU8e4LkLyPXik7_cmUouwJ4=/0x0:4095x2144/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15986023/1132800808.jpg.jpg", "publishedAt": "2019-03-25T20:26:31Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Apple      Media      TV       We still don’t know what’s in Apple’s streaming service, how much it will cost, or why we should pay for it   Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka    Mar 25, 2019,  4:26pm EDT        Share     Tweet        Share     Share  We still don’t know what’s in Apple’s streaming service, how much it will cost, or why we should pay for it      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Tim Cook and Oprah Winfrey.  Michael Short/Getty Images     I have some questions about Apple’s new video service:   What, exactly, is Apple going to have in its new video service?  What, if anything, will Apple’s new video service cost?  Why would someone pay anything for Apple’s new video service?   I’ve had these questions for a couple of years, but I figured I would have answers to them today because I just spent two hours watching Tim Cook and other Apple executives show off a new suite of Apple services, with Apple’s video offering as the showstopper.  Nope! Still haven’t found what I’m looking for .  In lieu of answers, Cook and his team did a high-gloss version of hand-waving at their Cupertino, California, HQ today: They brought out Very Big Stars like Steven Spielberg, Reese Witherspoon, and Oprah Winfrey to tell a worldwide audience that they were indeed working on projects that you might be able to see as soon as this fall. Musician Sara Bareilles played a song on an onstage piano.  Apple did promise that the subscription service would be ad-free and that it would be available in more than 100 countries. And it played the briefest of sizzle reels, which allowed the audience to see that Apple’s production team has indeed shot footage for some of its shows.  But that was it, and that was surprising.  One thing Apple has been very good about is showing off a new piece of hardware or software, telling you why you’d like to use it, and telling you when you can get it. It usually tells you how much it costs, too.  In the absence of any of that information, we have to do some guesswork: Maybe Apple wanted to show off its talent and a vague sense of its plans, because the event isn’t really aimed at consumers who will end up paying for (or at least using) the service. Maybe it was aimed at Wall Street, to convince investors that Apple is really, really serious about using service revenue to augment its slowing hardware sales.  If so, fine. But why not wait until next fall, when Apple’s finally ready to roll out its video offering? That might also be a good time to have talked up Apple’s new gaming subscription service, Apple Arcade, which also had a TBD for pricing and for launch date.  In terms of things Apple is doing right now — or at least very soon — Apple did have some news: Its Apple News+ “Netflix for magazines” service, which also features the Los Angeles Times and the Wall Street Journal (as well content from Vox.com , which like Recode is owned by Vox Media) is now available for $10 a month.  And Apple’s overhauled TV app, which is meant to serve as a TV guide and a storefront for subscription services like HBO, Showtime, and Starz, is coming very soon. While Apple didn’t spell it out this way, it hopes this is the thing that will be the core of its video strategy , which also involves distributing its services on hardware owned by competitors like Samsung, Roku, and Amazon, which is a very big shift .  Oh, and there’s a new Apple credit card, which is both virtual and made out of titanium. ( Really .)  Back to the video and the lack of it. Perhaps Apple could have used today to really play up one of its shows, or a handful of them. That’s what the TV guys do at their annual “upfront” presentations, when they try to convince marketers to buy time in upcoming programming based on clips of the stuff that will be out in a few months.  Instead, Apple chose to have giant stars like Spielberg and Winfrey telling us about the shows they were making, not showing us, which violates a basic communications rule. If we didn’t know better, we might think these things aren’t really ready.  And when they are ready, how much is Apple going to charge us to see them? This will be a non-issue if Apple gives them away as inducements to use its main video app, as many industry sources have expected.  But Apple went out of its way to describe what it’s working on as a “subscription service,” which certainly implies a charge. And over the weekend, the Wall Street Journal reported that “people working on the [video] projects said the company plans to charge a fee” for them.  One way to square all of this is to theoretically charge a fee, but bundle the video service with other offerings, which drops the real cost of the service to something very minimal, or less.  That remains the most logical move, since even when Apple does launch its new shows, it is only going to have a handful of new titles to roll out each month. Everyone else charging consumers for video subscriptions — or that plans to — is offering a combination of new things plus an extensive catalog of older shows and movies. HBO, for instance, may sell you on Game of Thrones , but it knows you’ll spend most of your time on the service watching movies like Fast and Furious sequels.  Who knows? Maybe Apple has a genuine surprise up its sleeve and will augment Winfrey, Witherspoon, and Spielberg with a lot of other stuff so you have something to watch when you’re done with the new things.  It’s also possible that this curiously flat show won’t matter at all next fall when the shows are up and running and Apple leverages a huge marketing push — plus its huge installed base of devices — to get people to pony up. But it would be easier to believe that if Apple had more to tell us today.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year    Full Q&A: Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Recode Decode               Most Read               American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.              Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.              Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.              Apple’s plan for its new TV service: Sell other people’s TV services  Apple’s TV plans, explained. (Spoiler: Apple isn’t taking on Netflix yet.)              Canada is becoming a tech hub. Thanks, Donald Trump!  US companies are moving tech jobs to Canada rather than deal with Trump’s immigration policies.                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 23. The sidebar size is long.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 Recode Daily: Inside Apple’s push toward the services side of its business  Plus, Uber acquires a Dubai rival, Los Angeles seeks scooter company data, and Boeing updates its 737 Max-8.  By  Shirin Ghaffary                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}