{"author": "Sarah Perez", "title": "Mozilla's free password manager, Firefox Lockbox, launches on Android", "description": "Mozilla’s free password manager designed for users of the Firefox web browser is today officially arriving on Android. The standalone app, called Firefox Lockbox, offers a simple if a bit basic way for users to access their logins already stored in their Firefox browser from their mobile devi…", "url": "https://techcrunch.com/2019/03/26/mozillas-free-password-manager-firefox-lockbox-launches-on-android/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-26-at-2.24.19-PM.png?w=598", "publishedAt": "2019-03-26T18:34:43Z", "content": "                        Mozilla’s free password manager, Firefox Lockbox, launches on Android     Sarah Perez   @sarahintampa  / 9 hours         Mozilla’s free password manager designed for users of the Firefox web browser is today officially arriving on Android . The standalone app, called Firefox Lockbox , offers a simple if a bit basic way for users to access their logins already stored in their Firefox browser from their mobile device.  The app is nowhere near as developed as password managers like 1Password, Dashlane, LastPass and others as it lacks common features like the ability to add, edit or delete passwords; suggest complex passwords; or alert you to potentially compromised passwords resulting from data breaches, among other things.  However, the app is free – and if you’re already using Firefox’s browser, it’s at the very least a more secure alternative to writing down your passwords into an unprotected notepad app, for example. And you can opt to enable Lockbox as an Autofill service on Android.   But the app is really just a companion to Firefox. The passwords in Lockbox securely sync to the app from the Firefox browser – they aren’t entered by hand. For security, the app can be locked with facial recognition or a fingerprint (depending on device support). The passwords are also encrypted in a way that doesn’t allow Mozilla to read your data, it explains in a FAQ .  Firefox Lockbox is now one of several projects Mozilla developed through its now-shuttered Test Flight program. Over a few years’ time, the program had allowed the organization to trial more experimental features – some of which made their way to official products, like the recently launched file sharing app, Firefox Send .  Others in the program – including Firefox Color⁩ , ⁨Side View⁩ , ⁨Firefox Notes⁩ , ⁨Price Tracker⁩ , and ⁨Email Tabs⁩ remain available, but are no longer actively developed beyond occasional maintenance releases. Mozilla’s current focus is on its suite of “privacy-first” solutions, not its other handy utilities.   According to Mozilla, Lockbox was downloaded over 50,000 times on iOS ahead of today’s Android launch.  The Android version is a free download on Google Play.                        ", "category": "technology"}