{"author": "Dave Bailey", "title": "How to Deliver Constructive Feedback in Difficult Situations", "description": "All my biggest regrets as a founder are around not having difficult conversations sooner. I was guilty of making excuses like…", "url": "https://medium.dave-bailey.com/the-essential-guide-to-difficult-conversations-41f736e63ccf", "urlToImage": "https://cdn-images-1.medium.com/max/1200/1*uyXZAD1t8pYDhgj-dJ_5ew.jpeg", "publishedAt": "2019-03-26T08:53:24Z", "content": "Homepage Homepage Sign in Get started The Founder Coach Product Marketing Fundraising Leadership CEO Coaching How to Deliver Constructive Feedback in Difficult Situations Dave Bailey Blocked Unblock Follow Following Mar 26 “We are dangerous when we are not conscious of our responsibility for how we behave, think, and feel,”― Marshall B. Rosenberg, Nonviolent Communication All my biggest regrets as a founder are around not having difficult conversations sooner. I could have helped team members improve faster, fired people with the wrong fit earlier, had so many more productive meetings. I could have created a more open company culture. I was guilty of making excuses: ‘It will sort itself out.’; ‘They’ll eventually stop doing it.’; ‘There are more important things to focus on.’ Of course, delaying these conversations always made things worse. And, sometimes, it even led to crises. The Side-Effect of Empathy Empathy means tuning in to the feelings of others. Like many founders, I’ve always had a lot of empathy for people — after all, founders focus their lives on understanding the feelings and needs of their customers. But when it comes to difficult conversations, I’ve found that empathy has a side-effect. I can get so focused on how the conversation might affect the other person’s feelings that I lose sight of why the conversation is needed in the first place. Without a healthy amount of ‘self-empathy’, we often find that our own needs, and the needs of the business, take the passenger’s seat. Nonviolent Communication Nonviolent Communication (NVC) is an awful name for one of the most powerful communication courses I’ve ever taken. NVC helps you to be honest, without criticising, insulting, or putting down other people. At the core of NVC is a straightforward communication pattern: When ____[observation], I feel ____[emotion] because I’m needing some ____[universal needs]. Would you be able to ____[request]? At first glance, this looks easy. But in practice, it’s extremely difficult to pull off. To grasp the complexity, NVC makes some subtle but critical distinctions: Observations vs. evaluations Emotions vs. thoughts Universal needs vs. strategies Requests vs. demands Understanding these nuances is key to handling difficult conversations. Let’s go through each one. 1. Observations vs. evaluations ‘The ability to observe without evaluating is the highest form of intelligence.’ — Jiddu Krishnamurti, Indian Philosopher An observation is something that you actually saw or heard in the past. You can think of it as raw information. The majority of observations fall into two categories: (i) what you heard, e.g., direct quotes, and (ii) what you saw, e.g., visible past behaviours. Our brains are hardwired to take raw information and instantly make up a simple story — good or bad, right or wrong, hero or villain. These stories are evaluations and they are very hard to separate from observations. Here are a few examples to illustrate the difference: Evaluation: ‘You are lazy.’ (a character attack) Observation: ‘You said that you’d send the document last week and I haven’t received it.’ Evaluation: ‘Your work is sloppy.’ (a criticism) Observation: ‘Three of the numbers in the report were inaccurate.’ Evaluation: ‘You’re always late.’ (a generalisation) Observation: ‘You arrived ten minutes late to the meeting this morning.’ Evaluation: You ignored me.’ (implied intent) Observation: ‘I sent you two emails and I haven’t received a response.’ An easy way to check whether you’ve made an observation or an evaluation is to ask yourself, ‘What did I actually see or hear?’ 2. Emotions vs. thoughts The usual reaction to talking about feelings is, ‘Oh God, really?’ But being aware of, and communicating, our emotions has a powerful impact on other people. When a difficult conversation is needed, people often say they feel: Scared Annoyed Anxious Confused Embarrassed Hurt Sad Tired These words are important because often, what comes after ‘I feel,’ isn’t an emotion — it’s a thought. Compare the following examples: Thought: ‘I feel that you aren’t taking this seriously.’ Emotion: ‘I feel frustrated.’ If you can substitute ‘I feel’ with ‘I think’ and the phrase still works, it’s a thought, not an emotion. And sharing our thoughts in difficult conversations can often get us into trouble, especially if the other person disagrees and wants to correct you. There are a few emotions that require extra attention and curiosity before sharing them: a) Anger: Anger often masks more painful emotions like hurt and shame. It’s important to figure out what’s underneath the anger before having a difficult conversation, because when you’re angry, you’re more likely to speak impulsively and forget NVC altogether. b) Evaluative words: Consider the phrase, ‘I feel blamed’. Doesn’t it sound a lot like the evaluation, ‘You blamed me’? To reduce the chance of a defensive response like, ‘I didn’t blame you’, NVC asks that you identify the evaluation and recognise how it impacts you emotionally. For example, feeling ‘blamed’ might leave you feeling ‘scared’. Here are some others: Evaluation: ‘I feel judged.’ Impact: ‘I feel resentful.’ Evaluation: ‘I feel misunderstood.’ Impact: ‘I feel frustrated.’ Evaluation: ‘I feel rejected.’ Impact: ‘I feel hurt.’ At this stage of the course, I began to realise how bad my emotional literacy was — I found it pretty hard to get past ‘upset’ and ‘pissed off’. 3. Universal Needs vs. Strategies NVC asserts that all human beings share the same universal needs and that behind every negative emotion lies an unmet universal needs. For example, if a certain comment in a meeting left you feeling embarrassed, you might realise that you felt embarrassed because your need for consideration wasn’t being met. The pairing of emotions with universal needs has a transformative effect in difficult conversations. Common universal needs that come up a lot in difficult conversations are: Autonomy Collaboration Consistency Clarity Integrity Recognition Respect Reassurance Security Support Understanding Not everything that follows the words, ‘I need’ is a universal need. You can say, ‘I need a sandwich,’ but that doesn’t mean sandwiches are a universal need. NVC distinguishes between our universal needs and the strategies that would meet our needs. Eating a sandwich is a strategy to meet your need for hunger. Here’s another example: Strategy: ‘I need you to copy me into every email.’ Universal need: ‘I need some transparency.’ There’s a subtle but important point to make here. As soon as you include ‘from you’ in the need statement, it stops being universal. Compare the following statements: Strategy: ‘I need support from you.’ Universal need: ‘I need support.’ Can you see how the first version could be more easily interpreted as a veiled accusation? ‘You aren’t supporting me,’ is the implication. To minimise the chance of defensiveness, NVC tells us to leave other people out of our needs. Identifying my universal needs had a powerful effect on me. Once you uncover the universal need, it’s much easier to identify new strategies that meet everyone’s universal needs. 4. Requests vs. Demands What is the difference between a request and a demand? Both are strategies that would meet an unmet need. But unlike demands, requests are invitations for the other person to meet our needs . . . but only if it isn’t in conflict with one of their needs. There are three principles that can help you make clear requests: a) Make it specific. ‘I request that you be more respectful,’ is vague — what signals respect to you may not signal respect to someone else. Spell out the concrete behaviours that would meet your need for respect: ‘I request that you arrive at meetings on time.’ b) Say what you want, not what you don’t want. ‘I request that you don’t dismiss other people’s ideas straightaway,’ explains what you don’t want, but it doesn’t spell out what you do want. Take time to clarify the behaviours you want to see. For example: ‘I request that when a team member shares an idea, you ask two or three probing questions before sharing your conclusion.’ c) Stay curious. There are many ways to satisfy your underlying needs, but is there a way of satisfying everybody’s needs? To maximise the chance of having your needs met, treat ‘no’ as an invitation to explore the needs stopping someone from saying ‘yes’. Remember, great communication isn’t just about what you say, it’s about what other people hear. Even something as simple as, ‘I’d like you to be on time for the next meeting,’ can have an unintended meaning, depending on the context. Don’t be afraid to check in and ask someone to recap what they heard. You don’t want to patronise them, so be diplomatic and politely ask, ‘Just so we know we’re on the same page, could you play back what I’m asking of you?’ The 40-Word Rule During difficult conversations, it’s important to be extremely concise. Aim to describe your observations, feelings, needs and requests in less than 40 words. Using more words suggests you’re justifying your needs, and this decreases their power. It’s also worth noting the importance of having these conversations face-to-face. NVC loses some of its power when it’s in an email. Here are some examples of the kind of feedback needed in startups. To a co-founder: ‘When you said, “I’m not happy with your work,” to me in front of the team, I felt embarrassed because it didn’t meet my need for trust and recognition. Please, could we set up a weekly one-on-one session to share feedback in private?’ To an investor: ‘I haven’t received any responses from the last three monthly updates. I’m feeling concerned because I need input. Please, would you mind getting back to me with responses to my questions in the last update?’ To a teammate: ‘You arrived 10 minutes late to the last three team meetings. I am frustrated because, as a team, we have a need for efficiency. Please, could you help me understand what’s happening?’ All this preparation for 30–40 words may sound like a lot of work. It is a lot of work. But the result is clear, concise and powerful. No naming and shaming. No waffling. Just clarity about what you’ve observed, how you feel about it, and what needs are not being met. And at the end, you have a clear, actionable request. How to React When your Request is Met with ‘No’ You’ve said your piece and made a request. In a perfect world, the other person would say, ‘Yes, of course.’ However, even the most careful feedback can be met with defensiveness and hostility. How should you respond? Just as you figured out your feelings and needs before the difficult conversation, hearing a ‘no’ is your chance to empathise with the other person. How is the other person feeling? And what unmet needs are stopping them from saying ‘yes’? This is the hardest part of all: to see past their evaluations, thoughts and strategies, and stay focused on clarifying their underlying needs. In conflict, empathy is more effective than insisting or convincing. ‘Empathy is the gift of hearing someone without taking it personally,’—Marshall Rosenberg, author of Nonviolent Communication To empathise, ask questions that aim to clarify the other person’s feelings and needs: Are you feeling hurt because you need some understanding? Are you feeling angry because you need your hard work to be recognised? Is there more you’d like to say? You don’t have to get it right — you just have to be curious. Silence is often more powerful than words, and when you uncover the needs that stop someone from saying ‘yes’, you’re much closer to finding a strategy that meets everyone’s needs. Similarly, if you’re on the receiving end of a request and have to say ‘no’, state the underlying need that stops you from saying ‘yes’. Boundaries and Consequences The outcome of a difficult conversation isn’t necessarily an agreement. We hope that we can get our needs met, but sometimes this isn’t possible. The sad truth is that no one can meet our needs all of the time. Ultimately, the responsibility of meeting our needs is our own. So we need to set boundaries and outline the consequences of crossing those boundaries. Outlining consequences is one of the most uncomfortable parts of being a manager, especially for people that want to be liked. What if the other person thinks we’re being unfair? Keep in mind that appropriate consequences are those whose purpose is to protect your needs, not to punish the other person. In other words, consequences should be protective, not punitive. Let’s say an employee continually misses their sales quotas. As a manager, you are responsible for the effectiveness of your team — and every team needs effectiveness. If deadlines continue to be missed (the boundary), you might have to switch their responsibilities or move them on (the consequence). It’s not personal, it’s just what you’ll do to protect your need for effectiveness. Compassionate Leadership The art of compassionate leadership is in being able to empathise with others while also empathising with yourself. This helps you to communicate more directly, and to better manage healthy conflict. It can even make you a better designer, marketer, and salesperson. I still feel vulnerable when exposing my emotions. It still takes time to identify what I need. And it’s still easier to identify what I don’t want than what I do want. But I’m persevering, and it’s having a massive impact on my relationships, by making difficult conversations just that little bit easier. For more information, check out Marshall Rosenberg’s book on Nonviolent Communication or this YouTube workshop . About me: I’m Dave and I coach CEOs of Series A+ tech companies. Over the last 10 years, I’ve co-founded three VC-backed tech companies, invested in dozens of early-stage startups as a VC and Angel investor, and mentored hundreds of startups as a Lead Mentor for Google. For more info, visit Dave-Bailey.com . Leadership Communication Work Psychology Management 1.9K claps 4 Blocked Unblock Follow Following Dave Bailey Medium member since Nov 2018 Founder, angel investor, writer, CEO coach. Visit Dave-Bailey.com for information. Follow The Founder Coach Practical articles and how-to guides for founders, investors and startups. 1.9K", "category": "technology"}