{"author": "Roberto Baldwin", "title": "Lamborghini’s latest Huracán is a supercar with a supercomputer", "description": "Over the past few decades, technology has made vehicles safer and easier to drive. Anti-lock brakes, traction control, torque vectoring and other bits of tech k...", "url": "https://www.engadget.com/2019/03/26/lamborghini-huracan-evo-spyder-ldvi/?utm_campaign=homepage&amp;utm_medium=internal&amp;utm_source=dl", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2019-03%252F4095ca60-4bf5-11e9-bbfd-bf3be477545c%26client%3Da1acac3e1b3290917d92%26signature%3D58ead06b62fddb013c6fe90cc0a01e815c582504&client=amp-blogside-v2&signature=95a7be277298359464785c1dec43d5908c25b3f5", "publishedAt": "2019-03-26T14:00:00Z", "content": "                                               Login                        Home        Gear        Gaming        Entertainment        Tomorrow        The Buyer's Guide        Video        Reviews                                      Log in        Sign up                                                                 Show More Results                               3 related articles                                      Login                            Disposable delivery drones pass test with US Marines             Uber's Ride Pass brings discounts to 20 more cities             Apple Pay for public transit coming to the US later this year                         Latest in Gear               Google streamlines two-step verification with security keys       1h ago  View             VP Pence wants US astronauts back on the Moon by 2024       3h ago  View             FTC will examine privacy policies at major internet providers       5h ago  View             Google forms an external council to foster 'responsible' AI       5h ago  View                Image credit:                       Save                                                Lamborghini’s latest Huracán is a supercar with a supercomputer  Calculating so you don’t careen off the road.           Roberto Baldwin , @strngwys  12h ago\n          in Transportation          Comments      304  Shares             Share              Tweet              Share              Save                                         Over the past few decades, technology has made vehicles safer and easier to drive. Anti-lock brakes, traction control, torque vectoring and other bits of tech keep cars on the road instead of flying into a ditch when things get hairy. It's why newer cars typically handle corners better than older cars.            Gallery: Lamborghini Huracan EVO Spyder | 8 Photos         8                       +4                    At Lamborghini, they've taken things further with their new Lamborghini Dinamica Veicolo Integrata or LDVI system. The Engine Control Unit (ECU) takes data from the entire car and uses it to adjust how the new Huracán EVO Spyder drives in real time (actually in less than 20 milliseconds. But that's about as close as you can get to real time). Cars have been doing some form of this for a while but the Italian automaker needs to be able to do this at incredible speeds and in environments your typical sedan or SUV doesn't encounter. With this technology, Lamborghini is able to take the raw power of an all-wheel-drive supercar with a V10 engine and 630 horsepower and tame it, just enough, so your average driver (who can shell out $287,400) can enjoy themselves behind the wheel of the all-wheel-steering vehicle without, you know, flying into a ditch. To achieve this, the LVDI is actually a super fast central processing unit that takes in data about the road surface, the car's setup, the tires and how the driver is driving the vehicle. It then uses that info to control various aspects of the Huracan. The system works in concert with the Lamborghini Piattaforma Inerziale (LPI) version 2.0 hardware sensors. This system uses gyroscopes and accelerometers located at the car's center of gravity. It measures the vehicle's movements and shares that data with the LVDI computer. Lamborghini says the system is so in tune with all aspects of a drive that it can actually predict the best driving setup for the next moment. In other words, if you're behind the wheel flying around corners on a back road, the system will recognize your behavior as you enter a corner and adjust itself. \"Where it's possible to do a bigger jump in the future is with the intelligent use of four-wheel drive and four-wheel steering and the movement and control of the torque wheel by wheel in a way that can be more predictable and that is what we have with the Huracan EVO,\" said Maurizio Reggiani, chief technology officer of Automobili Lamborghini. Lamborghini is thinking about a world beyond a completely gas-powered engine though -- it has a pipeline for hybrid and electric vehicles. But Reggiani notes that Lamborghini will probably be the last automaker to leave behind a large growling power plant. Putting all that power to the ground in a controllable way requires an incredible amount of technology -- that's where LVDI and other pieces of technology come in. The automaker believes the result is a driving experience that matches exactly what the driver wants, regardless of the mode the car is in. Whether it be Strada, Sport, or the track ready Corsa, the vehicle (in a controlled way) should deliver. That control allows a driver to do something that typically takes months if not years to master: drifting. It goes against what the car wants to do -- lose traction. But in Sport mode it's possible. To do that, the vehicle has to figure out (in real time and safely) things like what angle it wants to slide. The Huracán EVO Spyder has to understand that you want to drift and not fight that. If it does, it will jerk the car (and driver) back into alignment. To relive your Fast and Furious dreams, the automaker started where lots of companies start with new technology: In the simulator. But a computer can't faithfully reproduce the real world. Mostly that has to do with tires, a variable that's tough to predict because of the density of the rubber's compound and its wear. Then, of course, there's the driver. We all drive differently but the experience must be the same for everyone. It's important that even with all that technology, it's still a driving experience. \"We don't want to have something that substitutes the driver. We want to have a car that is able to understand what the driver wants to do,\" Reggiani said. Lamborghini is known for large engines, intense growls, striking design and bank-busting prices. But the reality is all that power would be useless if drivers couldn't actually control the car. The automaker's latest system makes that possible for everyone. Sure, only a select few can own a Lamborghini, but everyone can appreciate a system that makes driving safer while simultaneously more fun.             In this article:  business , design , gadgetry , gadgets , gear , Huracan evo spyder , lamborghini , Lamborghini Dinamica Veicolo Integrata , lamborghini Huracan EVO spyder , lvdi , supercar , transportation              By Roberto Baldwin  @strngwys    When not reporting about technology and cats, Roberto spends his time surfing, snowboarding, playing in too many bands and trying to figure out where he left his MagSafe 2 adaptor.     304  Shares             Share              Tweet              Share              Save                        Comments       Sign In                      1h                  1h ago in    Security      Google streamlines two-step verification with security keys     You'll even have your choice of Bluetooth keys.             By  J. Fingas , 1h ago               Save                                                    View              2h                  2h ago in    Transportation      Disposable delivery drones pass test with US Marines     The one-time use drones can carry more than 1,000 pounds of supplies.             By  A. Khalid , 2h ago               Save                                                    View              3h                  3h ago in    Space      VP Pence wants US astronauts back on the Moon by 2024     There's one problem: the budget might not be there for it.             By  J. Fingas , 3h ago               Save                                                    View              3h                  3h ago     Qualcomm, Apple split results of iPhone patent cases     No decision has been made yet on a proposed import ban on iPhones.             By  A. Dellinger , 3h ago               Save                                                    View              5h                  5h ago in    Politics      FTC will examine privacy policies at major internet providers     It wants to know if ISPs are respecting their customers' data.             By  J. Fingas , 5h ago               Save                                                    View       More Stories     From around the web                            About    About Engadget  About Our Ads  Advertise  Brand Kit  Buyers Guide  Contact Us  RSS Feed         Sections    Reviews  Gear  Gaming  Entertainment  Tomorrow  The Buyer's Guide  Video  Podcasts  Deals         Contribute    Comment Guidelines  Send us a tip!  Support         International    繁體中文  简体中文  日本版  UK         Apps    Android  iPhone  iPad              Join Our Newsletter        Subscribe          Follow Us                                                              © 2019 Verizon Media. All rights reserved.        Learn More    Reprints and Permissions    Suggestions    Privacy Policy (Updated)    Terms of Service (Updated)    Trademarks    Advertise           ", "category": "technology"}