{"author": "Jeremy", "title": "Appeal Rejected: Google Removed (ad-free) Mommy Saver Plus for \"Deceptive Ads\"", "description": "Yesterday, the Google Play team mistook Mommy Saver Plus for another app and removed it from the app store. (http://www.purpleleafsoftware.c...", "url": "http://www.purpleleafsoftware.com/2019/03/appeal-rejected-google-removed-ad-free.html", "urlToImage": "https://4.bp.blogspot.com/-sfErarlJKzY/XJquwJA84_I/AAAAAAAAbzY/K1XrCaB_RAUJEeb7SdrBrV32sFqJmSxpwCLcBGAs/w1200-h630-p-k-no-nu/appeal_rejected3.png", "publishedAt": null, "content": "                                                                Purple Leaf Software                                                                                                Tuesday, March 26, 2019         Appeal Rejected: Google Removed (ad-free) Mommy Saver Plus for \"Deceptive Ads\"     (UPDATE: Mommy Saver Plus has been reinstated!  This after I posted this on HN, tweeted at them, and sent a slightly-too-passive-aggressive email response.)  Yesterday, the Google Play team mistook Mommy Saver Plus for another app and removed it from the app store. (http://www.purpleleafsoftware.com/2019/03/google-removed-mommy-saver-plus-for.html)  I filled in the little textbox to make an appeal.  Today, I got an update:     Clearly, the reviewer either did not read or did not understand my two-sentence appeal.  It's possible my words weren't clear enough and the reviewer didn't have enough time to understand them.  I wrote something very close to \"Mommy Saver Plus was removed for 'deceptive ads' which is a little silly because there is no ads in the app.  The attached screenshots have nothing to do with Mommy Saver Plus.\"  This part scares me:   \"... repeated violations can result in the suspension of this app or your Google Play Developer account.\"  I don't dare re-submit the same app, at least not with the same package.  I'll probably tweak it a little bit and then re-submit it under a different package... after I back up all my google data, just in case.  Until then, the links to upgrade from the free version will continue to 404.     Posted by    Jeremy     at  3:56 PM                 Email This BlogThis! Share to Twitter Share to Facebook Share to Pinterest                2 comments:      CirikloDilo March 26, 2019 at 4:27 PM That sucks. What was in the screenshot they referenced in the more recent email?  \"disguised ad for [redacted]\" Reply Delete Replies Jeremy March 26, 2019 at 4:30 PM The other app apparently had a section saying something like \"see my other apps\" with pictures that linked to the app store to download those same apps. I'm actually not sure why Google considers that deceptive but I didn't examine very closely.  The screenshots are in the previous blog post if you want to try to figure it out. Delete Replies Reply Reply Add comment Load more...                         Older Post   Home     Subscribe to: Post Comments (Atom)                                         Blog Archive        ▼   2019  (3)     ▼   March  (3)   Appeal Rejected: Google Removed (ad-free) Mommy Sa...  Google Removed (ad-free) Mommy Saver Plus for \"Dec...  New App Coming Soon          ►   2016  (3)     ►   April  (3)                     Simple theme. Powered by Blogger .                                ", "category": "technology"}