{"author": "Megan Geuss", "title": "Senate vote puts Green New Deal resolution to bed", "description": "Protest votes from Democrats came after no hearings on the resolution were scheduled.", "url": "https://arstechnica.com/tech-policy/2019/03/senate-blocks-green-new-deal-in-procedural-vote/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/GettyImages-1133036441-760x380.jpg", "publishedAt": "2019-03-26T23:15:01+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              GND    —  Senate vote puts Green New Deal resolution to bed  Protest votes from Democrats came after no hearings on the resolution were scheduled.    Megan Geuss - Mar 26, 2019 11:15 pm UTC         Enlarge  / Activists outside the Congress demanding a vote to pass the Green New Deal. Aurora Samperio/NurPhoto via Getty Images     reader comments  104  with 61 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      On Tuesday afternoon, US Senators voted 0-57 on whether to take a vote on the Green New Deal, according to The Hill . Fifty-three Republicans, three Democrats, and an Independent from Maine voted not to advance the resolution, and 43 Democrats voted \"present,\" essentially taking no official side in the vote.  Further Reading Green New Deal bill aims to move US to 100% renewable energy, net-zero emissions The Green New Deal is a sweeping but non-binding resolution , unofficially committing the United States to radically update its energy grid with renewable energy in a span of 10 years. The plan would be accomplished through major infrastructure projects akin to those seen during the New Deal of President Franklin D. Roosevelt's time.  The plan, sponsored by Sen. Ed Markey (D-Mass.) in the Senate and Rep. Alexandria Ocasio-Cortez (D-NY) in the House, has been extraordinarily controversial. It's been panned as \"socialism\" on the right and tacitly disavowed by more moderate Democrats in Republican-leaning states.  The vote was pushed in the Senate by Majority Leader Mitch McConnell (R-Ken.), who hoped to divide Democrats by forcing them to take a side on the resolution. Per The Hill , McConnell said in a statement today that \"The American people will see, they will see which of their senators can do the commonsense thing and vote no on this destructive socialist daydream. And they will see which senators are so fully committed to radical left-wing ideology that they can't even vote 'no' on self-inflicted economic ruin.\"  The 43 \"present\" votes from Democrats were essentially protest votes, challenging McConnell's political play. Senate minority leader Chuck Schumer (D-NY) called the vote a \"sham\" hours before it occurred, because Republicans refused to schedule hearings, hear expert testimony, or work on a bipartisan compromise resolution, according to USA Today .  The Hill notes that \"Every Democratic senator running for the party's [presidential] nomination in 2020 has co-sponsored the Senate Green New Deal resolution.\"  Although the House could call a vote on the Green New Deal, there are no immediate plans to move forward on it.                reader comments  104  with 61 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Megan Geuss Megan is a staff editor at Ars Technica. She writes breaking news and has a background in fact-checking and research.   Email  megan.geuss@arstechnica.com  //  Twitter  @MeganGeuss              You must login or create an account to comment.       Channel Ars Technica      ← Previous story       Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}