{"author": "Beth Mole", "title": "Emergency declared in NY over measles, unvaccinated barred from public spaces", "description": "County official calls resistance to outbreak response \"unacceptable and irresponsible.\"", "url": "https://arstechnica.com/science/2019/03/emergency-declared-in-ny-over-measles-unvaccinated-barred-from-public-spaces/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2017/06/GettyImages-679040728-760x380.jpg", "publishedAt": "2019-03-26T22:53:59+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Drastic measures    —  Emergency declared in NY over measles, unvaccinated barred from public spaces  County official calls resistance to outbreak response \"unacceptable and irresponsible.\"    Beth Mole - Mar 26, 2019 10:53 pm UTC         Enlarge  / HOPKINS, Minn. - APRIL, 27: Abdullahi Mohamud, 5, awaits returning to school after two of his siblings contracted the measles during an current outbreak. Getty | Courtney Perry     reader comments  119  with 70 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      Plagued by a tenacious outbreak of measles that began last October, New York's Rockland County declared a state of emergency Tuesday and issued a directive barring unvaccinated children from all public spaces.  Further Reading Anti-vax parents sue to keep unvaccinated kids in school during outbreak Effective at midnight Wednesday, March 27, anyone aged 18 or younger who has not been vaccinated against the measles is prohibited from public spaces in Rockland for 30 days or until they get vaccinated. Public spaces are defined broadly in the directive as any places:  [W]here more than 10 persons are intended to congregate for purposes such as civic, governmental, social, or religious functions, or for recreation or shopping, or for food or drink consumption, or awaiting transportation, or for daycare or educational purposes, or for medical treatment. A place of public assembly shall also include public transportation vehicles, including but not limited to, publicly or privately owned buses or trains...  The directive follows an order from the county last December that barred unvaccinated children from schools that did not reach a minimum of 95 percent vaccination rate. That order—and the directive issued today—are intended to thwart the long-standing outbreak, which has sickened 153 people, mostly children .  \"We must not allow this outbreak to continue indefinitely,\" County Executive Ed Day said in a statement announcing the emergency declaration.  \"Every action we have taken since the beginning of this outbreak has been designed to maximize vaccinations and minimize exposures. We are taking the next step in that endeavor today,\" he explained. \"We must do everything in our power to end this outbreak and protect the health of those who cannot be vaccinated for medical reasons and that of children too young to be vaccinated.\"  The outbreak kicked off when an international traveler sick with the highly-contagious viral illness arrived in the county late last September. It has largely spread among the county's insular Orthodox Jewish community. However, other pockets of the county also have low vaccination rates, making them vulnerable.  Earlier this month, anti-vaccine parents appeared in federal court, bringing a lawsuit against the county alleging that banning their unvaccinated children from schools violated their religious freedom. The parents had used religious exemptions to opt their children out of standard vaccinations. The judge in the case denied their request to issue a temporary injunction that would let the children return to school.  But the lawsuit isn't the only opposition the county has faced as it tries to stamp out the infections.  Further Reading Emergency declared near Portland for measles outbreak in anti-vaccine hotspot \"As this outbreak has continued, our inspectors have begun to meet resistance from those they are trying to protect. They have been hung up on or told not to call again. They've been told 'we're not discussing this, do not come back,' when visiting the homes of infected individuals as part of their investigations,\" Day noted in today's announcement. \"This type of response is unacceptable and irresponsible. It endangers the health and wellbeing of others and displays a shocking lack of responsibility and concern for others in our community.\"  Rockland county is one of six locations nationwide currently experiencing an outbreak of measles . So far this year, the Centers for Disease Control and Prevention has tallied 314 confirmed cases of the disease from 15 states. The agency recorded 372 cases total for 2018 and just 120 in 2017.                reader comments  119  with 70 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Beth Mole Beth is Ars Technica’s health reporter. She’s interested in biomedical research, infectious disease, health policy and law, and has a Ph.D. in microbiology.   Email  beth.mole@arstechnica.com  //  Twitter  @BethMarieMole              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}