{"author": "Kyle Orland", "title": "Sony stops selling digital game codes at physical retailers", "description": "But you can still buy PSN currency in multiple deonominations.", "url": "https://arstechnica.com/gaming/2019/03/sony-stops-selling-digital-game-codes-at-physical-retailers/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2016/07/psn-wrecking-ball-640x215.jpg", "publishedAt": "2019-03-26T16:14:11+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              break out the credit card    —  Sony stops selling digital game codes at physical retailers  But you can still buy PSN currency in multiple deonominations.    Kyle Orland - Mar 26, 2019 4:14 pm UTC         Aurich x Getty     reader comments  51  with 32 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      PlayStation 4 owners who like buying downloadable game codes directly from brick-and-mortar stores will soon be out of luck. That's because Sony has confirmed to The Verge that it will stop selling such downloadable codes through physical retailers starting on April 1.  The report confirms a Wario64 tweet from last week , which quoted a GameStop memo saying, \"Sony full game digital downloads will only be available for purchase through the PlayStation marketplace\" after April 1. Days Gone and Mortal Kombat 11 will be the sole full-game exceptions to this policy, according to the memo, though DLC and season passes will still be available for direct purchase. It's currently unclear if Web-based retailers like Amazon will be affected by the decision.  Retail availability of digital game codes was especially useful for players who didn't or couldn't use a credit card on the PlayStation Network storefront. Buying digital codes through a retailer also let customers make use of trade-in credit from used physical games and take advantage of other retailer promotions without requiring the purchase of a physical disc.  While individual game codes will no longer be available, brick-and-mortar customers will still be able to buy prepaid PSN currency cards in a newly expanded set of denominations: $10, $20, $50, $75, and $100. That will come off as a little sterile for customers who want to buy someone a downloadable PSN game as a gift, but it will serve the same purpose for most other users.  A PlayStation spokesperson told The Verge that the decision \"was made in order to continue to align key businesses globally,\" whatever that means. Nintendo, Microsoft, and many PC game makers continue to sell digital game codes for specific games directly at retail.  Further Reading Report: Amazon will publish toy catalog this holiday to fill Toys ‘R Us void Sony's move comes during challenging times for game retailers. Physical sales and profits are down throughout the brick-and-mortar marketplace, and Gamestop stock cratered 27 percent in January after the company failed to find a buyer for its thousands of worldwide storefronts. And Toys R Us, one of the country's biggest physical game retailers, shut down after declaring bankruptcy last year .                reader comments  51  with 32 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Kyle Orland Kyle is the Senior Gaming Editor at Ars Technica, specializing in video game hardware and software. He has journalism and computer science degrees from University of Maryland. He is based in the Washington, DC area.   Email  kyle.orland@arstechnica.com  //  Twitter  @KyleOrl              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}