{"author": "Emma Comeau", "title": "Dive deep with Q&A Sessions at Disrupt SF 2019", "description": "When you hit the ground running at Disrupt San Francisco 2019 — and you will — be sure to save time for a Q&A session. You’re going to hear a bevy of world-class speakers discussing a range of thought-provoking topics on the Main Stage. A Q&A Session is the place where you can continue the …", "url": "https://techcrunch.com/2019/03/26/dive-deep-with-qa-sessions-at-disrupt-sf-2019/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/TC_Disrupt_Social_FB1.jpg?w=764", "publishedAt": "2019-03-26T17:01:47Z", "content": "                        Dive deep with Q&A Sessions at Disrupt SF 2019     Emma Comeau  11 hours         When you hit the ground running at Disrupt San Francisco 2019 — and you will — be sure to save time for a Q&A session. You’re going to hear a bevy of world-class speakers discussing a range of thought-provoking topics on the Main Stage. A Q&A Session is the place where you can continue the discussion from the Main Stage or Extra Crunch Stage — or even raise a new one.  We interrupt this message to remind you to buy your pass to Disrupt SF 2019 and enjoy significant super early-bird savings. We now return you to our regularly scheduled programming.  What’s the difference between Main Stage interviews and Q&A Sessions? So glad you asked. Main Stage events occur in the largest auditorium and are live-streamed on TechCrunch.com around the world. Q&A Sessions are specifically for Disrupt SF attendees to extend the conversation with speakers and take place in a smaller, more intimate space. A TechCrunch editor moderates a panel of experts, and they take questions submitted from the audience. It’s the perfect time to take a deeper dive into a topic or to follow-up on an issue raised during a Main Stage or Extra Crunch Stage presentation.  Main Stage events are recorded, live-streamed and they’re also available later, on demand — not the case with Q&A Sessions. The only way to benefit from the content is to be there in person. Better plan to arrive early if you want a seat. They’re very popular, space is limited and admission is strictly first come, first served.  Q&A Session topics vary and relate to the category tracks featured at Disrupt SF 2019 : Artificial Intelligence/Machine Learning, Biotech/Healthtech, Blockchain, Fintech, Gaming, Investor Topics, Media, Mobility, Privacy/Security, Retail/E-commerce, Robotics/IoT/Hardware, SaaS, Space and Social Impact & Education.  Disrupt SF 2019 packs so much into just three days. Check out the epic $100,000 Startup Battlefield pitch competition. Heck, why not apply to compete this year? Or maybe you want to plant your early-stage startup flag in Startup Alley . Buy a Startup Alley Exhibitor Package or apply to be a TC Top Pick and exhibit in Startup Alley for free.  We’ll have plenty more great programming to share with you soon — new speakers, panels, workshops, sponsored hackathon contests and more.  Disrupt San Francisco 2019 takes place October 2-4. Don’t miss out on the super early-bird savings. Buy your pass now before the price goes up.                             ", "category": "technology"}