{"author": "https://www.facebook.com/bbcnews", "title": "Cycling heaven: The African capital with 'no traffic'", "description": "How Asmara in Eritrea unintentionally became a cycling paradise.", "url": "https://www.bbc.com/news/world-africa-47709673", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/ED06/production/_106187606_cc0a52cf-e2f6-4126-8b16-7f8a250729f0.jpg", "publishedAt": null, "content": "       Homepage Accessibility links Skip to content Accessibility Help BBC Account Notifications Home News Sport Weather iPlayer Sounds CBBC CBeebies Food Bitesize Earth Arts Make It Digital Taster Local Tomorrow's World TV Radio Menu Search Search the BBC Search the BBC             News   BBC News Navigation     Sections           Home      Video      World   selected     US & Canada      UK      Business      Tech      Science      Stories      Entertainment & Arts      Health      In Pictures      Reality Check      World News TV      Newsbeat      Special Reports      Explainers      The Reporters      Have Your Say        World  selected     Africa   selected     Asia      Australia      Europe      Latin America      Middle East                 Africa               Africa             Cycling heaven: The African capital with 'no traffic'       27 March 2019              Share this with Facebook           Share this with Messenger           Share this with Twitter           Share this with Email           Share this with Facebook           Share this with WhatsApp           Share this with Messenger           Share this with Twitter      Share    Share this with  These are external links and will open in a new window      Email  Share this with Email       Facebook  Share this with Facebook       Messenger  Share this with Messenger       Messenger  Share this with Messenger       Twitter  Share this with Twitter       Pinterest  Share this with Pinterest       WhatsApp  Share this with WhatsApp       LinkedIn  Share this with LinkedIn     Copy this link   https://www.bbc.com/news/world-africa-47709673   Read more about sharing.  These are external links and will open in a new window   Close share panel                 Image copyright  Milena Belloni   A combination of various factors ranging from conflict to diplomatic isolation have unintentionally turned the Eritrean capital into a cycling paradise. Asmara only has about 500,000 inhabitants, which combined with low salaries, high import taxes and fuel shortages means the city has few vehicles. Those you do see often tend to be from a different age.    Image copyright  Milena Belloni      Image copyright  Milena Belloni   Roads are not only relatively empty of cars. Locals lament the departure of great numbers of young Eritreans who have left over the last 20 years because of hardships brought by regional conflicts and enforced national service under a government that brooks little dissent.     As a result of its circumstances, Asmara offers a very different landscape compared to many African cities congested with traffic. This, combined with the wonderful climate, makes it a dream for cyclists to get around. \"Cycling is part of our culture,\" says a 25-year-old man.    Image copyright  Milena Belloni   Asmara's architecture is also admired and it was recently made a Unesco World Heritage Site for its striking art deco buildings , a legacy of the country's time as an Italian colony from 1897 until 1943.        Image copyright  Milena Belloni   Bike repair shops abound all over Asmara. Eritrea has a long history of self-reliance that began during its 30-year war for independence from Ethiopia, after which its international isolation has made importing bicycles and spare parts extremely expensive.    Image copyright  Milena Belloni   Eritreans ride bicycles of all kinds and colours: mountain-bikes, city bikes, racing bikes. Young and old, women and men, athletes and housewives - all seem to embrace the \"bicicletta\", the word for bicycle in the local language, Tigrinya, that is borrowed from Italian.    Image copyright  Milena Belloni       Those who rely on public transport have to endure long waits before jumping on an extremely crowded bus. \"Buses are so old and so few,\" says Salam, a 30-year-old graduate. \"Having a bicycle is life-saving here.\"    Image copyright  Milena Belloni   Environmental sustainability has long been promoted by the government. This has included limiting plastic production and usage, reforestation campaigns, safeguarding the country's green areas and distributing bikes imported from Dubai and China.    Image copyright  Milena Belloni   For many Eritreans money is tight, and even if vehicles are available, bicycles remain the most affordable mode of transport.    Image copyright  Milena Belloni   The recent peace deal with Ethiopia in July 2018 resulted in the border opening for the first time in 20 years . Now cheap Ethiopian merchandise is sold all over the country, lowering the cost of living.    Image copyright  Milena Belloni   A combination of conflict, diplomatic isolation and UN sanctions, lifted after nine years last November , means there are still shortages of many products. Lack of fuel has resulted in cars and buses often having to be parked up for a long time, leaving people few choices other than walking or pedalling to get around.    Image copyright  Milena Belloni   Cycling is the most popular sport among Eritreans. Introduced by the Italians, competitive cycling is a source of pride among the population. The Eritrean national team, which includes Mosana Debesay pictured below in Austria last September, is extremely successful in international races.    Image copyright  Getty Images   The recent rapprochement with Ethiopia has left many Eritreans hoping that the economy can develop faster, making everyday life in Asmara easier.    Image copyright  Milena Belloni   By anthropologist Milena Belloni and journalist James Jeffrey    Related Topics Cycling Eritrea Transport    Share this story About sharing      Email      Facebook      Messenger      Messenger      Twitter      Pinterest      WhatsApp      LinkedIn         More on this story          Eritreans hope for democracy after peace deal with Ethiopia    17 July 2018            Eritrean Press: Reporting on Africa's most secretive state    27 February 2019            Video  Great Ethiopian Run 2018 helps promotes unity with Eritrea    17 December 2018            Jailed without trace in Eritrea: 'I haven't seen my parents for 17 years'    3 October 2018            Has Eritrea's migration problem been exaggerated?    8 June 2016            Eritrea President Isaias Afwerki 'both charismatic and brutal'    13 July 2018            Eritrea country profile    15 November 2018              Around the BBC          Africa Today podcasts            News in Tigrinya                                                                                      Why you can trust BBC News       BBC News Navigation   World  Sections    Africa  selected    Asia    Australia    Europe    Latin America    Middle East         Home      Video      World   selected     World Home   Africa  selected    Asia    Australia    Europe    Latin America    Middle East         US & Canada      US & Canada Home        UK      UK Home   England    N. Ireland    Scotland    Wales    Politics         Business      Business Home   Market Data    Global Trade    Companies    Entrepreneurship    Technology of Business    Connected World    Global Education    Economy         Tech      Science      Stories      Entertainment & Arts      Health      In Pictures      Reality Check      World News TV      Newsbeat      Special Reports      Explainers      The Reporters      Have Your Say          BBC News Services    On your mobile    On your connected tv    Get news alerts    Contact BBC News         Explore the BBC Home News Sport Weather iPlayer Sounds CBBC CBeebies Food Bitesize Earth Arts Make It Digital Taster Local Tomorrow's World TV Radio  Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Parental Guidance Contact the BBC Get Personalised Newsletters Copyright © 2019 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "category": "technology"}