{"author": "Peter Kafka", "title": "Apple’s plans for its new TV service: Sell other people’s TV services", "description": "Apple’s TV plans, explained. (Spoiler: Apple isn’t taking on Netflix yet.)", "url": "https://www.recode.net/2019/3/21/18275747/apple-tv-launch-plans-event-hbo-showtime-starz-netflix-news-magazine-goldman-amazon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Z3o5iGcu51_4UvaZVL9sJOjFqlU=/0x701:5099x3371/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9140299/618582540.jpg", "publishedAt": "2019-03-21T16:05:09Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Apple      Media      Apple TV       Apple’s plan for its new TV service: Sell other people’s TV services   Apple’s TV plans, explained. (Spoiler: Apple isn’t taking on Netflix yet.)  By  Peter Kafka   Updated Mar 21, 2019,  1:43pm EDT        Share     Tweet        Share     Share  Apple’s plan for its new TV service: Sell other people’s TV services      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    After years of circling the TV business, Apple is ready to announce its TV plan.  Stephen Lam/Getty Images     After years of circling the TV business, Apple is finally ready to make its big splash: On Monday it will unveil its new video strategy, along with some of the  new big-budget TV shows it is funding itself.  One thing Apple won’t do is unveil a serious  competitor to Netflix, Hulu, Disney, or any other entertainment giant trying to sell streaming video subscriptions to consumers.  Instead, Apple’s main focus — at least for now — will be helping other people sell streaming video subscriptions and taking a cut of the transaction. Apple may also sell its own shows, at least as part of a bundle of other services. But for now, Apple’s original shows and movies should be considered very expensive giveaways, not the core product.  That is much less exciting than “Apple Takes on Netflix in the Streaming Wars,” but it is an accurate description. Even worse for people interested in exciting narratives: Apple has already been helping people sell video subscriptions and taking a cut of the transaction for years.  The difference, say people who’ve talked to Apple about its plans, is that instead of selling TV subscription apps surrounded by millions of other apps in its main app store, Apple plans on making a new storefront that’s much more prominent for those who use Apple TV boxes and other Apple hardware. It will also be able to offer its own bundles — for instance, it could offer a package of HBO, Showtime, and Starz at a price that’s lower than you’d pay for each pay TV service on its own.  And, as it already does on its TV app, Apple will be able to show users what’s playing on services they subscribe to and surface stuff they may be interested in.  All of this might very well work. Apple has an installed base of 1.4 billion users, and some of them will buy the things Apple promotes: Look at the success of Apple Music, which launched seven years after Spotify but quickly amassed 50 million subscribers due to a free trial period and prominent real estate on Apple’s devices.  Another reason this could work: Amazon has already been very successful with its own version of the same idea. Facebook is also bullish on selling TV subscriptions and is pushing would-be partners to sign up so it can launch later this spring or summer, according to industry sources. Similarly, Comcast (which is a minority investor in Vox Media, which owns this site) is rolling out Flex , a $5-a-month service that gives you a bunch of free content (some of which you can also get other places) and the ability to easily buy HBO, Showtime, etc. Instead of offering exclusive content, Comcast is offering subscribers a Roku-like streaming box.  If you are a fan of the “Apple can’t innovate anymore” theory, some of the above will provide you more ammunition: Apple’s big launch is a revamped version of something it’s already doing, and something its competitors are doing, too. “It’s incremental,” shrugs an executive at a company that’s working with Apple on the new, new video store.  But I’m partial to the theory that Apple won’t make another iPhone because the iPhone was a once-in-a-lifetime product, which happens to be the theory Apple has been implicitly promoting for several years now. As Apple’s iPhone sales have slowed , Apple has been pushing the idea of generating more “service” revenue — selling more software, entertainment, and subscription services to people who already own Apple hardware.  Speaking of that, a brief detour to talk about the other service stuff we expect to see Monday:    Apple will unveil a “Netflix for news” service based on Texture, the magazine app it bought last year. In addition to stories from magazines publishers like Conde Nast and Hearst, which it already offered, it will offer news from the Wall Street Journal and other publishers — but not the New York Times and the Washington Post. Publishers believe Apple will price the plan as a standalone service at $10 a month.   Apple is working with Goldman Sachs on a joint credit card , which will reportedly have special features when paired with iPhones. Goldman CEO David Solomon will be at Apple’s event at its Cupertino, California, HQ on Monday , so expect to hear more about that next week.  Industry observers assume Apple will sell access to multiple services, perhaps including Apple Music and/or some of its cloud storage offers, as part of a bundle.   All of which sounds fine. And potentially very lucrative. And, if you squint hard and hope, a potential new revenue boost for publishers, who could use one.  But that’s not nearly as fun as Apple taking on Netflix. Let’s go back to that one and explain why it’s not so.  Yes, Apple may be spending $2 billion a year on dozens of shows, which feature participation from brand names like Reese Witherspoon, Steven Spielberg, and JJ Abrams . And yes, it may even sell a subscription to those shows to people who use the service on other company’s hardware, like Samsung TVs .  But Apple’s partners believe Apple’s primary plan is to use the shows as added value giveaways, either to people who own Apple phones and other devices or to people who buy some of the other services it will roll out Monday.  That makes sense. Because while $2 billion a year is a lot of money, it’s not much compared to the $10 billion a year Netflix says it will spend on programming  this year.  And, crucially, Apple will launch from a standing start: Those new shows will be the only shows Apple has to offer, because it doesn’t have a library of existing stuff, like Hulu and Netflix. And WarnerMedia and Disney will be drawing from their own giant catalog of movies and TV shows when they launch their own subscription services later this year.  Apple could certainly license a lot of other stuff if it wanted to — or just purchase the entertainment companies outright that own that stuff. (In the past, for instance, Apple had briefly discussed buying Time Warner, primarily to get its hands on HBO.) But right now, Apple’s strategy seems to be letting other streamers fight each other while it collects rent from all of them.  Some backstage details:   One under-the-covers change that matters to Apple and its partners: With the new video storefront/service, Apple will host and serve the streams, which means it will have primary access to the viewing data its users generate. Under the previous model, streaming video apps Apple offered essentially redirected users back to the streamers’ own hosting service. Streamers who work with Apple in the new setup will have to be comfortable with Apple owning the primary relationship with their audience.  That wholesale/retail relationship also means Apple, not the streamers, can set the price for the stuff it sells. Apple isn’t likely to sell, say, HBO for less than HBO sells itself on rival platforms like Roku. But it definitely plans to sell bundles of pay TV channels at a discount, just like pay TV operators have always done.   Netflix has already said it won’t be part of Apple’s store . But some other prominent names may be missing on Monday: An industry source says Apple hasn’t tried to get every big subscription service on board, at least for launch.   Update 3/21: Updated to include information about Comcast’s “Flex” plan.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.              Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.              Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.              Canada is becoming a tech hub. Thanks, Donald Trump!  US companies are moving tech jobs to Canada rather than deal with Trump’s immigration policies.                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 25. The sidebar size is long.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}