{"author": "Rachel Kaser", "title": "Bethesda is for Steam in the cold war against Epic", "description": "Bethesda has declared its public support of Steam by promising its upcoming games will have a home there. A scant six months ago, this would have just been the end of the company's ...", "url": "https://thenextweb.com/gaming/2019/03/26/bethesdas-games-steam-epic-conflict/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2018%2F05%2Ffallout.jpg&signature=1c097505eca705c9b6dca3d2e24394d0", "publishedAt": "2019-03-26T19:00:16Z", "content": "                                                                                  News  Events   Index  TQ  Deals  Answers  TNW X     News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces     Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.    Got it!  or More info                          Sections   Latest  Insights  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0     About TNW   About Team Advertise Jobs Contact   TNW Sites   News Conference Hard Fork Decentralized Index TQ Deals Answers Cyberspace Culture        The TNW2019 map is here – 40,000m2 of tech festival! Check it out →             Bethesda’s games are going back to Steam, Epic gets snubbed    by Rachel Kaser — in Gaming            40  shares                                                      Bethesda has declared its public support of Steam by promising its upcoming games will have a home there. A scant six months ago, this would have just been the end of the company’s failed attempt to launch its own platform. But in the currently contentious world of PC gaming, it’s a new salvo in the ongoing standoff between Valve’s platform and the upstart Epic Store.  The company appeared to be moving towards its own platform, the Bethesda launcher. But then the calamitous Fallout 76 launch happened, and suddenly that’s not looking like such a great idea — I’m on record saying a lot of the game‘s problems could have been avoided had Bethesda launched it on Steam, and it appears the head honchos have come to the same conclusion.      We’re pleased to announce that RAGE 2, Wolfenstein: Youngblood, Wolfenstein: Cyberpilot, and DOOM Eternal will be released on Steam as well as https://t.co/p0BARqmTBp . We will also be bringing Fallout 76 to Steam later this year.  — Bethesda (@bethesda) March 25, 2019    Love tech? You should go to TNW2019  Find out why   See more     In a surprise tweet yesterday, Bethesda announced all of its upcoming games would be on Steam in addition to its Bethesda store, as would the previously-exclusive Fallout 76 . While we don’t yet know if the Bethesda store will launch the games before or alongside Steam, it’s still a tacit admission that the store isn’t up to another major solo launch.  This tweet is also as noteworthy for what it doesn’t say as for what it does — namely, there’s no mention of the games coming to the new Epic Games store. And the fact that Bethesda is throwing its support for Steam is more significant now than it would have been even a few months ago — even if the games come to the Epic Store at some point, Bethesda‘s namedropped Steam first.  The two stores have been engaged in a war of exclusives that’s swiftly dividing the PC gaming market. Every time a new game is announced to be coming to the Epic Store exclusively, the debate over whether it’s good for the consumers reignites. On the one hand, supporters have argued Valve’s monopoly is nothing worth defending, and the revenue split that benefits developers will also trickle down to gamers in the form of cheaper games. On the other hand, critics argue Epic is just dividing the PC gaming market with thought only towards its own profits, and has been known to engage in some shady datamining practices .  Game developers who launch on PC seem to have the option of going for one or the other, and each new name added to each side feels like a point for them. Steam scored not only Bethesda with this tweet, but also the Halo: Master Chief Collection  earlier this month . The Epic Store, meanwhile has been pulling its own share of games, including Obsidian’s promising sci-fi RPG The Outer Worlds and the crowdfunded Phoenix Point .  It seems the people at Epic are at least marginally aware they aren’t winning gamers’ hearts and minds. During a talk at the Game Developers Conference last week, Steve Allison, the head of the store, was asked about the company’s move with Metro Exodus . Questioned about the poorly-received move to poach the game from Steam despite extant pre-orders, Allison said “ We don’t want to do that ever again.” Steam, for its part, seems content to wait Epic out rather than change any of its own policies, as it has years of gamer goodwill to bank on.  No matter what, it seems gamers who want to enjoy games on PC are going to be dragged into this conflict whether they like it or not.  TNW Conference 2019 is coming! Check out our glorious new location, inspiring line-up of speakers and activities, and how to be a part of this annual tech bonanza by clicking here .   Distract Bethesda Softworks Steam (software) Game Epic Games       Share on Facebook (6)      Share on Twitter (34)             Most popular      1   European Parliament votes ‘yes’ on controversial Copyright Reform     Már Másson Maack            2   Inside GitHub’s fight to protect devs from EU’s disastrous Copyright Reform     Már Másson Maack            3   Apple announces Apple Card, a titanium credit card that aims to revolutionize payments     Rachel Kaser            4   Facebook is hiring 22 people for its secretive blockchain division     Matthew Beedham            5   Xiaomi's new 100W charger will charge your phone in just 17 minutes     Ivan Mehta             Never miss out  Stay tuned with our weekly recap of what’s hot & cool by our CEO Boris .     T h a n k  y o u !          Do it     Join over 260,000 subscribers!    Who's Hiring Add your company         Latest      1   This app exposes which cryptocurrency a user is most likely to shill on Twitter     David Canellis            2   Here’s how to exhibit your startup for free at TNW2019     Ailsa Sherrington            3   Blizzard tweaks loot boxes in Heroes of the Storm amid gambling controversy     Rachel Kaser            4   CERN’s new study brings us closer to understanding antimatter and why we exist     The Conversation            5   Google accidentally promoted a malicious Bitcoin wallet on YouTube     Yessi Bello Perez                               Events  About  Team  Advertise  Jobs  Contact        © 2006–2019 The Next Web B.V.  Made with ♥ in Amsterdam.  Powered by        Stay tuned     Treat yourself  Sit back and let the hottest tech news come to you by the magic of electronic mail.    T h a n k  y o u !          Sign up     Prefer to get the news as it happens? Follow us on social media.       1.76M followers         1M likes           Help us out     Who are you?  Got two minutes to spare? We'd love to know a bit more about our readers.  Start!   All data collected in the survey is anonymous.                                                          ↑  ↓ Navigate up/down   Enter Go to article   / Search new term   Esc Close search  ", "category": "technology"}