{"author": "Ailsa Sherrington", "title": "Here’s how to exhibit your startup for free at TNW2019", "description": "Every day, groundbreaking ideas are transformed into startups. Their expertise and capabilities can help companies reach new levels of growth – but it can be hard to get their name ...", "url": "https://thenextweb.com/events/2019/03/26/future-of-work-startups-tnw2019/", "urlToImage": "https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2019/03/dfghj.png", "publishedAt": "2019-03-26T15:57:44Z", "content": "                                                                                  News  Events   Index  TQ  Deals  Answers  TNW X     News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces     Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.    Got it!  or More info                          Sections   Latest  Insights  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0     About TNW   About Team Advertise Jobs Contact   TNW Sites   News Conference Hard Fork Decentralized Index TQ Deals Answers Cyberspace Culture        The TNW2019 map is here – 40,000m2 of tech festival! Check it out →             Here’s how to exhibit your startup for free at TNW2019    by Ailsa Sherrington — in Events            13  shares                                                      Every day, groundbreaking ideas are transformed into startups. Their expertise and capabilities can help companies reach new levels of growth – but it can be hard to get their name out there. That’s why we’re shining the spotlight on the most promising tech startups that are innovating the future of work at TNW2019, so companies can benefit from their ideas.  We’re partnering with Heidrick and Struggles , one of the leading executive search firms in the world, to present the Future of Work Startup Program. Together, we’re encouraging companies to support up-and-coming startups, by giving them the chance to attend and exhibit at TNW2019 at no cost.  Startups can now sign up for the chance to win a free exhibiting booth in the Boardroom of the Future Pavilion at TNW Conference. We’ll carefully select the top eight startups, who’ll have the chance to meet with top-tier investors, take part in the pitch competition, show their product on the business floor and network with 17,500 conference attendees.   TNW Conference is coming up in Amsterdam  You should definitely be there   See why    Win a spot in the Future of Work Startup Program to enjoy these perks:   A booth on the exhibition floor as part of the Future of Work pavilion  Access to TNW’s state-of-the-art matchmaking platform  A chance to be selected to pitch in the Pitch Tower  Access to all content stages and speakers content  A wristband for dozens of satellite events   Want to exhibit your startup for free at TNW2019? Shoot us an email !   Read next:  This app exposes which cryptocurrency a user is most likely to shill on Twitter    Insights TNW Conference 2019       Share on Facebook (13)      Share on Twitter (0)             Most popular      1   European Parliament votes ‘yes’ on controversial Copyright Reform     Már Másson Maack            2   Inside GitHub’s fight to protect devs from EU’s disastrous Copyright Reform     Már Másson Maack            3   Apple announces Apple Card, a titanium credit card that aims to revolutionize payments     Rachel Kaser            4   Facebook is hiring 22 people for its secretive blockchain division     Matthew Beedham            5   Xiaomi's new 100W charger will charge your phone in just 17 minutes     Ivan Mehta             Never miss out  Stay tuned with our weekly recap of what’s hot & cool by our CEO Boris .     T h a n k  y o u !          Do it     Join over 260,000 subscribers!    Who's Hiring Add your company         Latest      1   Here's why the Huawei P30 Pro's camera could redefine smartphone photography     Napier Lopez            2   Mozilla just launched an Android password manager     Matthew Hughes            3   Bethesda's games are going back to Steam, Epic gets snubbed     Rachel Kaser            4   This app exposes which cryptocurrency a user is most likely to shill on Twitter     David Canellis            5   Here’s how to exhibit your startup for free at TNW2019     Ailsa Sherrington                               Events  About  Team  Advertise  Jobs  Contact        © 2006–2019 The Next Web B.V.  Made with ♥ in Amsterdam.  Powered by        Stay tuned     Treat yourself  Sit back and let the hottest tech news come to you by the magic of electronic mail.    T h a n k  y o u !          Sign up     Prefer to get the news as it happens? Follow us on social media.       1.76M followers         1M likes           Help us out     Who are you?  Got two minutes to spare? We'd love to know a bit more about our readers.  Start!   All data collected in the survey is anonymous.                                                          ↑  ↓ Navigate up/down   Enter Go to article   / Search new term   Esc Close search  ", "category": "technology"}