{"author": "Gareth Beavis", "title": "Hands on: Huawei P30 Pro review", "description": "It’s mostly about the camera", "url": "https://www.techradar.com/reviews/hands-on-huawei-p30-pro-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qHMbS7hmoo6TzhbffHnu9d-1200-80.jpg", "publishedAt": "2019-03-26T13:45:02Z", "content": "          TechRadar  The source for Tech Buying Advice      Search          RSS                   Reviews  How To  Phones  TVs  Laptops  Photography  Deals  More  Car Tech  Wearables  Tablets  Components  Audiovisual  Gaming  Computing  Downloads  News  Video  Magazine     Pro          Trending   Apple TV Plus   Buying Guides   Galaxy S10   Best Laptops   Best Phones   Best TVs    Brands  Samsung  Apple  Google  Huawei       Hands on: Huawei P30 Pro review  It’s mostly about the camera     Not yet rated By Gareth Beavis  2019-03-26T14:16:15Z Mobile phones                              Shares   What is a hands on review?          Early Verdict  A strong phone from Huawei that's well put together, but one that lacks any real headline spec beyond the camera. The four sensor array impresses and the zoom is mind-blowing if used correctly - but is that enough for a real flagship?      For  Strong camera  Mind-bending zoom capabilities      Against  Specs don't wow  Screen colors a little muted           Huawei has moved from being an underdog to being one of the bigger phone brands in the world, thanks to a fusion of heavy marketing and, well, making ever-improving phones. The new Huawei P30 Pro takes a lot of what we saw with the Huawei Mate 20 Pro but improves some elements of the design as well as rebooting the camera somewhat - and is a distinctly more powerful phone than the Huawei P30 in a few ways. We spent an hour playing with the new phone from the Chinese brand, and while some elements felt a little too familiar, some features of the camera absolutely blew us away. Huawei P30 Pro price and release date We had to wait until right until the very end of the launch, but the Huawei P30 Pro price is in: if you're looking for 8GB of RAM, well, you've come to the right place as the P30 Pro only has that spec variant. There are three storage flavors though, and these are: 128GB for €999 (around £850 / $1120 / AU$1500), 256GB for €1099 (around £940 / $1240 / AU$1700) and 512GB for €1249 (around $1050 / $1400 / AU$2000). In terms of the release date for the P30 Pro, you're able to buy it from the date of the launch (March 26) - so if you want it, go grab it. However, it won't be on shop shelves in some territories until a little later - the Huawei P30 Pro UK release date isn't until April 5, for instance. We're still not expecting these phones to be sold in the US any time soon. The best Huawei P30 Pro deals are all listed right here Design and screen The curved sides taper away nicely in the hand. The Huawei P30 Pro comes in four colors: a light blue (called Breathing Crystal... we know), The purple / blue mix of 'Aurora', the orange 'Amber Sunrise' and the more standard... 'Black') The range is pearlescent, and shimmers with different tones rather attractively, apart from black, which is basically so reflective as to be a mirror. We're assuming the name 'Black Mirror' wasn't allowed to be used. We weren't given the exact dimensions of the phone in our briefing, but the 6.47-inch OLED display fits neatly into the front of the phone, with a small teardrop notch for the camera. The notch is already seeming a bit outdated on phones - we were surprised to not see a punch-hole. It's interesting to hear Huawei call said cut-out 'beautiful' when in previous briefings we’ve been told how the punch-hole selfie-cam idea is the future... at least, that's what Huawei’s sister company Honor told us, and they have the same design team. The Aurora and Black colors of the P30 Pro. The overall effect of the screen quality is that, despite it being ‘only’ Full HD, you're getting a very impressive picture. The peak brightness stuns at times, with a bright sunset powering out from a dark scene. However, we're not sure there's any HDR support in the screen here, so that's something we're looking to follow up on soon. If you're expecting vibrant OLED technology here, it's best to hold off clicking that ‘pre-order now’ button until  you've seen the muted, natural colors of the display on the P30 Pro. It's certainly not an issue, but it is something you'll want to check out in person. The Huawei P30 Pro design isn't earth-shattering, although the screen does taper away and curve into the sides of a rather thick aluminum band that runs around the outside of the device. That band houses the USB-C connector (but sadly no headphone jack, unlike the P30 ‘normal’), as well as the single, downwards-firing mono speaker. It feels a bit old-fashioned to not have a stereo speaker setup, but that’s because there’s no conventional speaker for taking calls – the screen itself vibrates, using a technology called magnetic levitation. The output from said speaker is only fine – it's not the best we've ever heard, but for a single option it's better than expected in terms of volume and the clarity of music being pumped out. The camera array sits proud from the rear of the phone, pulling in the four sensors together, which can create a rather lopsided feel when it’s laid on the table; but the volume and power button sit nicely where the thumb falls on the right-hand side of the phone. Camera The quad-camera array. The big feature Huawei spent so long briefing us on is the new P30 Pro camera system, which it claims will make us completely rethink smartphone photography. The main thrust is for the Super Spectrum Sensor, a 40MP effort that can pull in light at a ridiculously  high ISO and has an f/1.6 lens for quality night footage. The SuperSpectrum sensor is the feature Huawei is making the biggest deal of here: it's replaced each of the green pixels in a standard RGB sensor with two yellow pixels, so it reckons the sensor will be able to pull more light and color information as a result, with an enhanced ability to suck in red and green light. Combined with Huawei's strong artificial intelligence (AI) photography smarts, the results should be impressive. This is flanked by a 5x telephoto camera (a feat achieved by turning the light coming in 90 degrees inside the phone to give it more space to reflect the image) as well as a time-of-flight range imaging sensor (for better background blurring) and an ultra-wide mode, using a 20MP sensor. Image 1 of 4 Just your average photo, right? Image 2 of 4 Haha - it was zoomed in. Surprise... Image 3 of 4 WAIT, MORE ZOOM? Image 4 of 4 OK, the mind is officially blown. This is from a phone. The Huawei P30 Pro also has 10x lossless zoom, claims the brand, thanks to some inbuilt AI smarts – and it uses that feature to offer a 50x digital zoom, to do things like take a picture of the moon when it's doing something pretty, or just have a really close up look at a poster across the street from a demo area. Just for instance, not saying we're doing that. So how does the camera work on the Huawei P30 Pro? Pretty well. Indoor and outdoor shots look clean, and snap quickly, but do show that same level of sharpness that Huawei phones seem to deliver - it’s up to you whether that’s a bold feature or not. The background blur on photos looks good too, although the shutter lag was pretty pronounced – in fact, most photos we took saw the Huawei P30 Pro asking us to 'hold still' having snapped the shot so it could sharpen the pictures using its AI mode. Image 1 of 2 The selfie camera is fine, but 32MP doesn't seem to add a huge amount from a smaller sensor Image 2 of 2 The depth sensor took a rather long time to work. The night mode didn't impress massively, but when all you can do in a test area is wrap yourself in a curtain it's hardly the most scientific of tests. However, we did note that the iPhone XS Max created a night image that was similar to the P30 Pro, so we're not expecting the new phone to trouble the Google Pixel 3's dominance in the low-light market. Image 1 of 2 This shot was taken in near darkness and yet enhanced nicely Image 2 of 2 Switching to the f/3.4 zoom lens, you can see the difference in quality The selfie camera is powerful – more powerful than is necessary, some might argue – at 32MP and takes a strong enough picture. There's smile mode to take a snap, but we found that we had to smile really widely to have a chance of the feature working – unless we were just jaded by the press room. However, it's in the zoom department that the Huawei P30 Pro really excels. The 5x telephoto zoom and 10x enhanced enlargement both work incredibly well (though not so much at night), and focusing on a small poster across the road showed that the 50x zoom actually gave strong, sharp photos too. Huawei's AI game is strong at the moment, using internal smarts to improve the quality of photos, and it's generally done the same here with aplomb. In a month or two, when an update lands you'll even be able to record a video with a small window zooming in on the action... we can't see why you'd really want to do that though, so it not being a launch feature isn't the end of the world. Battery The battery life on the Huawei P30 Pro wasn't disclosed by the brand, but it did unveil an increased power pack inside the phone that offers 4200mAh of power. Given we know that Huawei is great at providing battery management features, we're expecting this internal juice box to keep chugging along nicely for at least a single day. However, if the levels are looking a bit low before you're ready to leave work, the 40W fast charging on the Huawei P30 Pro means you can get to 70% power in just 30 minutes, which is pretty incredible. There's also speedy 15W wireless charging, and the capability to charge another phone or pair of wirelessly-powered headphones with some reverse wireless power delivery. Truly, we're living in the future. What's it like to use? The Huawei P30 Pro uses EMUI 9.1 a Kirin 980 chipset and an untold amount of RAM – no, literally, they've not told us what it is. We're assuming around 8GB, but like the internal storage there's no notion of what's on offer – although we're expecting storage to start at 128GB for a brand like Huawei. The speed of browsing around the Huawei P30 is much as you’d expect from a modern smartphone. There's a definite fluidity under the finger, and the lightning-fast reactions of the connectivity on our test impressed as we zipped through TechRadar. EMUI 9.1, the latest version of Huawei’s overlay for Android, is less onerous than it used to be in days gone by, with the Google integration for Western versions of this phone on the left screen. There are also fewer messages popping up everywhere when you’re navigating around, and combined with the fast innards and clear screen, the Huawei P30 Pro is adept at whisking you through everyday life tasks. There are still confusing and slightly annoying bugs in the system, for example with the AI video editor, which is supposed to be able to edit clips for you with no input – we could not find that anywhere in the camera screen. It’s also not as fluid as the iPhone XS or the Samsung Galaxy S10, with some elements of EMUI still feeling a little too overly complex and offering too many choices and tweaks to make. But compare it to a phone from Huawei that’s just five years old and you’ll see a massive change in the way the interface works. Early verdict The Huawei P30 Pro is one of the strongest phones the brand has ever produced, but the upgrades feel a little more incremental this year. The new colors shine nicely, the screen's teardrop notch isn’t too intrusive, and while the camera system does at least offer something different, it's still in a minor way. The speed under the finger is a nice touch, but we're looking forward to testing the real differences between the Huawei P30 Pro and last year's Mate 20 Pro, or the Huawei P20 Pro, to see how much really has changed. All images credit: TechRadar      What is a hands on review?  Hands on reviews' are a journalist's first impressions of a piece of kit based on spending some time with it. It may be just a few moments, or a few hours. The important thing is we have been able to play with it ourselves and can give you some sense of what it's like to use, even if it's only an embryonic view. For more information, see TechRadar's Reviews Guarantee .          Tech deals, prizes and latest news     Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!    No spam, we promise. You can unsubscribe at any time and we'll never share your details without your permission.        Most Popular    Most Shared         1 Apple News Plus: magazine list, cost, and release date          2 Apple TV Plus release date, price info and everything you need to know          3 The best laptop 2019: our pick of the 15 best laptops you can buy this year          4 New iPhone 11 release date, price, news and leaks          5 Your next Volvo won't let you drive drunk or distracted          1 Over a million Asus laptops could have been hacked          2 3 reasons why I'm sold on the Apple Card to replace my 'dumb' credit card          3 Apple Card: release date and all we know about the new iPhone-centric credit card          4 Further details spilled on Chromium-based Edge browser – along with a download link          5 How to build your first gaming PC          TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site .  About Us  Terms and conditions  Privacy policy  Cookies policy  Advertise with us  ©   Future US, Inc.   1390 Market St, Suite 200 , San Francisco  California  94102 .  ", "category": "technology"}