{"author": null, "title": "There Are No Dream Homes", "description": null, "url": "https://hmmdaily.com/2019/03/26/there-are-no-dream-homes/", "urlToImage": "https://hmmdaily.com/wp-content/uploads/sites/6/2019/03/real_estate.jpg?resize=1200,630", "publishedAt": null, "content": "                                      Skip to content         ARGUMENTS  FEATURES  SHORT ITEMS  REVIEWS  ABOUT  THE WORST THING WE READ™    JOIN US       Newsroom Navigation                There Are No Dream Homes  Published on Mar 26, 2019 8:50PM EDT           Tom Scocca   @tomscocca     Tom Scocca is the editor of Hmm Daily  See more           Share this: Click to share on Twitter (Opens in new window) Click to share on Reddit (Opens in new window) Click to email this to a friend (Opens in new window)         The Wall Street Journal story keeps bouncing around Twitter, about how the Baby Boomers who built big custom luxury houses don’t want them anymore , because the Baby Boomers are getting too old to handle such big houses, and they can’t sell them, because everyone else either is not interested in a big custom luxury house, in which case they won’t buy one, or is interested in a big custom luxury house, in which why would they buy someone else’s old one? This seems like funny comeuppance, and it is funny comeuppance, but it’s also just the clown-shoed version of the problem that everyone has in one way or another, which is that homeownership is not a solution but a way of freezing a particular set of problems in place.  A house is an investment, except it’s also a necessity, and it’s also an expression of status, which together make the investment wildly expensive and illiquid.  These particular people have spent much more money on their houses than other people, but that is a function of American house-buying culture, which steers everyone to the outer limits of their budget and their other capabilities unless they can summon an ascetic degree of refusal and resistance. A house is an investment, except it’s also a necessity, and it’s also an expression of status, which together make the investment wildly expensive and illiquid. A house is the physical expression of a mode of living, and whose mode of living makes sense anymore?  Not the mode of living of the Bethells, of the Asheville, North Carolina area:  For their retirement in a suburb of Asheville, N.C., Ben and Valentina Bethell spent about $3.5 million in 2009 to build their dream home: a roughly 7,500-square-foot, European-style house with a commanding view of the Blue Ridge Mountains. The Bethells said they love the home but it now feels too big, especially since their adult son visits only about once a year. Plus, tasks like pulling garbage cans up the steep, 100-yard-long driveway have become onerous, said Mr. Bethell, 78. “It’s a lot to do.” The couple listed the home in 2015 for $4.495 million, and have since reduced the price to $3.995 million. When the house does sell, they plan to buy a newly constructed, smaller house nearby.  How many times a year would the Bethells’ adult son have to visit for it to make any practical, functional difference in the experience of living in that house? How many of the 7,500 square feet could he account for, on how many days? Which came first, the emphasis on space and distance—the 100-yard driveway, the “commanding view”—or the sense of isolation and estrangement?  People guess who they are and what their lives are about, and they guess wrong.  People guess who they are and what their lives are about, and they guess wrong. Over and over the house-hunting column in the paper describes couples who bought a one-bedroom—or even a studio!—apartment, at the limit of their budget, and then discovered that they were human beings who were going to have children. Sometimes the discovery sends them clear up the Hudson Valley.  The belated self-discoveries among Journal ‘s subjects had more to do with decline and death. One couple, the Hambletons of Wadmalaw Island, South Carolina, built a 4,200-square-foot house for “just under $3 million” and almost immediately tried to sell it for $2.99 million; by now they’ve cut the price to $1.975 million:  Mr. Hambleton is “a very young 89,” his wife said, and when they built the house, “he was only 82,” so the property’s upkeep “didn’t seem like that major a thing.” But when it comes to aging, she added, “I don’t know that you face these things until you have to.”  The years dwindle; the space stays cavernous. No one else wants to, or can, live your life for you. Eventually these houses will hold four families each, or they’ll go back to woods and fields, slightly formaldehyde-tainted from the lumber. The dream was never a very good dream anyway.      HOWABOUT A NICE \"RAISED RANCH\" ON THE BUS LINE      Email Address                   Share this: Click to share on Twitter (Opens in new window) Click to share on Reddit (Opens in new window) Click to email this to a friend (Opens in new window)    HOWABOUT A NICE \"RAISED RANCH\" ON THE BUS LINE      Email Address                    Tom Scocca  @tomscocca     Tom Scocca is the editor of Hmm Daily  See more            BABY BOOMERS  CONSUMER CULTURE  HOMES  HOUSES  REAL ESTATE  THE MARKET  WALL STREET JOURNAL              THE WORST THING WE READ™ Primary category in which blog post is published    The New York Times Saw No Evidence        Tom Scocca     The Worst Thing We Read Yesterday™   Published on Mar 26, 2019 2:46PM EDT         SHORT ITEMS Primary category in which blog post is published    Everyone Loved Tamagotchi and Now You Can Be Loved Like One Too        THE MACHINES     T_H_E__M_A_C_H_I_N_E_S   Published on Mar 25, 2019 9:10PM EDT         THE WORST THING WE READ™ Primary category in which blog post is published    In the Absence of News, a Newspaper        Tom Scocca     The Worst Thing We Read This Past Weekend™   Published on Mar 25, 2019 3:17PM EDT                . . . ARGUMENTS  FEATURES  SHORT ITEMS  REVIEWS  THE WORST THING WE READ™     INTERACT WITH US TWITTER  INSTAGRAM  YOUTUBE     JOIN US   Contact Us at hmmdaily@hmmdaily.com     Copyright © 2019 Hmm Daily     xml version=\"1.0\" encoding=\"UTF-8\"?     About  Civil Constitution  FAQ     Have a Problem?   Contact Civil      Send to Email Address   Your Name   Your Email Address      Cancel  Post was not sent - check your email addresses!  Email check failed, please try again  Sorry, your blog cannot share posts by email.  ", "category": "technology"}