{"author": "Timothy B. Lee", "title": "EU parliament passes controversial copyright overhaul [Updated]", "description": "The maddeningly vague EU copyright overhaul approved on Tuesday, explained.", "url": "https://arstechnica.com/tech-policy/2019/03/the-eu-votes-on-a-confusing-new-copyright-law-tuesday/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2015/10/eu-flag-640x215.jpg", "publishedAt": "2019-03-26T14:00:46+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Having your cake and eating it too    —  EU parliament passes controversial copyright overhaul [Updated]  The maddeningly vague EU copyright overhaul approved on Tuesday, explained.    Timothy B. Lee - Mar 26, 2019 2:00 pm UTC         An EU flag at the European Parliament. European Parliament / Flickr     reader comments  211  with 109 posters participating, including story author    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      Update: The European Parliament approved the new European copyright directive on Tuesday by a vote of 348 to 274. Our original story on the legislation follows.   On Tuesday, the European Parliament will vote on an overhaul of the EU's copyright system. The body will vote on a compromise announced last month that has received the backing of key European governments. An earlier version of the proposal was approved by the European Parliament last September.  The legislation is controversial, with two provisions receiving the bulk of the criticism. Article 11 aims to help news organizations collect more licensing fees from news aggregators like Facebook and Google News. Article 13 aims to help copyright holders to collect licensing fees from user-generated content platforms like YouTube and Facebook.  Further Reading European governments approve controversial new copyright law  Both provisions are maddeningly vague—laying out broad goals without providing much detail about how those goals can be achieved. This is partly because the EU's lawmaking system occurs in two stages. First, EU-wide institutions pass a broad directive indicating how the law should be changed. Then each of the EU's member nations translates the directive into specific laws. This process leaves EU-wide legislators significant latitude to declare general policy goals and leave the details to individual countries.  Still, if the legislation's goals are incoherent or contradictory, then something is going to have to give. And critics warn that the package could wind up damaging the Internet's openness by forcing the adoption of upload filters and new limits on linking to news stories.  Article 13: “They may end up opting for filters”  User-generated content platforms face a basic tradeoff: stronger enforcement of copyright inevitably means some curtailment of legitimate users' freedom. Over the years, Ars has covered  many  cases of YouTube's copyright filters accidentally blocking public domain content or curtailing fair-use rights . At the same time, copyright holders are understandably frustrated that they have to spend so much time policing online sites for infringing copies of their content.  How does Article 13 deal with this dilemma? It basically just declares that the bad outcomes feared by critics shouldn't happen and leaves it up to member countries and technology companies to figure out how to reconcile these competing goals.  \"Cooperation between online content service providers and rightholders shall not result in the prevention of the availability of works or other subject matter uploaded by users which do not infringe copyright and related rights,\" a recent draft of the legislation states, rather optimistically.  Critics of Article 13 have argued that the legislation would force technology companies to adopt upload filers and potentially run roughshod over fair use and other user freedoms. Supporters of the legislation have countered that the legislation doesn't explicitly require anyone to adopt filtering technology.  \"There is no requirement for upload filters,\" states a Q&A drafted by the legislation's supporters . \"However, if large platforms do not come up with any innovative solutions, they may end up opting for filters.\"  \"The criticism that these sometimes filter out legitimate content may at times be valid,\" the document concedes. \"But it should be directed toward the platforms designing and implementing them, not to the legislator who is setting out a goal to be achieved.\"  Article 11: “Link tax”  Some news organizations have been frustrated to see Google and Facebook raking in billions of dollars of ad revenue while the Internet erodes the economic foundation of traditional news organizations. The organizations believe that Google and Facebook have profited from aggregating their work, and they want the technology giants to share some of those profits with the news industry.  But Google and Facebook are simply summarizing and linking to content available elsewhere on the Web—activities that are squarely within the law in both the United States and Europe. Lots of other websites and Internet users do these things on a regular basis. So if the law tries to force Google and Facebook to pay news sites for the right to link to or summarize their articles, that could undermine everyone else's right to do the same thing.  For this reason, critics of Article 11 have dubbed it a \"link tax.\" They warn that it would lead to a future in which you couldn't link to a news article without paying for the privilege of doing so.  To allay those fears, the authors of Article 11 have added language stating that the news organizations' new rights \"shall not apply to acts of hyperlinking\" and also \"shall not apply in respect of uses of individual words or very short extracts of a press publication.\"  So then what does it apply to? I asked Danny O'Brien, a critic of the law at the Electronic Frontier Foundation, about this last September.  \"What they're trying to do is prevent automatic scraping,\" he said. Google News scrapes news sites and then provides users with a Google-generated front page featuring titles and links to articles on various news sites. The goal of the legislation, O'Brien suggested, is to prevent Google from using the title of an article in Google News links. The hope is that this will convince Google to start paying European news organizations for the right to link to their news stories.  “The principle behind it is incoherent”  The legislation doesn't accomplish this goal by directly regulating scraping of news sites—and neither does it do so by explicitly banning the use of headlines in hyperlinks. Instead, the legislation gives news organizations a broad, vague right to \"the online use of their press publications by information society service providers\" (aka technology companies like Google and Facebook).  So the practical implications of Article 11 are a real head-scratcher. European nations could require technology companies to get the permission of a news organization before linking to one of its articles. Officially, this would only apply to tech companies themselves. But it's unclear what would happen if a user of a technology platform tried to post a link to a news article?  Alternatively, member countries could give news organizations such a narrow right that it would have little practical impact—Facebook and Google might be able to comply by slightly altering how they format links to news articles. Or maybe different countries will implement Article 11 in different ways, creating a hodgepodge of rules for linking to news articles in different European countries.  \"I'm sorry if I sound incoherent,\" O'Brien said after trying to explain Article 11 to me. \"It's because the principle behind it is incoherent.\"    Promoted Comments       Onigato  Smack-Fu Master, in training     jump to post    We already know how Google News is going to react if Article 11 gets passed, we saw it in Spain when their own \"News links ain't allowed no more\" law was enacted. Google News closed their Spanish branches, and Spanish news organizations lost a huge amount of traffic, literally overnight. Repeat this over the entire EU, and watch as the news orgs scream bloody murder.       9 posts | registered 2/1/2019         jack lecou  Ars Centurion     jump to post     Sarty wrote: show nested quotes Both provisions are maddeningly vague—laying out broad goals without providing much detail about how those goals can be achieved. This is partly because the EU's lawmaking system occurs in two stages. First, EU-wide institutions pass a broad directive indicating how the law should be changed. Then each of the EU's member nations translates the directive into specific laws. I just don't understand how this ever seemed like a good idea. How does it make a lick of sense to hold a vote on a binding directive without defining the binding process by which it shall be achieved? On any topic, ever? It feels like something you'd read about ancient Athens doing, back before humanity had a working understanding of how laws and government and voting probably ought to function. I don't know that's the whole directive/implementation approach is *inherently* wrongheaded. In conception, I think the idea is that it works similar to something like an RFC or standards body process. You wouldn't want the W3C (or even WHATWG) to actually mandate the particular code for a browser to use for a markup feature, for example. In fact, what you want in a standard is usually as few specifics as possible. The bare minimum to make sure that interop works, and no more. Everything else is rightly left up to the implementers, who might come up with very different approaches, working with very different code bases, very different module boundaries, in different programming languages, etc. And in general, I think that works for the EU ok too. For example, consider something like the \"price indication directive\", which just says that standardized per-unit prices should be clearly posted for consumers. The directive itself in that case can be admirably short, just laying out the justification and goals, and the basic, sensible requirements corollary to those. It makes sense to leave all the specifics beyond that up to individual member states: Bulgaria and Belgium are, after all, probably going tol have different agencies or ministries under which that type of regulation is enforced, other existing regulations about the posting of prices that the new directive implementation would be incorporated alongside, etc.  And in the end, there might end up being slight differences from country to country, but even an international chain or website shouldn't have too much trouble complying everywhere it operates. The basic information is the same everywhere, and the intent of the directive is clear enough that a good faith effort is easy to establish. But that's because the goals and mechanisms of that directive are more or less coherent, consistent, and straightforward. The problem with Articles 11 and 13 isn't so much that the directive process itself is broken, it's that the goals and mechanisms behind these specific pieces are all just mutually contradictory and ill-conceived. The whole thing amounts to telling member states to \"implement a circle such that the ratio of the circumference to the radius is equal three, but don't break any of the laws of mathematics to do so, and make sure the penalties are really high for companies that don't make such circles if they're above a certain size, etc.\".       393 posts | registered 1/12/2012                    reader comments  211  with 109 posters participating, including story author    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Timothy B. Lee Timothy is a senior reporter covering tech policy, blockchain technologies and the future of transportation. He lives in Washington DC.   Email  timothy.lee@arstechnica.com  //  Twitter  @binarybits              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}