{"author": "David Canellis", "title": "This app exposes which cryptocurrency a user is most likely to shill on Twitter", "description": "It’s a challenge to navigate the cryptocurrency space. The entire community pretty much resides within the confines of the Twitter hellscape, where differences in investment portfolios often lead to in-fighting and disinformation. This is why one ingenious software developer created a new browser extension to help the general public figure out exactly what’s going on. […]", "url": "https://thenextweb.com/hardfork/2019/03/26/twitter-cryptocurrency-shill-bias-extension-conflict-of-interest/", "urlToImage": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F03%2Fbiastwitter.jpg&signature=f02e1e285a55fece11afa21be64ebb21", "publishedAt": "2019-03-26T17:11:29Z", "content": "         TNW News   Latest  Hard Fork  Plugged  The Next Police  IoT Lab  Investing 2.0  Fundamentals     More TNW   News  Events    - TNW Conference 2019    - Hard Fork Decentralized 2018     Enterprise  Intelligence  Answers  Spaces   About TNW   About  Team  Advertise  Jobs  Contact                News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces    About  Team  Advertise  Jobs  Contact      Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.    Got it!  or More info                The TNW2019 map is here – 40,000m2 of tech festival! Check it out →              Powered by      Blockchain, cryptocurrencies, and insider stories by TNW.            Apps  Twitter  Cryptocurrency  Community  Bias  Bitcoin  Ethereum  Ripple  Conflict of interest  Data  User (computing)  Google Chrome   This app exposes which cryptocurrency a user is most likely to shill on Twitter  What's your poison: Bitcoin, Ethereum, Ripple, or Bitcoin Cash?                            Story by  David Canellis       87  Shares                It’s a challenge to navigate the cryptocurrency space. The entire community pretty much resides within the confines of the Twitter hellscape , where differences in investment portfolios often lead to in-fighting and disinformation.  This is why one ingenious software developer created a new browser extension to help the general public figure out exactly what’s going on. It’s called ‘Coinflict of Interest.’     It’s a simple add-on that presents estimates of an author’s bias towards four cryptocurrencies: Bitcoin, Ethereum, Ripple, and Bitcoin Cash.  Hmm… The idea is that the composition of someone’s Twitter following could be an indicator of their digital currency preference. If someone regularly interacts with a certain community, they could be filtering information to make it suitable for that particular audience, and thus arises the conflict of interest.  This risk is compounded within the blockchain industry, as the line between cryptocurrency pundit and venture capitalist is often blurred.  Is it always advisable to blindly trust information provided by someone who might be heavily invested in that particular technology? This is the question Coinflict of Interest is trying to help answer.  This one checks out  While this is totally cool (and sometimes hilarious), its usefulness boils down to how reliable these bias ratings really are.  “It’s just a proof-of-concept at this point, really,” creator Luke Childs told Hard Fork. “The results shouldn’t be taken too seriously. I think, in general, the results are accurate enough to be helpful. But there are quite a few anomalies and there’s plenty of room for improvement.”  Coinflict of Interest relies on another cryptocurrency project, hive.one , for community data. It’s a service that ranks the cryptocurrency crowd on their Twitter influence by measuring the amount of attention generated by tweets.  If a ton of Bitcoiners regularly interact with someone’s posts, hive.one considers that person to hold influence over those users.  Adam Back is the co-founder and CEO of Blockstream, a software firm focusing on Bitcoin-related projects , so it’s not crazy to assume Bitcoin fans regularly like, retweet and write comments about the things he says.  This one makes sense, too “I’m doing some post-processing on that data, running it through a simple algorithm to try and deduce bias from influence,” explained Childs, who then confirmed there’s currently not enough context available for the ratings to be totally accurate.  “There would need to be some sort of sentiment analysis of users tweet content to work out if they are engaging in a positive or negative manner. I would expect that to drastically improve the results,” he added.  A really neat feature of the extension is the way it shows potential biases even in the little pop-ups that appear when hovering over the profile picture of a particular user. It makes figuring out the context of a certain tweet that much simpler.  Always suspected Yessi was a big-blocker… Coinflict of Interest’s use of hive.one unfortunately means it can’t provide a reading on everyone. It can only give feedback on users featured in its borrowed influencer lists (but, you can actually sign yourself up, so no worries).  For those still keen to try it, Chrome users can grab the extension here . Firefoxers can download it here .  Even users too paranoid to simply install any add-on featured in an article on the internet are catered for (even though this one is open-source). They can build and load it directly into their browser by themselves, and instructions for how to do that are here.  Did you know? Hard Fork has its own stage at  TNW2019 , our tech conference in Amsterdam.  Check it out .  Published March 26, 2019 — 17:11 UTC               David Canellis  March 26, 2019 — 17:11 UTC     Read more        Most popular      Facebook is hiring 22 people for its secretive blockchain division          Learn to trade                        The Heart of Tech™      More TNW   News  Events  Enterprise  Intelligence  Answers  Spaces       About TNW   About  Team  Advertise  Jobs  Contact          Stay tuned    Thank you!       Weekly     Daily     Breaking         OK                  Copyright © 2006—2019.  All rights reserved.  Made with ♥ in Amsterdam.               ", "category": "technology"}