{"author": "Theodore Schleifer", "title": "Investing in Uber’s IPO means investing in Uber’s rivals", "description": "What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.", "url": "https://www.recode.net/2019/3/25/18281191/uber-careem-ipo-yandex-grab", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H443tUDOcYEJbIGApBnZQCe2SzQ=/0x0:5472x2865/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15986001/982643258.jpg.jpg", "publishedAt": "2019-03-25T21:29:51Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Uber      Transportation       Investing in Uber’s IPO means investing in Uber’s rivals   What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer @teddyschleifer   Updated Mar 26, 2019,  3:08am EDT        Share     Tweet        Share     Share  Investing in Uber’s IPO means investing in Uber’s rivals      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    A driver for Uber’s former competitor, Careem, in Saudi Arabia.  Sean Gallup/Getty Images     In a startup’s final weeks as a private company, there is a strong incentive to play it safe: no major executive departures, no last-minute strategy shifts, and no billion-dollar acquisitions. Be still, applecart.  Uber isn’t hewing to that conservatism.  The company on Tuesday announced a $3.1 billion deal to buy Careem, Uber’s principal competitor in the Middle East, which is expected to close early next year. The acquisition has leaked out over several months so it’s not a terrific surprise, but that it would announce such a deal so close to the IPO speaks to a way in which possible public market investors should evaluate Uber when they have the chance to buy or short the stock in a few weeks.  To bet on Uber — as is increasingly clear with this Careem purchase — is to bet not on Uber but on a global ride-hailing spoke model in which San Francisco-based Uber Technologies, Inc is merely the hub.  To believe in Uber is to believe in the Uber of the Middle East, Careem, 100 percent of which is now owned by Uber. It is to believe in the Uber of Russia, Yandex, 37 percent of which was owned by Uber. It is to believe in the Uber of Southeast Asia, Grab, 28 percent of which was owned by Uber. And it is to believe in the Uber of China, Didi Chuxing, 20 percent of which was owned by Uber.   Those companies, like Uber, match drivers with riders and take a cut of the booking as revenue.  Not all of these ownership positions reflect Uber’s intentionality or came from a position of strength, for what it’s worth. Its stakes in Yandex, Grab, and Didi came after bleeding billions of dollars in a battle for market share only to sell their overseas operations and retreat back to the United States. Uber has also reportedly had talks to sell its India operation to Ola (you guessed it, the Uber of India).  Uber’s market value — pitched by bankers as high as $120 billion — obviously would not be as high without its valuable stakes in those rival companies. But will those ride-hailing juggernauts fare well as standalone companies when they go public themselves? That’s a question that public market investors will be asking themselves in the next few weeks.  If not, there’s always Lyft — with a limited international footprint, no overseas stakes, and its own IPO later this week.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year    Full Q&A: Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Recode Decode               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 10. The sidebar size is short.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                 Recode Daily: Inside Apple’s push toward the services side of its business  Plus, Uber acquires a Dubai rival, Los Angeles seeks scooter company data, and Boeing updates its 737 Max-8.  By  Shirin Ghaffary                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}