{"author": "Brian Heater", "title": "EU calls for increased security, but doesn't ban Huawei 5G products", "description": "The European Union’s current approach to potential cybersecurity threats posed by Huawei 5G products is caution, but not an outright ban. The topic was the subject of new recommendations issued by the E.U. this week in response to U.S. calls to boycott the electronics giant over fears around its co…", "url": "https://techcrunch.com/2019/03/26/eu-calls-for-increased-security-but-doesnt-ban-huawei-5g-products/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/02/huawei.jpg?w=572", "publishedAt": "2019-03-26T17:23:55Z", "content": "                        EU calls for increased security, but doesn’t ban Huawei 5G products     Brian Heater   @bheater  / 10 hours         The European Union’s current approach to potential cybersecurity threats posed by Huawei 5G products is caution, but not an outright ban. The topic was the subject of new recommendations issued by the EU this week in response to U.S. calls to boycott the electronics giant over fears around its connection to the Chinese government.  The report rightly notes that coming 5G technologies will form the backbone of some of society’s most foundational elements, from banking, to transportation, health, industry and even democracies. But it stops short of suggesting a similar outright ban to the one implemented by the U.S. government.  ”5G technology will transform our economy and society and open massive opportunities for people and businesses,” European digital chief Andrus Ansip said in a statement tied to the recommendation. “But we cannot accept this happening without full security built in. It is therefore essential that 5G infrastructures in the EU are resilient and fully secure from technical or legal backdoors.”  The language certainly doesn’t close the door to an outright ban moving forward, as the EU looks to increase scrutiny around these technologies, but it does mark part of a larger trend to push back on the U.S. government’s calls for blanket bans.  Addressing a telecoms conference in Barcelona last month European digital commissioner Mariya Gabriel said Europe must have “a common approach” to the challenge of network security, warning there is a risk of fragmentation if Member States take diverging decisions “trying to protect themselves”.  She said at the time that the Commission was preparing to take steps soon — but did not speak up in favor of an outright ban, also leaving the door open to a softer approach.                        ", "category": "technology"}