{"author": "Sarah Perez", "title": "Wayfair to open its first brick-and-mortar store this fall", "description": "Another major e-commerce brand its expanding its business offline. Wayfair, the Boston-based online furniture retailer whose net revenue topped $2 billion in the fourth quarter, announced this morning it plans to open its first full-service retail store this fall. The store, which will be based in …", "url": "https://techcrunch.com/2019/03/26/wayfair-to-open-its-first-brick-and-mortar-store-this-fall/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/wayfair-sofa.png?w=762", "publishedAt": "2019-03-26T17:20:47Z", "content": "                        Wayfair to open its first brick-and-mortar store this fall     Sarah Perez   @sarahintampa  / 10 hours         Another major e-commerce brand its expanding its business offline. Wayfair, the Boston-based online furniture retailer whose net revenue topped $2 billion in the fourth quarter , announced this morning it plans to open its first full-service retail store this fall. The store, which will be based in Natick, Mass., will connect the company’s online business to the real world, allowing customers to meet with home design experts, try out the furniture in person and order home delivery of both in-store products and those from Wayfair’s website.  The company had previously operated pop-up shops in Natick, Mass. and Paramus, N.J., and it recently opened an outlet connected to its Florence, Ky. warehouse. However, these are not equivalent to the store it now has planned. But Wayfair will open four other pop-ups this summer, at yet to be announced locations, that will offer curated selections of merchandise.  The larger retail store will be located in the Natick Mall in Natick, Mass. — the same place where Wayfair ran its holiday 2018 pop-up.  Like most other furniture retailers, the new store will offer customers design assistance through complimentary consultations, where the experts may suggest recommendations ranging from home improvement projects to décor selections.  The shoppers will be able to order from the store’s product inventory, or from Wayfair’s website for home delivery.  It’s not unusual these days to see e-commerce brands pursuing an omnichannel experience, where their online site overlaps with a brick-and-mortar presence. Amazon, notably, has recently pursued this path through its Whole Foods acquisition, Amazon Books stores and Amazon Go convenience stores. Walmart and Target and other big-box retailers offer a variety of ways to shop online, pick up at the store or order home delivery with help from in-store associates.  Other e-commerce-first brands — particularly in the fashion and beauty space — also today often launch physical retail stores as a means of attracting new customers who hadn’t yet shopped their site, as well as catering to current customers through a new channel.  For example, Rent the Runway , The RealReal , Glossier , ThredUp , Allbirds, Away, ModCloth, Madison Reed and others have joined older brands like Warby Parker, Zappos and Bonobos in expanding their operations to include brick-and-mortar footprints.  While physical retail increases overhead, it does send a message to shoppers that the company is more stable than some other fly-by-night brands found only through Instagram and Facebook ads.  It also offers a way for customers to physically inspect merchandise they may not feel comfortable buying online — like clothes that require trying on for fit, makeup they want to test or — in the case of Wayfair’s furniture — a way to touch and feel the fabrics, closely inspect the build quality and visualize items alongside other design materials like fabric swatches or paint strips, for example.  “With the opening of our new retail store, we are offering our customers a new way to enjoy Wayfair’s exceptional shopping experience as we continue to transform the way people shop for their homes,” said Niraj Shah, CEO, co-founder and co-chairman, Wayfair, in a statement. “We look forward to inviting our customers further into the world of Wayfair, welcoming them to step inside our newest shopping experience guided by the knowledgeable support and expertise of our in-store design team,” Shah added.  The news comes just after Wayfair posted its biggest year-over-year revenue growth (40 percent) to date in a better than expected Q4 2018. The company also saw its active customer base jump 38 percent to 15.2 million, and orders per customer jump to 1.85 versus 1.77 in the year ago period. However, the retailer reported growing losses attributed to operating expenses, including marketing and advertising, and hiring — factors that have had some questioning the sustainability of Wayfair’s growth.  One single retail store won’t necessarily take the pressure off Wayfair’s high operating expenses , but it allows the retailer to experiment with a more traditional model and measure its impacts.  Wayfair didn’t offer an exact launch date beyond “fall 2019” or other details about the stores, like square footage, for example. It said other details will be shared closer to launch.                        ", "category": "technology"}