{"author": "Ron Amadeo", "title": "New Huawei phone has a 5x optical zoom, thanks to a periscope lens", "description": "How do you cram a 5x zoom into the P30 Pro? Just turn the whole assembly sideways!", "url": "https://arstechnica.com/gadgets/2019/03/new-huawei-phone-has-a-5x-optical-zoom-thanks-to-a-periscope-lens/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/10-760x380.jpg", "publishedAt": "2019-03-26T21:49:33+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Maybe those extra camera lenses will actually be useful now    —  New Huawei phone has a 5x optical zoom, thanks to a periscope lens  How do you cram a 5x zoom into the P30 Pro? Just turn the whole assembly sideways!    Ron Amadeo - Mar 26, 2019 9:49 pm UTC         reader comments  99  with 63 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit             Here's the camera assembly for the Huawei P30 Pro and... wait, what? Is that a square camera lens?   Huawei          That under the square cover is a mirror, which allows the whole camera assembly to be horizontal.    Huawei           This gives you an idea of just how much more room Huawei has to work with thanks to the periscope.   Huawei          There is still a camera bump.   Huawei          The front design is pretty standard. There's a notch.   Huawei          The sides of the screen are curved.   Huawei          There's no earpiece. Instead, you get a vibrating screen.   Huawei          It comes in many colors.   Huawei          Here's a crazy case option: this is for scuba diving.   Huawei          Want to really show off your P30 Pro? How about a Swarovski crystal-encrusted gift box and phone case?   Huawei       Huawei officially announced the Huawei P30 Pro smartphone today. While it has a new Huawei-made SoC, an in-screen optical fingerprint reader, and lots of other high-end features, the highlight is definitely the camera's optical zoom, which is up to a whopping 5x. Not digital zoom. Real, optical zoom.  On most high-end smartphones today, like the iPhone XS and Galaxy S10, you'll only ever get a 2X optical zoom. Usually, these exist in an entire second sensor and lens on the back of the phone, giving you a choice between the standard 1x lens or extra 2x lens. The reason you usually don't get large zoom multipliers in smartphones is because zoom lenses take space. Inside a zoom lens is a series of smaller lenses, some of which move inside the lens body to change the focal length. A larger distance between the lenses will get you a higher zoom multiplier, and on real cameras this can reach several feet long .  Space, of course, is at a premium in smartphones. Imagine a smartphone sitting face down, and you would have to fit a vertical stack of the display, the CMOS sensor, and the lens all in about an 8mm height. There is just not a lot of room.  But what if we didn't have to stack all the components vertically? The trick to Huawei's 5x optical zoom is that it uses a periscope design. From the outside, it looks like a normal camera setup, albeit with a funky square camera opening. Internally, though, the components make a 90-degree right turn after the lens cover, and the zoom lens components and CMOS sensor are arranged horizontally. Now instead of having to cram a bunch of lenses and the CMOS chip into 8mm of vertical phone space, we have acres of horizontal phone space to play with. We've seen prototypes of periscope cameras from Oppo, but as far as commercial devices go, the Huawei P30 Pro is the first.  Enlarge  / There are a whole lot of cameras on the back. Huawei / Ron Amadeo  While the optical zoom is the big new camera feature, there are four total cameras on the back of the P30 Pro. A 40MP main camera, a 20MP wide angle, the 8MP 5X telephoto, and a Time of Flight depth-sensing camera. The main 40MP camera uses a 1/1.7 inch-type sensor that, when measured diagonally, would make it 32 percent larger than the 1/2.55 inch-type sensors in the Galaxy S10 or iPhone XS. I believe the largest-ever sensor in a smartphone is still the Nokia 808 Pureview , which had a 1/1.2 inch type.  Further Reading Move over Samsung, Huawei’s foldable smartphone is an absolute stunner Huawei also made a big deal out of the new \"RYYB\" pixel layout in its camera sensor. Normally CMOS sensors are \"RGGB,\" one red pixel, two green, and one blue. By changing the green pixels to yellow, Huawei claims it can capture 40 percent more light, as the yellow filter captures green and red light. Of course, this will make the color wonky, but Huawei claims it can correct for that in software.  The front uses a pretty standard notch design featuring a single 32MP camera in the middle of the screen. The display is a 6.47 inch OLED with curved sides and a 2340×1080 resolution. An optical fingerprint reader is embedded in the display, and you won't find an earpiece anywhere, as that is embedded into the display, too. Huawei doesn't explain the feature much other than to call it \"Huawei Acoustic Display Technology,\" but judging by the video the company put out, it seems like an electromagnet vibrates the screen to produce sound.  The SoC is a Huawei-produced Kirin 980 processor. This is a 7nm chip with two Cortex-A76 based cores running at 2.6GHz, two more running at 1.92GHz, and four 1.8GHz Cortex-A55 cores. You can get a P30 Pro with 6 or 8GB of RAM, and storage options are 128GB, 265GB, or 512GB. The phone has IP68 water and dust resistance, NFC, wireless charging, 40W(!) wired charging, and a 4200mAh battery.  If you want to dive into the Huawei P30 Pro, it's out today and starts at €999 ($1,125).  Listing image by Huawei                reader comments  99  with 63 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Ron Amadeo Ron is the Reviews Editor at Ars Technica, where he specializes in Android OS and Google products. He is always on the hunt for a new gadget and loves to rip things apart to see how they work.   Email  ron@arstechnica.com  //  Twitter  @RonAmadeo              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}