{"author": "Chris Lee", "title": "A superposition of possible facts causes quantum conflict", "description": "Measurement of a measurement result leads to a disagreeable answer.", "url": "https://arstechnica.com/science/2019/03/choose-your-own-facts-in-quantum-mechanics-you-kind-of-can/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/GettyImages-836811578-760x380.jpg", "publishedAt": "2019-03-26T18:07:09+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              no privileged observers    —  A superposition of possible facts causes quantum conflict  Measurement of a measurement result leads to a disagreeable answer.    Chris Lee - Mar 26, 2019 6:07 pm UTC         Enlarge  / Eugene Wigner first came up with the thought experiment this real experiment is based on. Denver Post Inc (Photo By David Cupp/The Denver Post via Getty Images)     reader comments  88  with 56 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      “More than one reality exists” screams the headline . Cue sighs of tired dread from physicists everywhere as they wonder what otherwise bland result has been spun out of control.  In this case, though, it turns out that the paper and the underlying theory are much more interesting than that takeaway. Essentially, modern physics tells us that two observers of the same event may never agree on the result, even if they have all possible knowledge. This is already accepted as part of special relativity, but now we have experimental proof that it applies to quantum mechanics as well.   What Galileo and Einstein tell us  Let’s start with the simplest possible example of how we typically resolve conflicting measurements. I am standing on a platform and measure the speed of an approaching train to be 180km/hr. You are on the train and measure the speed of the train to be 0km/hr. We can resolve the difference by making an additional measurement on our relative speeds. Afterward, we both know that we’ve measured the speed correctly relative to our own motion.   The situation gets more complex for very fast-moving objects. Imagine a pole vaulter with a 100-meter-long pole trying to fit the entire pole into a building that is only 30 meters long. Impossible you say? Well that depends on the relative speed between the two. If the pole vaulter approaches the building at near the speed of light, an observer in the building will measure the pole to only be 20 meters long. The observer will decide that the pole was, for a very short time, contained by the building.  But the pole vaulter will measure the pole to be 100 meters long at all times and the building to be about 20 meters long. Nope, that pole doesn’t fit.   When the observers compare, the outcome is different for the pole vaulter example from the train example. An additional measurement on our relative speed can explain why the two observers see different outcomes. But nothing can tell us if the pole was ever completely in the building or not. One observer knows the pole fits in the building and one knows that it doesn’t.  The key to dealing with this discrepancy is accepting that you may not be able to resolve different measurement outcomes, and instead you have to figure out the circumstances that make a specific conclusion valid.  Quantum observers  Quantum mechanics takes this idea to a whole new level because the concept of a measurement is different. Let’s take the specific example of the polarization of a photon. We don’t need to know what the polarization is, only that it has an orientation in space (e.g, vertical, horizontal, diagonal, etc.).  For a single photon, we can’t actually measure the polarization. Instead, we can only ask: are you vertically polarized? The answer is either \"yes, I’m vertical,\" or \"no, I’m horizontal.\" The point is that I (the measurer) first make a choice of two orientations, and the photon will always be found in one of those two orientations.  Let's now say I choose to measure at 45 degrees. A vertically polarized photon, from the perspective of the measurement apparatus , is in a mixture—called a superposition state—of two polarization states: +45 degrees and -45 degrees. But once the measurement is performed, the photon has to choose one of those states. From the perspective of the measurer, we never know that the photon was in a superposition state. We only know that we measured +45 degrees.  What Wigner tells us  Now let’s complicate things even more. You are measuring a stream of photons that are in a superposition state. So every measurement has a 50-percent chance of reporting a vertical photon and a 50-percent chance of reporting a horizontal photon. You, however, are in a box and cannot report your measurements to me. Instead, I have to measure your state to discover the result of your measurement.  That means you are in a superposition state of having measured a vertical or horizontal photon, even after you have made the measurement . I can measure your state, and we end up with two sensible outcomes: you measure horizontal, and I measure you to have measured horizontal; you measure vertical and I measure you to have measured vertical.  But there are two more possibilities: you measure horizontal, but I measure you to have measured vertical, and you measure vertical, but I measure you to have measured horizontal. If the second measurement is governed by quantum mechanics, those two are just as likely to occur as the sensible outcomes. So half the time, the measurement result you obtain contradicts my measurement of your measurement.  There is nothing wrong with either measurement, and there is no calculation that we can perform to resolve the contradiction. We simply have to accept that the photon is both definitely horizontally polarized and definitely vertically polarized.   This thought experiment, first outlined by Eugene Wigner, has now been realized in a real experiment. It was a bit complicated to implement. Essentially, the experiment's researchers set up an apparatus that makes measurements on polarization that, if successful, leave a record of the measurement encoded in a second photon. Thus, between the original measurement and a new one done on the second photon, we have a simple version of the Wigner experiment.  As predicted by the theory, the setup records cases where the measurement and the measurement of the measurement disagree. Indeed, the rate of agreement/disagreement is pretty much exactly as predicted by quantum mechanics.  The conclusion, according to the researchers, is that there are no facts that do not depend on the observer. Or coarsely put, at the quantum level, you may have the option of choosing your own facts.  I don’t see this result as startling. We already know that there are no privileged observers in special relativity, so why should they exist in quantum mechanics? Indeed, the thought experiment that presented us with this dilemma told us that measurement outcomes will depend on who is doing the measuring. And now we have experimental proof that this is so.  It doesn’t say anything about reality, though.  arXiv.org , 2019, arXiv ID: 1902.05080v1 ( About the arXiv ).    Promoted Comments       TechPipeDream  Seniorius Lurkius     jump to post    My head just exploded, but I was looking in a mirror and observed it did not actually explode.       31 posts | registered 3/17/2014                    reader comments  88  with 56 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Chris Lee Chris writes for Ars Technica's science section. A physicist by day and science writer by night, he specializes in quantum physics and optics. He Lives and works in Eindhoven, the Netherlands.   Email  chris.lee@arstechnica.com              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}