{"author": "Daniel Aleksandersen", "title": "Aren’t AMP Caches committing copyright infringement?", "description": "Accelerated Mobile Pages (AMP) are specially formatted web pages that companies like Cloudflare, Google, and Microsoft copy off publishers’ websites and make available through their own AMP Cache web servers.…", "url": "https://www.ctrl.blog/entry/amp-cache-copyright", "urlToImage": "https://www.ctrl.blog/media/2d/a6/amp-copyright/544x306.png", "publishedAt": "2019-03-26T21:22:54Z", "content": "        Ctrl  blog      Topics  Archives  Follow  Tip jar  About  Search       Advertisement                Aren’t AMP Caches committing copyright infringement?     Daniel Aleksandersen    Published: 2019-03-26      Accelerated Mobile Pages (AMP) are specially formatted web pages that companies like Cloudflare, Google, and Microsoft copy off publishers’ websites and make available through their own AMP Cache web servers. There is no redistribution license agreement between the AMP Caches and the publishers, so how come AMP Caches aren’t considered copyright infringement on a massive scale?   Like the name suggest, albeit heavily disputed, the purpose of AMP is to speed up webpage delivery time and performance on high-latency mobile devices. Web publishers can either choose to specifically create AMP-formatted web pages in addition or instead of their regular web pages. Some publishing platform may create AMP variants alongside the regular web page without the knowledge of the author (the copyright holder).  Both Microsoft Bing and Google Search will auto-discover an AMP-variant of a document and link to it in their own AMP Caches instead of linking to the regular web pages on their search result pages when searching from a mobile device.  This whole process got me real curios about how this process could possibly be legal under copyright laws. Google and Microsoft are making and distributing pages, images, and other assets on a massive scale for creative works that they haven’t been expressly licensed to redistribute.   Disclaimer: I’m not a lawyer and this isn’t legal advice. This article consists of my interpretation of the copyright laws of Australia, Canada, EU, and USA and is intended for entertainment purposes.   Google have always presented AMP as a performance enhancing caching service. Normally, a transparent caching proxy service would sit somewhere in the network path between the end user and the original web server. This service has typically been deployed by internet service providers (ISPs) to cut the costs associated with connecting outside their own networks.   Exceptions for caching in copyright law  Your devices don’t redownload the site logo and other shared resources when you go from one page on a website to another. Instead, your web browser caches recently and frequently used resources like images and scripts on your device so you don’t need to go back and forth with the web server for every page you want to load.   Advertisement    In the early 2000s, copyright laws around the world were amended specifically to grant an exception for this type of transient but cost- and performance essential copying of otherwise protected creative works.  The caching exception was also extended to shared caches, like a transparent proxy cache operated by an internet service provider at the edge of their networks, that automatically cached resources on behalf of and redistributed them to many users and redistributed these files.  AMP Caches aren’t part of the normal networking path between the website publisher and the user so they’re not doing the traditional intermediary caching that network operators have done in the past. Instead, AMP Caches represent an entirely separate location where users get a copy of the cached content.  I don’t believe it was ever the intention of any lawmaker to allow for or grant the broad safe-harbor provisions allowed for by copyright laws to a service like an AMP Cache. In my understanding, lawmakers tried to grant very specific exceptions for intermediary caches but made the provisions too broad when they attempted to also make it technology neutral.    Requirements for caching safe harbor provisions  Caches and caches are vaguely defined in copyright laws. However; Australian, Canadian, European Union, and USA laws agree that the caching process must be automatic and that the caches must follow industry standards for removing and updating cached materials. AMP Caches satisfies this requirement by supporting the industry standard HTTP Cache-Control header and other related caching headers.  EU law also requires that the caching must only be done for the purpose of making communications more efficient; which is how Google have presented AMP all along.  Copyright laws require that no modifications are made to the cached creative works. Australian and Canadian copyright laws specifically grants exceptions to this requirement for changes made by an undefined technical processes. EU and USA copyright laws have no such exceptions.  AMP Caches makes a few notable optimizations and modifications to cached content . These changes performed by the AMP Caches are done to achieve high performance but it may also be stripping away their safe harbor provisions as allowed for under EU and USA copyright laws.    The implied license  An implied license in the context of copyright law is a license granted by a rights holder in the absence of an expressly written contract.  You really need to be a copyright lawyer to make any sense of the finer details of implied licenses. Most resources on implied licenses that I found on the web consists of little more than lawyers shaking their heads at the lack of an expressly written legal agreement in their place.  For the most parts, authors and publishers themselves have opted to produce AMP formatted pages with the implicit understanding that their creative works will end up in one or more AMP Caches operated by one or more companies. In knowingly doing so, they’re also supposedly granting permission for AMP Cache providers to copy and redistribute their creative works.  As a I’ve mentioned earlier, this may not always be the case as some content management systems produce AMP formatted pages automatically without the knowledge of the rights holder. Not every party will be aware of nor happy with the arrangement.    Sources   Copyright Act 1968: Compilation No. 58 , C2019C00042, 2019-01-01 , Federal Register of Legislation, Australian Government  C-42 Copyright Act , 2018-12-13 , Statutes of Canada, Justice Laws Website, Government of Canada  Copyright Law of the United States , 2016-12 , U.S. Copyright Office  Directive 2001/29/EC , 2001-05-22 , The Official Journal of the European Union, EU Parliament and EU Council  Directive 2000/31/EC , 2000-06-08 , The Official Journal of the European Union, EU Parliament and EU Council       Report errors/corrections                 Topics:   Copyright  HTTP Caching         Advertisement     Recommended articles           Giving people a choice about Accelerated Mobile Pages (AMP) versus the web            Keep a record when sourcing royalty free stock photographs for your works            Explaining the Vary HTTP response header            Cache-Control plugin for WordPress            Disclaimers for when you’re knowingly committing intellectual copyright theft            Get updates from Ctrl blog on Feedly   Follow  Join 100 followers     Feed  Twitter  Inoreader  Newsblur  Old Reader      Archive  Funding  Privacy and cookies  Website colophon     Copyright © 2006 – 2019 Daniel Aleksandersen . Hosted by Hetzner and BunnyCDN .       ", "category": "technology"}