{"author": "Natasha Lomas", "title": "Flipkart ranked highly for 'fairness' of working conditions in India gig platform study", "description": "The Oxford Internet Institute has published what it bills as the world’s first rating system for working conditions on gig economy platforms. The Fairwork academic research project is a collaboration with the International Institute of Information Technology Bangalore, the University of Cape …", "url": "https://techcrunch.com/2019/03/26/flipkart-ranked-highly-for-fairness-of-working-conditions-in-india-gig-platform-study/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2014/12/flipkart-package1.jpg?w=533", "publishedAt": "2019-03-26T18:19:10Z", "content": "                        Flipkart ranked highly for ‘fairness’ of working conditions in India gig platform study     Natasha Lomas   @riptari  / 9 hours         The Oxford Internet Institute has published what it bills as the world’s first rating system for working conditions on gig economy platforms.  The Fairwork academic research project is a collaboration with the International Institute of Information Technology Bangalore, the University of Cape Town, the University of Manchester, and the University of the Western Cape.  As the name suggests, the project focuses on conditions for workers who are being remotely managed by online platforms and their algorithms — creating a framework to score tech firms on factors like whether they pay gig economy workers the minimum wage and ensure their health and safety at work.  The two initial markets selected for piloting the rating system are India and South Africa, and the first batch of gig economy firms ranked includes a mix of delivery, ride-hailing and freelance work platforms, among others.  The plan is to update the rating yearly, and to also add gig economy platforms operating in the UK and Germany next year.  Fairness, rated  Fairwork’s gig platform scoring system measures performance per market across five standards — which are neatly condensed as: Fair pay, fair conditions, fair contracts, fair management, and fair representation.  Platforms are scored on each performance measure with a basic point and an advanced point, culminating in an overall score. (There’s more on the scoring methodology here .)  Most of the measures are self explanatory but the emphasis on fair contracts is for T&Cs to be “transparent, concise, and provided to workers in an accessible form”, with the contacting party subject to local law and identified in the contract.  While, in instances of what those behind the project dub “genuine” self-employment, terms of service must be free of clauses that “unreasonably exclude liability” on the part of the platform.  For fair management, a good rating demands a documented process and clear channel of communication through which workers can be heard; decisions can be appealed; and workers be informed of the reasons behind the decisions.  The use of any decision-making algorithms must also be transparent and result in “equitable outcomes for workers”. And there must also be identified and document policy to ensure equity in areas such as hiring and firing, while any data collection must be documented with a clear purpose and explicit informed consent.  Fair representation calls for platforms to allow workers to organize in collective bodies regardless of their employment status and be prepared to negotiate and co-operate with them.  Critical attention  Criticism of the so called ‘gig economy’ has dialled up in recent years, in Western markets especially, as the ‘flexible’ working claims platforms trumpet have attracted closer and more critical scrutiny .  Policymakers are acting on concerns that demand for casual labor is being exploited by increasingly powerful tech firms which are applying algorithms at scale while using self-serving employment classifications designed to workaround traditional labor rights so they can micromanage large-scale workforces remotely while sidestepping the costs of actually employing so many people.  Trenchant critics liken the result to a kind of modern day slavery — arguing that rights-denuded platform workers are part of a wider beaten down ‘precariat’.  A report last year by a UK MP was more nuanced but still likened the casual labor practices on UK startup Deliveroo’s food delivery platform to the kind of dual market seen in 20th century dockyards , suggesting that while the platform could work well for some gigging riders this was at the exploitative expense of others who were not preferred for jobs in the same way — with a risk of unpredictable and unstable earnings.  In recent years a number of unions have stepped up activity to support contract and casual workers used by the sector, as the number of platform workers has grown. Even as gig platforms have generally continued to deny granting collective bargaining to their ‘self-employed’ workers.  Against this backdrop there have also been a number of wildcat style ‘strikes’ by gig economy workers in the UK triggered by sudden changes to pricing policies and/or conditions, or focused more broadly on trying to move the needle on pay and working conditions .  A UK union-backed attempt to use European human rights law to challenge Deliveroo’s refusal to grant collective bargaining rights for couriers was dismissed by the High Court at the end of last year . Though the union vowed to appeal.  Regardless of that particular set-back, pressure from policymakers and the publicity from legal challenges attached to workers rights have yielded a number of improvements for gig workers in Europe, with — for example — Uber announcing it would expand free insurance products for drivers across much of the region last year . And it’s clear that scrutiny of platforms is an important lever for improving conditions for workers.  It’s with that in mind that the researchers behind Fairwork have launched their rating system.  “The Fairwork rating system shines a light on best and worst practice in the platform economy,” said Mark Graham, professor of Internet geography at the University of Oxford, commenting in a statement. “This is an area in which for too long, very few regulations have been in place to protect workers. These ratings will enable consumers to make informed choices about the platforms and services they need when ordering a cab, a takeaway or outsourcing a simple task.”  “Our hope is that our five areas of fairness will take a life of their own, and that workers, platforms and other advocates will start using them to improve the working conditions across the platform economy,” he added.  And now to those first year scores in India and South Africa…  Best and worst performers  In India, ecommerce giant Flipkart came out on top of the companies ranked, with its delivery and logistics arm eKart scoring 7/10.  Though — if it wants to get a perfect 10 — it’s still got work to do on contracts, to improve clarity and ensure they reflect the true nature of the relationship, according to the researchers’ assessment.  Flipkart also does not recognize a body that could support collective bargaining for its workers.  Three tech platforms shared the wooden spoon for the worst conditions for Indian gig workers, according to the researchers’ assessment — namely: Food delivery platform Foodpanda and ride-hailing giants Ola and Uber which scored just 2/10 apiece, fulfilling only the minimum wage criteria and failing on every other measure.  UberEats, Uber’s food delivery operation, did slightly better — scoring 3/10 in India, thanks to also offering a due process for decisions affecting workers.  While in South Africa the top scorer was white collar work platform NoSweat, which got 8/10. On the improvements front, it also could do a little more work to make its contracts fairer, and also doesn’t recognize collective bargaining.  Bottom of the list in the country is ride-hailing firm Bolt (Taxify) — which scored 4/10, hitting targets on pay and some conditions (mitigating task-specific risks), while also offering a due process for decisions affecting workers, but failing on other performance measures.  Uber didn’t do much better in South Africa either — coming in second to last, with 5/10. Though it’s notable the company does offer more protections for workers there vs those grafting on its platform in India, including mitigating task-specific risks and actively seeking to improve conditions (such as by offering insurance).  Reached for comment on its Fairwork ratings, an Uber spokesperson sent this statement:  Uber wouldn’t be what it is without drivers — they are at the heart of the Uber experience. Over the past years we have made a number of changes to offer a better experience with more support and more protection, including our Partner Injury Protection programme, new safety features and access to quality and affordable private healthcare coverage for driver-partners and their families. We will continue to work hard to earn our partners trust and ensure that their voices are heard as we take Uber forward together.  There’s clearly no one universal standard for Uber’s business where working conditions are concerned. Instead the company tunes its standard to the local regulatory climate — offering workers less where it believes it can get away with it.  That too suggests a stronger spotlight on conditions offered by gig economy platforms can help improve workers’ lot and raise standards globally.  On the improvements front the Fairwork researchers claim the project has already led to positive impacts in the two pilot markets — claiming discussions are “ongoing” with platforms in India about implementing changes in line with the principles, including with a platform that has some 450,000 workers.  Though they also point out the first-year ranking show the overwhelming majority of India’s platform workers are engaged on platforms that score below their Fairwork basic standards (with scores <5/10) — which covers more than a million gig economy workers.  In South Africa another positive development they point to is alcohol delivery platform Bottles committing to supporting the emergence of fair workers’ representation on its platform, after collaborating with the project.  The local NoSweat freelance work platform has also introduced what the researchers couch as “significant changes” in all five areas of fairness — now having a formal policy to pay over the minimum wage after workers’ costs are taken into account; a clear process to ensure clients on the platform agree to protect workers’ health and safety; and a channel and process for workers to lodge grievance about conditions.  Commenting in a statement, Wilfred Greyling, co-founder of NoSweat said the project had helped the company “formalise” the principles and incorporate them into its systems. “NoSweat Work believes firmly in a fair deal for all parties involved in any work we put out,” he said, adding that the platform is “built on people and relationships; we never hide behind faceless technology”.  This report was updated with comment from Uber                        ", "category": "technology"}