{"author": "Rani Molla", "title": "Unprofitable unicorns that had an IPO in 2018 did better than profitable ones", "description": "Public investors are doing something counterintuitive: They’re valuing unprofitable companies higher than they are profitable ones entering the stock exchange. Those are the findings from a new PitchBook report on the stock performance of unicorns. That says more about the market than the companies.", "url": "https://www.recode.net/2019/3/21/18274843/unprofitable-tech-unicorn-ipo-stock-market-profit", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RzKKAdtw5pnerYAawnNVKQRrniM=/0x0:1600x1100/fit-in/1200x630/filters:fill(ffffff)/cdn.vox-cdn.com/uploads/chorus_asset/file/15977597/export_6SO8l.png", "publishedAt": "2019-03-21T18:46:29Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Charts      IPO      Spotify       Money-losing companies that went public in 2018 did better than profitable ones   That says more about the market than the companies.  By  Rani Molla @ranimolla    Mar 21, 2019,  2:46pm EDT        Share     Tweet        Share     Share  Money-losing companies that went public in 2018 did better than profitable ones      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Javier Zarracina/Vox     Public investors are doing something counterintuitive: They’re valuing unprofitable companies higher than they are profitable ones that entered public stock exchanges last year. Those are the findings from a new PitchBook report on the stock performance of US unicorns .  The study looked at the median stock-price change for startups valued at more than a billion dollars when they went public.  For the unprofitable* ones that went public in 2018, their median stock-price growth has been 120 percent on an annualized basis, from the IPO offering price through March 12 of this year. The median decline for stocks that were profitable has been 57 percent for 2018.  DocuSign, for example, has been consistently unprofitable before and after its April 2018 IPO. It’s currently trading at about $57, well above its $29 offer price.**  In general over the past nine years, profitability has barely made a difference for performance.  A couple big caveats here: Only a couple of the 20 US unicorns that went public last year were profitable, so the sample size is very small. Also, since this data is looking at compound annual growth rates, big jumps or dives in price for first-year stocks will look more inflated than they will likely be over time. Still, the money-losing companies that dominate the sample are doing relatively well enough to show there’s a definite public appetite for them.       “In general, you’re not seeing a huge preference either way in public markets for if a company has been profitable or unprofitable at its IPO,” Cameron Stanfill, an analyst at PitchBook and the report’s author, told Recode .  That says more about the market than the companies and means that investors are prizing future growth over present profitability.  “They believe in the business model and are disregarding the current state of profitability at the IPO,” Stanfill said.  That’s the same as with some private investors and venture capitalists, who are taking these companies public in the first place. Indeed, unprofitable companies are going public at a record rate , one not seen since the dot-com bubble.  Of course, the dot-com bubble did eventually burst, so it’s difficult not to see this latest round of unprofitable IPOs as grim tidings.  However, there are a few stark differences.  Many unprofitable companies could be profitable if they switched their focus from growth to profit. Spotify has long said it could be profitable if it weren’t trying to grow . It recently became profitable for the first time , less than a year after it was listed on the stock market. Lyft — for a 2019 example — could have had a positive net last year if it didn’t spend any money on advertising or R&D. Not spending that money, however, would stop it from gaining more customers. It would also stunt the company’s dream of developing a future of driverless cars, a plan that could see Lyft taking a bigger cut of revenue.  The companies that are going public lately — basically all of which are tech or biotech companies — are also older and have more established revenue streams and business models than their dot-com counterparts. Lyft generated $2.2 billion in revenue last year, a sum unimaginable to the internet companies of the late ’90s.  Still, when a recession hits, likely within the next two years , the crowd will certainly be thinned.  “Those that are profitable will potentially be in a better position,” Stanfill said. “A company is more defensible in downturn if it’s making a profit.”  * PitchBook is looking at IPO profitability using Ebitda margins, which add back in interest, taxes, depreciation, and amortization. True profit would be lower.  ** These price changes are from the offering price through March 12, 2019. The offering price is the usually lower price institutional investors buy stock at right before it’s traded on the public market.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.                 More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.              Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.              Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.              Apple’s plan for its new TV service: Sell other people’s TV services  Apple’s TV plans, explained. (Spoiler: Apple isn’t taking on Netflix yet.)                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 22. The sidebar size is long.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}