{"author": "Gerald Lynch", "title": "New AirPods 2 launch with better battery and hands-free \"Hey Siri\" feature", "description": "Apple refines its popular true-wireless buds", "url": "https://www.techradar.com/news/new-apple-airpods-2-launch-with-better-battery-and-hands-free-hey-siri-feature", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DVYsXzvScy2VbbnLPSmTsQ-1200-80.jpg", "publishedAt": "2019-03-20T12:40:54Z", "content": "          TechRadar  The source for Tech Buying Advice      Search          RSS                   Reviews  How To  Phones  TVs  Laptops  Photography  Deals  More  Car Tech  Wearables  Tablets  Components  Audiovisual  Gaming  Computing  Downloads  News  Video  Magazine     Pro          Trending   Buying Guides   Galaxy S10   Best Laptops   Best Phones   Apple TV Plus   Best TVs    Brands  Samsung  Apple  Google  Huawei     News  Apple AirPods 2 release date, news and features  Apple AirPods 2 release date, news and features   By Nick Pino ,  Henry St Leger ,  Olivia Tambini  2019-03-20T13:13:45Z  Audio     The AirPods 2 have landed                            Shares     Image Credit: Apple     Page 1 of 2:   Apple AirPods 2 release date, news and features   Apple AirPods 2 release date, news and features    Apple AirPods 2: what's still missing?                 The long-awaited AirPods 2 are finally here, and according to Apple, they will deliver \"faster connect times, more talk time, and the convenience of hands-free Siri.\" The second generation AirPods 2 come with a standard charging case or an optional wireless charging case and are available to order on the Apple website or Apple Store app now, or from physical Apple Stores from at the end of March. Apple AirPods 2: Cut to the chase What are they? Apple's second generation true-wireless earbuds, now complete with wireless charging case options and hands-free Siri voice assistant access. When are they out? The AirPods 2 are available to buy now from the Apple website, and the Apple Store app from today (March 20), and will be available to buy in physical Apple Stores early next week. How much will they cost? The AirPods 2 cost $159 (£159/AU$249/AED 679) with a standard charging case, or $199 (/£199/AU$319/AED 829) with a wireless charging case. Customers can also buy the wireless charging case separately for $79 (£79/AU$129/AED 329), and get either of the cases engraved for free during checkout on the website or Apple Store app. They follow the roll out of a new iPad Air (2019) , iPad mini (2019) , and a brand new iMac (2019) , so the AirPods 2 represent the latest in a stream of new hardware launches from Apple. This is ahead of what we expect to be the March 25 video streaming launch event, which could to see the long-awaited arrival of a new Apple streaming service to rival Netflix. We originally expected the AirPods 2 to be significantly different form their predecessors thanks to trademark and Bluetooth SIG filings , but judging from the official press release , this doesn't seem to be the case. Read on for all the details. Best true wireless earbuds : the best truly wireless AirPod alternatives Apple AirPods review : here's how we ranked the first generation Prefer Samsung? Here's our Samsung Galaxy Buds review What's new with the AirPods 2? Despite their divisive design, the Apple AirPods sold very well – you just have to jump on public transport and see just how many of them are poking out of music fans' ears on the way to work to note they've overcome any early online ridicule. At first glance, the new AirPods 2 look very similar to the original Apple AirPods . Again, they're completely cable-free, drawing battery from a pillbox-like charging case, with stem-like protrusions from the buds. But the next-gen improvements are under the hood. First up is a newly-designed H1 chip which Apple has built specifically for the headphones. It improves connectivity pairing times, as well as the efficiency of the battery life, which Apple claims will give you 50% more hands-free talk time. The original AirPods offered five hours of use, with a total 24 hours of battery life when taking into consideration their charging case, for comparison. Image Credit: Apple Beyond battery life, the most significant addition is that of hands-free \"Hey Siri\" functionality. Pop the AirPods 2 into your ears, and you'll be able to use the voice assistant command to place calls, change songs and more – basically anything Siri can do, direct from the AirPods 2, without needing to pull your iPhone out. The AirPods 2 ship with a charging case, though Apple is also introducing a new Wireless Charging Case for the earbuds, using Qi-compatible charging mats to power the case without you having to stick a cable in. This is, presumably, in anticipation of the launch of Apple's long-awaited Air Power charging mat . The new Wireless Charging Case will also be compatible with the first-generation AirPods. As for sound quality, Apple has yet to reveal any differences between the generations. We'll update you on how the AirPods 2 sound once we've given them a listen. AirPods 2 price and availability The AirPods 2 are available now, priced at $159 / £159 / AU$249 / AED679 with the standard charging case, and $199 / £199 / AU$319 / AED829 with the new Wireless Charging Case bundled in. The Wireless Charging Case can also be bought separately for $79 / £79 / AU$129 / AED329. If you're feeling particularly swish, you can add a personal engraving to the cases at checkout on Apple.com . What didn't make the cut? Previous trademark filings suggested that the second generation AirPods would be a health and fitness device, in addition to being a pair of true wireless earbuds. Back in July 2018 Apple filed a patent for biometric sensors which would allow the AirPods 2 to take on fitness tracking capabilities like those seen in the Jabra Elite Wireless . This followed another patent filed in March , which further fuelled the rumors. But Apple hasn't made any mention of any biometric features in the new AirPods 2, so it's likely either Apple changed course over the development of the AirPods 2, or is holding some features back for another iteration further down the line. We also heard separately that the AirPods 2 would come in black and white, be both waterproof and offer active noise-cancellation. Another patent from July suggested that Apple was working on some pretty nifty tech for how the earbuds handle outside noise as well as dissipating pressure from inside the ear canal. The patent outlined a valve system that would allow sound to escape your ear canal to avoid that weird reverberating effect that occurs when you speak with earbuds in your ears. It then goes on to describe how the earbuds would handle ambient noise, using a microphone to filter in noise from the outside world so that you can remain aware of your surroundings while still hearing your music. But these rumors also don't appear to have manifested in the final product. Apple also hasn't made any mention of improved sound quality, but we will let you know how they sound as soon as we get our hands on them. One rumor that did prove to be accurate however was wireless charging and Bluetooth 5.0 - but instead of being an improved thanks to an updated W2 chip, Apple has designed a brand new H1 chip, which is made for headphones specifically. Need something now? Here are the best truly wireless AirPod alternatives around   1   2    Current page:  Apple AirPods 2 release date, news and features    Next Page  Apple AirPods 2: what's still missing?     See more Audio news           Tech deals, prizes and latest news     Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!    No spam, we promise. You can unsubscribe at any time and we'll never share your details without your permission.        Most Popular    Most Shared         1 The best laptop 2019: our pick of the 15 best laptops you can buy this year          2 Intel reveals its graphics card with these first prototype renders          3 Apple AirPods 2 vs Apple AirPods: what's the difference?          4 Apple AirPods 2 release date, news and features          5 Gmail Inbox app to shut on April 2nd          1 iPad Air (2019) review          2 Intel reveals its graphics card with these first prototype renders          3 Xiaomi Mi 9 and Redmi Note 7 launch in UAE with aggressive prices          4 The iPhone 11 could scan the veins in your face to unlock          5 Hands on: Google Stadia review          TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site .  About Us  Terms and conditions  Privacy policy  Cookies policy  Advertise with us  ©   Future US, Inc.   1390 Market St, Suite 200 , San Francisco  California  94102 .  ", "category": "technology"}