{"author": "Dieter Bohn", "title": "Apple still has a lot to prove with its new subscription services", "description": "Apple announced Apple TV Plus, Apple News Plus, an Apple credit card, and more. But why did Apple announce all this stuff at an event but ship very little of it? The company is trying to tell a new story about what it is and what it makes. You should care because the story Apple tells us and tells itself has real effects on the products it makes and its effect on culture.", "url": "https://www.theverge.com/2019/3/26/18282776/apple-tv-news-plus-subscription-services-announcement-keynote-cost-bundle", "urlToImage": "https://cdn.vox-cdn.com/thumbor/wNmR5eTqHe9ms66i4dSeDe5nHK0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15988306/apple_tv_news_verge_dbohn_00061_2.jpg", "publishedAt": "2019-03-27T02:51:19Z", "content": "                                                                           Log In or Sign Up     Log In    Sign Up              Tech     Reviews     Science     Entertainment     Video    Features    Podcasts    Newsletters    Store    More                   Tech      Video    Amazon    Apple    Facebook    Google      Microsoft    Samsung    Tesla    AI    Cars      Cybersecurity    Mobile    Policy    Privacy    Scooters     All Tech      Reviews      Phones    Laptops    Headphones    Cameras      Tablets    Smartwatches    Speakers    Drones      Accessories    This is my Next    How-to    Good Deals     More from Verge Guidebook      Science      Video    Space    NASA    SpaceX      Health    Energy    Environment     All Science      Entertainment      Film    TV    YouTube      Games    Fortnite    Books      Comics    Music     All Entertainment      Video    Features    Podcasts    Newsletters    Store   ✕                  Processor with Dieter Bohn      Apple      Featured Videos       Apple still has a lot to prove with its new subscription services     New,   4  comments      It promised, now it has to deliver  By  Dieter Bohn @backlon    Mar 26, 2019, 10:51pm EDT        Share     Tweet        Share     Share  Apple still has a lot to prove with its new subscription services      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                Processor is a weekly YouTube show that takes a deeper look at how consumer technology is changing and how we should think about our gadgets as people, not just as users. Subscribe here .    I knew Apple had lost me when the lights came up from total darkness for what felt like the 10th time to reveal Jason Momoa and Alfre Woodard.  I knew the drill by the time they showed up: instead of actually showing  something at an event called “It’s Show Time,” the actors would describe their TV show. But because the TV show was about a post-apocalyptic world where everybody has gone blind, Momoa said, “Please close your eyes. Just for a moment. Just close them. I want you to experience something. Try to think about the world this way.”  Though nobody intended it, closing your eyes and imagining a future world was an apt metaphor for nearly all of Apple’s announcements. None of these new services, save Apple News Plus, is available yet. That’s not how Apple usually does things. It’s famous for announcing a new product and then shipping it right away — or at least within the week.  Why didn’t Apple wait until it had more to release, or at least more to show ? It made for a strange vibe at the end of the keynote. The closest thing I can find to a consensus on Apple’s event is that  it  was “ weird .”  So I have an honest question: why hold the event this week, before everything was ready? I have a few ideas.  One is to simply build hype for the products it’ll release later this year. But if that’s the goal, I’m not sure how to judge success yet. (Though I will say not releasing real previews or trailers of said shows is not a great start.) The best part of the keynote was absolutely the section on Apple Arcade , where we saw much more about the games we could expect and understood how it would work and why we might want it — but again, no pricing.  Another is to give us details on these long-rumored projects. But it didn’t tell us the most important detail: pricing. Apple was troublingly quiet on the subject of how much Apple TV Plus would cost. It was even quieter on the subject of whether it would offer bundling discounts for the half-dozen-odd Apple services you’ll be able to subscribe to at the end of the year. And those discounts will be important: just ballparking each Apple service at $10 / month lands you at potentially $600 a year for the privilege of living in Apple World without bundle pricing.            One last reason to hold the announcement now is that in order to launch services like Apple TV Plus and the Apple Card, the company needs to begin doing a lot of public marketing, and it wanted to just get everything out in the open first. That’s probably true — even granting that every TV show had already been announced with a press release and the others were so heavily rumored that they were open secrets — but it’s not a great reason to hold an event for consumers.  That’s the main thing: everybody has been talking about how important subscription services are to Apple’s business, but I don’t care about how much money Apple makes (beyond it making enough to continue creating good products). Neither should you, unless you’re a major shareholder.  Instead, you should care what products Apple is making and what it’s adding to our culture through those products. When it comes to judging these products and their effect on our culture, well, we have to wait for them to ship.  It’s easy to say this is griping about having to wait for new products (it is a little of that), but go back to that original question. Why did Apple hold an event this week? Did the company tell you, as a consumer, why you should care about the things it announced?  The best answer I can come up with is this: Apple has a huge effect on technology and culture, and Apple is trying to tell a new story about what it is and what it makes. You should care because the story Apple tells us and tells itself has real effects on the products it makes and its effect on culture.  So yes, Apple makes subscription services now. But if the whole story is just “Apple can make more money now that iPhone sales have plateaued,” then none of this really matters or changes anything.            The idealistic read is that this event was about injecting another idea behind all of those subscriptions: privacy. It’s not an easy thing to build hype for, but it’s important. Is it important enough to grant yet more of your digital life to Apple lock-in? I’m less sure. I’m also not sure if the slide above really adds up to a coherent narrative about what kind of company Apple wants to be.  Tim Cook ended the keynote like he often does, by saying “At Apple, the customer is and always will be at the center of everything that we do.” I just didn’t really feel like that philosophy applied to the event itself.  In a former life, I was a TA at a university and taught a lot of freshman composition. Whenever a student turned in an essay that led with a dictionary definition of a word, I would audibly groan because I knew I was in for a slog. It is the classic sign of a paper that purports to be deeper and more insightful than it actually is. And it always led to a long edit where I had to put in a lot of effort to help the student clarify their ideas to say something genuinely original, something genuinely different from what has been said or done a thousand times before.  Here is one of the first slides that appeared in Apple’s keynote:              The Verge on YouTube Exclusive first looks at new tech, reviews, and shows like Better Worlds.   Subscribe!         In this Storystream  Apple TV Plus: the latest developments from the keynote    Apple still has a lot to prove with its new subscription services    The Apple Card is a perfect example of Apple’s post-iPhone strategy    View all 45 stories     Next Up In Tech                         Most Read                  Apple announces Apple Card credit card  Coming summer 2019              Europe’s controversial overhaul of online copyright receives final approval  The much-criticized ‘upload filter’ and ‘link tax’ will soon become law in EU nations              The Apple Card is Apple’s thinnest and lightest status symbol ever  There was one hardware announcement at Apple’s services event                 Huawei’s P30 Pro is a photographic powerhouse with a tiny notch  Huge battery, absentee bezels, and a promising new quad-camera system              All the things Apple didn’t tell us about its streaming TV service  Apple TV Plus is more mysterious than familiar                        Command Line Command Line delivers daily updates from the near-future.    email address...    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 27. The sidebar size is long.         Loading comments...            Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved          tweet     share    ", "category": "technology"}