{"author": "Kurt Wagner", "title": "Facebook employees had access to hundreds of millions of private passwords", "description": "Facebook will let you know if your password was exposed.", "url": "https://www.recode.net/2019/3/21/18275917/facebook-passwords-privacy-encryption-employees-access", "urlToImage": "https://cdn.vox-cdn.com/thumbor/3gZ-VpGtA_NOsVFV1k7BNrOZ3F0=/0x0:2625x1374/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12799431/998115102.jpg.jpg", "publishedAt": "2019-03-21T16:35:18Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Facebook      Social      Privacy       Facebook employees had access to private passwords for hundreds of millions of people   Nobody at Facebook actually did anything with your password. As far as we know.  By  Kurt Wagner    Mar 21, 2019, 12:35pm EDT        Share     Tweet        Share     Share  Facebook employees had access to private passwords for hundreds of millions of people      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Facebook CEO Mark Zuckerberg.  Drew Angerer / Getty Images     Another week, another Facebook privacy disaster.  This time, it turns out Facebook was storing the personal passwords for hundreds of millions of Facebook users unencrypted on the company servers, according to a report from the security publication Krebs on Security . That means these passwords were readable to thousands of Facebook employees, an obvious and concerning security risk.  Facebook confirmed that, yes, this was indeed the case, and Facebook discovered it in January during a “routine security review.” The company usually encrypts passwords so they aren’t viewable to hackers or other people who might have access to the servers where they are stored.  “To be clear, these passwords were never visible to anyone outside of Facebook and we have found no evidence to date that anyone internally abused or improperly accessed them,” the company wrote in a blog post .  Facebook says the issue has been resolved and it will alert “hundreds of millions” of people whose passwords were visible. Krebs on Security reported that the number of visible passwords belonged to between 200 million and 600 million users.  The misstep is just the latest for Facebook, which has played fast and loose with user privacy and data collection practices for years. Some of the company’s old policies allowed outside developers to collect Facebook user data, often without the users understanding what was happening — and in the case of Cambridge Analytica, that data was also sold outside of Facebook to a political data firm.  Numerous software bugs  led to Facebook privacy issues in 2018, and, last September, hackers stole the profile information for tens of millions of Facebook users .  Now Facebook is under investigation from multiple government agencies, including the FTC, and could face a considerable fine for its role in the Cambridge Analytica issue . It seems likely this password situation will provide regulators with yet another arrow they’ll use to try and regulate the company’s data and privacy practices.  Facebook, meanwhile, has lost the benefit of the doubt with a lot of users and regulators.  “There is nothing more important to us than protecting people’s information,” Facebook wrote on its blog.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.              Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 11. The sidebar size is medium.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}