{"author": "Nick Pino", "title": "Apple TV+ is the long-awaited video streaming service from Apple", "description": "Apple TV+ is the new video streaming service from Apple", "url": "https://www.techradar.com/news/apple-tv-plus", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aLG9RhdAC6hUznvspMUSVW-1200-80.jpg", "publishedAt": "2019-03-25T18:10:32Z", "content": "          TechRadar  The source for Tech Buying Advice      Search          RSS                   Reviews  How To  Phones  TVs  Laptops  Photography  Deals  More  Car Tech  Wearables  Tablets  Components  Audiovisual  Gaming  Computing  Downloads  News  Video  Magazine     Pro          Trending   Apple TV Plus   Buying Guides   Galaxy S10   Best Laptops   Best Phones   Best TVs    Brands  Samsung  Apple  Google  Huawei     News  Apple TV Plus release date, price info and everything you need to know  Apple TV Plus release date, price info and everything you need to know   By Nick Pino  2019-03-25T19:39:07Z  TV     Apple TV Plus is the new video-streaming service from Apple                            Shares                 At its special March event, Apple announced Apple TV Plus, a new streaming service from the maker of the iPhone and iPad that, according to its CEO Tim Cook, \"is unlike anything that's come before\". The streaming service will offer exclusive shows, movies and documentaries from acclaimed filmmakers like JJ Abrams, Steven Spielberg and M. Night Shyamalan. The launch event also saw the announcement of an Apple credit card ( Apple Card ), a magazine and news subscription service called Apple News Plus , and a gaming streaming platform called Apple Arcade – but it was the TV Plus platform that drew the most interest. Here's the full list of the first Apple TV Plus shows The service will include shows like Amazing Stories and The Morning Show, and stars like Reese Witherspoon, Steve Carell and Jason Momoa are signed up to be involved. There's even a Sesame Street spin-off show for the pre-school crowd called Helpsters. Unlike the basic package of Hulu, Apple TV Plus will be ad-free from the start, and will be available in 100-plus countries through a section of the Apple TV app. It will be available starting in autumn 2019 (September through November) on smart TVs, MacOS and iOS. Here's everything you need to know about Apple Arcade And here's all the info on Apple News Plus Cut to the chase What is it? A rival streaming service that Apple will place its own content on, among other titles. When will it be released? Autumn 2019 (September through November) How much will it cost? That's still, irritatingly, to be confirmed. In addition to Apple TV Plus, Apple introduced Apple TV Channels, which combines cable subscription services and streaming services like Amazon Prime Video into the Apple TV app. (Unfortunately, however, Apple TV Channels doesn't incorporate Netflix.) Apple TV Channels will be incorporated into the Apple TV app on iOS starting in May, and on MacOS later in the year, but will sit outside Apple TV Plus' purview. So Apple TV Plus is like Netflix? So here's where things get a bit nebulous. On stage, Cook made it very clear that Apple TV Plus isn't Netflix – at least not yet. While the service will offer original content by the boatload, Apple TV Plus won't offer licensed content – syndicated shows like The Big Bang Theory, Mr. Robot or Seinfeld. For now, you'll still have to buy those shows a la carte through iTunes or via your terrestrial cable app in Apple TV Channels. There's also the question of availability. Cook named a number of major TV manufacturers who will offer the new Apple TV app in his keynote, but never came close to mentioning all the platforms where Netflix is available, like Android TV, PC desktops and laptops, and non-Apple tablets. How much will Apple TV Plus cost? That's another mystery, as Tim Cook ended the keynote without divulging how much Apple TV Plus will set you back every month. The chances are very good, however, that the service will cost something – as talent on this scale doesn't come cheap. The silver lining to Apple creating its own content, though, is that the service could be relatively cheap – only a few dollars / pounds per month. As we know from Netflix, licensing syndicated content isn't cheap, and those contracts eventually end and must either be renewed or dropped altogether. Apple TV Plus: the launch as it happened We live -blogged the whole Apple event, and if you're wondering how Apple brought to life this new TV Plus service, here are all the details: All times US Pacific Time (PDT) 11:46 - Oprah is off, Tim is back. Looks like we're wrapping up, which is great for my fingers. This is been a long one and I've needed the toilet for a long, long time. And yep - that's it. He's done. And with no hands on reviews to be done with the services, this seems like a much easier ride for your favorite TechRadar folk. Except for the fact we'll now be noodling away at the big news, features and analysis on what's just been announced. Apart from that. 11:43 - She's making one of the biggest book clubs on the planet, Oprah and the author streamed to every device and Apple Store. To connect everyone with books, is Oprah's dream. 11.41 - Oprah has joined forces with Apple - to create meaningful ways to initiate positive change. She has two documentaries in the works - Toxic Labor (talking about the scourge and toll of sexual harassment in the workplace), and an unnamed one that focuses on mental health and how scenarios that cause problems decimate life. She wants to replace stigma with compassion and honesty... lofty goals there. 11.39 - Oprah just came on stage (possibly) clutching vouchers for cars. iPrah in the offing? She's talking about the way we all crave connections. How we want to be heard but also need to listen. If she announces the Airpower mat I'll be impressed. 11:37 - There's no word on pricing yet - that's a real shame. It's a huge part - but Tim says 'this is just a sneak peek' as he wanders back on stage. Wait, there's one more 'remarkable story teller'. 11:36 - Apple TV+ will come across all your Apple devices and smart TVs. It's an ad-free subscription service, on demand and coming this Fall with new additions every month, focusing on Apple Originals. 11:33 - Original shows and movies will be coming to the Apple+ platform. 'To brighten our day and make us think that anything is possible.' The message, again, is about quality. When will it be coming, and how much though? 11:29 - Sara Bareilles and JJ Abrams are on stage, talking about their new project: Little Voice, a romantic comedy about what's 'wonderful and transformative' about someone having to find their way through their voice. Sara is having a sing of theme tune for us now. It's a nice time to try and rest the fingers and tidy up this blog... no, she's just finished! SING MORE DO AN ENCORE PLEASE PLEASE PLEASE. Nope, it's too late. 11.26 - I'm watching Sesame Street for work. I never knew this day would come, but suddenly it's here. There's a new pre-school show called Helpsters, with a little muppet called Cody. And it's about coding! This is related to Apple's Swift Playgrounds, you just watch. 11.25 - There's a lot about worthy storytelling here. Apple has been making a big, big push about quality elements today, that there's some gravitas to everything that it's doing. AS I WRITE THAT BIG BIRD COMES ON STAGE. Thanks Apple. 11.24 - He's going to be pushing a program called Little America, with small stories from immigrants - and the directors are either immigrants or children of immigrants. 'We hope Little America will help people to understand there is no other, there is only us'. 11:20 - Kumail Nanjiani is on stage, the actor from Silicon Valley. He's just chatting about his life now, making some jokes. This is a very different Apple event, to be honest. 11.16 - Jason Momoa and Alfre Woodard are on stage to talk up the new programming where the world is blind after a virus wipes out sight and most of the human race, in 'See', a new show coming to Apple TV+. 11:15 - This trio will be the main characters in the show - the characters with which the issues are lensed. 'Shining a light on the fault lines in our society'. 11:14 - Jennifer Aniston and Reese Witherspoon are now on stage - they're doing 'The Morning Show' on Apple TV as well. An insiders view into the lives of the morning newscaster. An 'honest look' at the complex relationship between women and men. Steve Carrell just wandered late on stage. He's making jokes about not knowing whether it's his turn. 11.11 - The video is over, the audience has gone crazy to Steven Spielberg to come on stage. He likes Apple, apparently. He's, once again, talking up how important storytelling is. Spielberg is going to be resurrecting 'Amazing Stories' for Apple TV. 11:08 - The video is still going on, the normal Apple 'enchanting' video, where the world of creativity, the wonder it presents, makes the viewer want to be part of it. To want to be involved in the Apple world. 11:07 - Actors are talking about how they 'imagine' what the character would be thinking when they embody them. Thanks for that. 11:06 - Spielberg is talking about how stories are so important. 'The best stories have come to me when I least expected them.' 11:04 - The power of stories is important. 'Here at Apple we know incredible stories begin and end with the artists that create them'. We're going to meet some of them. This service is dedicated to 'the best stories ever told'. This sounds interesting... the 'art of great storytelling'. 11.03 - And here's the big news: Apple TV+. Everyone has lost their minds suddenly here. You also might need Apple TV+ if you want to watch Oprah's new book club   See more TV news           Tech deals, prizes and latest news     Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!    No spam, we promise. You can unsubscribe at any time and we'll never share your details without your permission.        Most Popular    Most Shared         1 Apple News Plus: magazine list, cost, and release date          2 Apple TV Plus release date, price info and everything you need to know          3 The best laptop 2019: our pick of the 15 best laptops you can buy this year          4 New iPhone 11 release date, price, news and leaks          5 Your next Volvo won't let you drive drunk or distracted          1 Over a million Asus laptops could have been hacked          2 3 reasons why I'm sold on the Apple Card to replace my 'dumb' credit card          3 Apple Card: release date and all we know about the new iPhone-centric credit card          4 Further details spilled on Chromium-based Edge browser – along with a download link          5 How to build your first gaming PC          TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site .  About Us  Terms and conditions  Privacy policy  Cookies policy  Advertise with us  ©   Future US, Inc.   1390 Market St, Suite 200 , San Francisco  California  94102 .  ", "category": "technology"}