{"author": "Valentina Palladino", "title": "Apple releases iOS 12.2 with support for News+ service, new AirPods [Updated]", "description": "Apple also updated macOS today to support its news and magazine service.", "url": "https://arstechnica.com/gadgets/2019/03/apple-releases-ios-12-2-with-support-for-news-service-new-airpods/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/apple-news-plus-760x380.jpg", "publishedAt": "2019-03-25T21:47:33+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              A slew of updates    —  Apple releases iOS 12.2 with support for News+ service, new AirPods [Updated]  Apple also updated macOS today to support its news and magazine service.    Valentina Palladino - Mar 25, 2019 9:47 pm UTC         Enlarge  / Apple CEO Tim Cook announcing Apple News+.     reader comments  70  with 51 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      Apple quietly pushed out a lengthy iOS software update today. While the day was largely dominated by Apple's \"It's Show Time\" event in which the iPhone maker announced news, gaming, and TV subscription services, it just released updates that will help users get settled with some of the new announcements.  Further Reading Apple News+: A newsstand of 300 glossy magazines for $9.99/month  Apple Arcade and Apple TV+ won't be available until the fall, so iOS 12.2's biggest updates revolve around Apple News+ . The company's new, $10-per-month news and magazine subscription service requires an update to the existing News app, which brings the UI for top articles and magazine issues chosen by Apple editors. The updated News app will also allow subscribers to read content offline and receive personalized recommendations based on topics that are most interesting to them.  iOS 12.2 also adds support for Apple's newest AirPods , which carry the new H1 chip that lets wearers call upon Siri without touching the AirPods first. The update also lets users summon Siri from iPhones or iPads to play any video, show, movie, sports game, or channel on their Apple TVs, essentially extending Siri's role on mobile devices as a virtual remote for the Apple TV.  While iOS 12.2 is full of small improvements, it likely won't make your iPhone or iPad look completely different. Today, we're also expecting updates to macOS with the release of macOS 10.14.4, but at the time of publishing this article, 10.14.4 is not available yet. We believe that update will bring Safari Autofilling using TouchID as well as dark-mode activation in Safari for sites that support a dark-mode setting.  Apple's full release notes for iOS 12.2 are as follows:  iOS 12.2 provides support for Apple News+, adds the ability for Siri to play videos from your iOS device to Apple TV, and includes four new Animoji. This update also includes bug fixes and improvements. Apple News+   Apple News+ is a new subscription service that extends the Apple News experience with hundreds of magazines and top newspapers  Our editors handpick top articles and magazine issues, and you also get personalized recommendations on the topics most interesting to you  Automatic downloads make it easy to read magazine issues offline  Apple News is now available in Canada, with a free experience that includes handpicked Top Stories, a personalized Today feed, and support for both English and French  Apple News+ is available in the U.S. and in Canada, with dozens of additional Canadian magazines   Siri   Ask Siri on your iPhone or iPad to play any video, show, movie, sports game, or channel on Apple TV. For example, \"Hey Siri, play Free Solo on my TV\"   Animoji   Four new Animoji—owl, boar, giraffe and shark—are included for iPhone X and later, iPad Pro 12.9-inch (3rd generation) and iPad Pro 11-inch   AirPlay   Dedicated TV controls in Control Center and on the Lock Screen give you quick access to TV controls  AirPlay multitasking for video allows you to browse other apps, as well as play other short form audio and video files locally on your device without interrupting AirPlay  AirPlay destinations are now grouped by content type, making it faster for you to find what device you want to play to   Apple Pay   Apple Pay Cash customers can now transfer money to their bank accounts instantly using their Visa debit cards  Wallet app now conveniently displays Apple Pay credit and debit transactions right below the card   Screen Time   Downtime can be configured with a different schedule for each day of the week  A new toggle enables easily turning app limits on or off temporarily   Safari   Website sign-in now occurs automatically after filling credentials with Password AutoFill  Warnings now appear when loading unencrypted webpages  Removes support for the expired Do Not Track standard to prevent potential use as a fingerprinting variable; Intelligent Tracking Prevention now protects against cross-site tracking by default  Smart Search Field queries can now be modified by tapping the arrow icon next to search suggestions   Apple Music   The Browse tab shows more editorial highlights on a single page, making it easier to discover new music, playlists, and more   AirPods   Support for new AirPods (2nd generation)   This update also includes other improvements and bug fixes. This update:   Supports Air Quality Index in Maps for US, UK, and India  Includes information in Settings on how much time remains on your device's warranty period  Supports real-time text (RTT) for phone calls made through a nearby iPhone on iPad and iPod Touch  Displays a \"5G E\" icon for iPhone 8 and later, iPad Pro 12.9-inch (3rd generation) or iPad Pro 11-inch indicating that users are in an area where AT&T's 5G Evolution network is available  Improves quality of audio recordings in Messages  Improves stability and performance of Apple TV Remote on iOS  Fixes an issue that prevented some missed calls from appearing in Notification Center  Addresses an issue where a badge notification could appear on Settings even though no action is needed  Addresses an issue in Settings > General > iPhone Storage where the storage size of some large apps, the System category, and the Other category in the storage bar graph could be incorrect  Fixes an issue that could cause Voice Memos to automatically play back recordings after connecting to a car Bluetooth device  Resolves an issue that could cause Voice Memos to temporarily prevent renaming a recording    Update, 6:53pm ET: MacOS 10.14.4 is now available as a software update. The update brings Dark Mode to Safari websites that support a dark-mode setting, as well as numerous changes to support the new Apple News+ service. Full release notes can be found on Apple's support site.                reader comments  70  with 51 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Valentina Palladino Valentina reviews consumer electronics for Ars Technica, testing all kinds of gadgets with a focus on mobile devices and wearables. She has a soft spot for Chromebooks.   Twitter  @valentinalucia              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}