{"author": "Eric Berger", "title": "It’s unfortunate NASA canceled the all-female EVA, but it’s the right decision", "description": "Yes, NASA is telling the truth.", "url": "https://arstechnica.com/science/2019/03/yes-nasa-has-canceled-an-all-female-spacewalk-no-its-not-a-conspiracy/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/iss057e134112_large-760x380.jpg", "publishedAt": "2019-03-26T13:23:39+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Spacesuit straight talk    —  It’s unfortunate NASA canceled the all-female EVA, but it’s the right decision  Yes, NASA is telling the truth.    Eric Berger - Mar 26, 2019 1:23 pm UTC         Enlarge  / NASA astronaut Anne McClain needs to use a smaller spacesuit. NASA     reader comments  162  with 85 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      NASA announced on Monday afternoon that it had canceled a plan to have astronauts Anne McClain and Christina Koch perform the agency's first all-female spacewalk on Friday. The decision follows McClain's first spacewalk outside the International Space Station, which occurred last Friday, March 22.  \"Mission managers decided to adjust the assignments, due in part to spacesuit availability on the station,\" the space agency said . \"McClain learned during her first spacewalk that a medium-size hard upper torso—essentially the shirt of the spacesuit—fits her best. Because only one medium-size torso can be made ready by Friday, March 29, Koch will wear it.\"  Astronaut Nick Hague will suit up along with Koch this Friday to replace a set of batteries outside the station that store solar power for use when the station is in the Earth's shadow. This decision to replace McClain with Hague has raised a number of questions, including some conspiracy theories that NASA is incompetent or misogynistic. Neither of these is true, although the space agency does have a problem with its spacesuit inventory and future procurement plans. Let's dig into some of the questions raised here.  Why was the EVA really canceled?  It really was a \"fit\" issue in regard to spacesuits. After her EVA (extravehicular activity) last Friday in a \"large\" spacesuit, McClain realized she would be better able to work in a suit with a medium-sized torso. The torso is a fiber-glass shell, and if it is not snug it is difficult to maneuver the suit and reach control dials on the front. (Spacesuits sometimes fit differently in microgravity than in ground tests).  Further Reading Swimming with spacemen: training for spacewalks at NASA’s giant pool  NASA has four spacesuits on the International Space Station, according to Jacklyn Kagey, lead officer for the upcoming spacewalk. Two of those suits are medium-sized, but only one is presently configured for a spacewalk (making the second one ready would require about 12 hours of work). Since Koch also uses a medium-sized suit, NASA planners decided the safest decision was to have Koch proceed in the medium suit and Hague participate in a larger suit.  Is NASA telling the truth?  Yes. I have reported on NASA to a greater or lesser extent for nearly two decades, including the space shuttle Columbia accident. In these kinds of circumstances, I have rarely found that NASA officials have lied or even shaded the truth. For the most part, we are dealing with engineers here, and they're constantly making trades on what is the most expedient and safest solution to whatever problem they're facing.  During a briefing to preview NASA's upcoming spacewalk, station Mission Operations Integration Manager Kenny Todd explained that NASA did not make a deliberate decision to have two women conduct an EVA for the first time. \"There was a lot of circumstances that got us here,\" he said. Among those circumstances was the fact that NASA had two women on orbit who were capable of fulfilling demanding EVA tasks. There are also scheduling issues—NASA has a series of spacewalks it wants to get completed now, in the lull between the recent visit from the Crew Dragon spacecraft and upcoming supply missions in April.  Further Reading SpaceX completes a historic mission, crew flight possible later in 2019  Todd recalled a scheduling discussion late in 2018 with astronaut Kate Rubins, who heads the EVA branch of the crew office. They were planning these EVAs and assessing who would be available to conduct them.  \"I don't know if it was Kate or I that kind of asked, 'Have we ever sent two women out before?'\" Todd recalled. \"Again it just wasn't something that jumped out at us because it all starts here with competence and abilities, regardless if someone is male or female. That's got to be the core of how we start something. There's nothing about this that's put together to make it look like a certain thing.\"  How hard are EVAs?  Spacewalks are physically demanding. They are dangerous due to the potential for micrometeoroid impacts and also because spacesuit problems regularly occur—there has been about one suit issue for every 10 EVAs that NASA has performed. Enlarge  / On March 22, Anne McClain works on the International Space Station's Port-4 truss structure during a 6-hour, 39-minute spacewalk. NASA  Frankly, if McClain was uncomfortable in a large spacesuit, she (and NASA) made the correct call here. Former astronaut John Grunsfeld described the physical toll of moving a bulky spacesuit (even in microgravity) around for 6.5 hours, and performing various tasks, as akin to running a marathon. Adding risk due to an overly large spacesuit would be foolish.  What about NASA's spacesuit problem?  NASA does have a spacesuit problem. A 2017 report by the agency's inspector general catalogued some of these issues. Notably, the agency's current stock of spacesuits were designed in 1974 and were first flown in 1981. \"Designed for the Space Shuttle Program, each EMU has been partially redesigned and completely refurbished multiple times over the last 40 years,\" the report stated.  Further Reading NASA inspector says agency wasted $80 million on an inferior spacesuit  Of the 18 spacesuits originally produced, 11 remain in service. Those suits are rotated up to the station, and down, and are serviced on the ground. NASA performs maintenance on each suit after six years on the station, or 25 EVAs, whichever comes first. \"We have a sustaining plan that gets us out through the remainder of the program with these particular suits,\" Todd said.  The 2017 report criticized the agency's efforts to develop a \"next generation\" of spacesuits that would be needed for activities at the Lunar Gateway, in orbit around the Moon, on the Moon, or on Mars. Part of the problem is that the destination for NASA's crewed programs has changed at least three times since 2005, and there have also been issues with stewardship. As a result, the report found, \"The agency remains years away from having a flight-ready spacesuit ... suitable for use on future exploration missions.\"  Does NASA discriminate against female astronauts?  To the best of our understanding and knowledge, the answer to this is no. Back during the Apollo program, and even during the early part of the space shuttle program, there certainly were issues with diversity at the space agency, and especially among its astronaut corps.  Further Reading Netflix film examines why NASA shunned women astronauts in early days  NASA has taken significant steps since then. The space agency has flown 45 women into space, and nine of the 20 astronaut candidates in the last two astronaut classes (2013 and 2017) were women. More than that, women have begun to take prominent roles in spaceflight. The home of NASA's astronaut corps, the Johnson Space Center, was directed by former astronaut Ellen Ochoa from 2012 to 2018.  And in 2017, Peggy Whitson , who has flown into space three times, broke the record for most time spent in space by a US astronaut with a cumulative total of 665 days in orbit aboard the International Space Station. Today, the women aren't just flying at NASA—they're helping to lead the space agency. Hopefully, we will soon reach the point where an all-female EVA does not register as newsworthy at all.                 reader comments  162  with 85 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Eric Berger Eric Berger is the senior space editor at Ars Technica, covering everything from astronomy to private space to NASA. A certified meteorologist, Eric lives in Houston.   Email  eric.berger@arstechnica.com  //  Twitter  @SciGuySpace              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}