{"author": "Josh Constine", "title": "The danger of \"I already pay for Apple News+\"", "description": "Apple doesn’t care about news, it cares about recurring revenue. That’s why publishers are crazy to jump into bed with Apple News+. They’re rendering their own subscription options unnecessary in exchange for a sliver of what Apple pays out from the mere $10 per month it charges f…", "url": "https://techcrunch.com/2019/03/26/no-need-to-subscribe/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/Apple-News-Plus.png?w=753", "publishedAt": "2019-03-26T21:55:44Z", "content": "                        The danger of ‘I already pay for Apple News+’  At the mercy of a new algorithm     Josh Constine   @JoshConstine  / 13 hours         Apple doesn’t care about news, it cares about recurring revenue. That’s why publishers are crazy to jump into bed with Apple News+. They’re rendering their own subscription options unnecessary in exchange for a sliver of what Apple pays out from the mere $10 per month it charges for unlimited reading.  The unfathomable platform risk here makes Facebook’s exploitative Instant Articles program seem toothless in comparison. On Facebook, publishers became generic providers of dumb content for the social network’s smart pipe that stole the customer relationship from content creators. But at least publishers were only giving away their free content.  Apple News+ threatens to open a massive hole in news site paywalls, allowing their best premium articles to escape. Publishers hope they’ll get exposure to new audiences. But any potential new or existing direct subscriber to a publisher will no longer be willing to pay a healthy monthly fee to occasionally access that top content while supporting the rest of the newsroom. They’ll just cherry pick what they want via News+, and Apple will shave off a few cents for the publisher while owning all the data, customer relationship and power.   “Why subscribe to that publisher? I already pay for Apple News+” should be the question haunting journalists’ nightmares. For readers, $10 per month all-you-can-eat from 300-plus publishers sounds like a great deal today. But it could accelerate the demise of some of those outlets, leaving society with fewer watchdogs and storytellers. If publishers agree to the shake hands with the devil, the dark lord will just garner more followers, making its ruinous offer more tempting.  There are so many horrifying aspects of Apple News+ for publishers, it’s best just to list each and break them down.  No relationship with the reader  To succeed, publishers need attention, data and revenue, and Apple News+ gets in the way of all three. Readers visit Apple’s app, not the outlet’s site that gives it free rein to promote conference tickets, merchandise, research reports and other money-makers. Publishers don’t get their Apple News+ readers’ email addresses for follow-up marketing, cookies for ad targeting and content personalization, or their credit card info to speed up future purchases.   At the bottom of articles, Apple News+ recommends posts by an outlet’s competitors. Readers end up without a publisher’s bookmark in their browser toolbar, app on their phone or even easy access to them from News+’s default tab. They won’t see the outlet’s curation that highlights its most important content, or develop a connection with its home screen layout. They’ll miss call-outs to follow individual reporters and chances to interact with innovative new interactive formats.  Perhaps worst of all, publishers will be thrown right back into the coliseum of attention. They’ll need to debase their voice and amp up the sensationalism of their headlines or risk their users straying an inch over to someone else. But they’ll have no control of how they’re surfaced…  At the mercy of the algorithm  Which outlets earn money on Apple News+ will be largely determined by what Apple decides to show in those first few curatorial slots on screen. At any time, Apple could decide it wants more visual photo-based content or less serious world news because it placates users even if they’re less informed. It could suddenly preference shorter takes because they keep people from bouncing out of the app, or more generic shallow-dives that won’t scare off casual readers who don’t even care about that outlet. What if Apple signs up a publisher’s biggest competitor and sends them all the attention, decimating the first outlet’s discovery while still exposing its top paywalled content for cheap access?   Remember when Facebook wanted to build the world’s personalized newspaper and delivered tons of referral traffic, then abruptly decided to favor “friends and family content” while leaving publishers to starve ? Now outlets are giving Apple News+ the same iron grip on their businesses. They might hire a ton of talent to give Apple what it wants, only for the strategy to change. The Wall Street Journal says it’s hiring 50 staffers to make content specifically for Apple News+. Those sound like some of the most precarious jobs in the business right now.  Remember when Facebook got the WSJ, Guardian and more to build “social reader apps” and then one day just shut off the virality and then shut down the whole platform ? News+ revenue will be a drop in the bucket of iPhone sales, and Apple could at any time decide it’s not thirsty any more and let News+ rot. That and the eventual realization of platform risk and loss of relationship with the reader led the majority of Facebook’s Instant Articles launch partners like The New York Times, The Washington Post and Vox to drop the format. Publishers would be wise to come to that same conclusion now before they drive any more eyeballs to News+.  News+ isn’t built for news  Apple acquired the magazine industry’s self-distribution app Texture a year ago. Now it’s trying to cram in traditional text-based news with minimal work to adapt the product. That means National Geographic and Sports Illustrated get featured billing with animated magazine covers and ways to browse the latest “issue.” News outlets get demoted far below, with no intuitive or productive way to skim between articles beyond swiping through a chronological stack.   I only see WSJ’s content below My Magazines, a massive At Home feature from Architectural Digest, a random Gadgets & Gear section of magazine articles, another huge call-out for the new issue of The Cut plus four pieces inside of it, and one more giant look at Bloomberg’s profile of Dow Chemical. That means those magazines are likely to absorb a ton of taps and engagement time before users even make it to the WSJ, which will then only score few cents per reader.  Magazines often publish big standalone features that don’t need a ton of context. News articles are part of a continuum of information that can be laid out on a publisher’s own site where they have control, but not on Apple News+. And to make articles more visually appealing, Apple strips out some of the cross-promotional recirculation, sign-up forms and commerce opportunities on which publishers depend.  Shattered subscriptions  The whole situation feels like the music industry stumbling into the disastrous iTunes download era. Musicians earned solid revenue when someone bought their whole physical album for $16 to listen to the single, then fell in love with the other songs and ended up buying merchandise or concert tickets. Then suddenly, fans could just buy the digital single for $0.99 from iTunes, form a bond with Apple instead of the artist and the whole music business fell into a depression.  Apple News+’s onerous revenue-sharing deal puts publishers in the same pickle. That occasional flagship article that’s a breakout success no longer serves as a tentpole for the rest of the subscription.  Formerly, people would need to pay $30 per month for a WSJ subscription to read that article, with the price covering the research, reporting and production of the whole newspaper. Readers felt justified paying the price because they got access to the other content, and the WSJ got to keep all the money even if people didn’t read much else or declined to even visit during the month. Now someone can pop in, read the WSJ’s best or most resource-intensive article, and the publisher effectively gets paid à la carte like with an iTunes single. Publishers will be scrounging for a cut of readers’ $10 per month, which will reportedly be divided in half by Apple’s oppressive 50 percent cut, then split between all the publishers someone reads — which will be heavily skewed towards the magazines that get the spotlight.  I’ve already had friends ask why they should keep paying if most of the WSJ is in Apple News along with tons of other publishers for a third of the price. Hardcore business news addicts that want unlimited access to the finance content that’s only available for three days in Apple News+ might keep their WSJ subscription. But anyone just in it for the highlights is likely to stop paying WSJ directly — or never start.  I’m personally concerned because TechCrunch has agreed to put its new Extra Crunch $15 per month subscription content inside Apple News+ despite all the warning signs. We’re saving some perks, like access to conference calls just for direct Extra Crunch subscribers, and perhaps a taste of EC’s written content might convince people they want the bonus features. But even more likely seems the possibility that readers would balk at paying again for just some extra perks when they already get the rest from Apple News, and many newsrooms aren’t set up to do anything but write articles.  It’s the “good enough” strategy we see across tech products playing out in news. When Instagram first launched Stories, it lacked a ton of Snapchat’s features, but it was good enough and conveniently located where people already spent their time and had their social graph. Snapchat didn’t suddenly lose all its users, but there was little reason for new users to sign up and growth plummeted.  Apple News is pre-loaded on your device, where you already have a credit card set up, and it’s bundled with lots of content, at a cheaper price than most individual news outlets. Even if it doesn’t offer unlimited, permanent access to every WSJ Pro story, Apple News+ will be good enough. And it gets better with each outlet that allies with this Borg.  But this time, good enough won’t just determine which tech giant wins. Apple News+ could decimate the revenue of a fundamental pillar of society we rely on to hold the powerful accountable. Yet to the journalists that surrender their content, Apple will have no accountability.                        ", "category": "technology"}