{"author": "Andrew Webster", "title": "Apple Arcade has game developers excited, but questions remain", "description": "Among developers of mobile games, there’s a mix of excitement and concern surrounding Apple Arcade, the company’s new Netflix-style subscription service.", "url": "https://www.theverge.com/2019/3/26/18282134/apple-arcade-game-developer-reaction-excitement-caution", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Q2Lp3NUJUFFqqYcdYouGOYAJ22c=/0x157:2400x1414/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15987400/Apple_introduces_apple_arcade_apple_tv_ipad_pro_iphone_xs_macbook_pro_03252019.jpg", "publishedAt": "2019-03-26T16:15:38Z", "content": "                                                                           Log In or Sign Up     Log In    Sign Up              Tech     Reviews     Science     Entertainment     Video    Features    Podcasts    Newsletters    Store    More                   Tech      Video    Amazon    Apple    Facebook    Google      Microsoft    Samsung    Tesla    AI    Cars      Cybersecurity    Mobile    Policy    Privacy    Scooters     All Tech      Reviews      Phones    Laptops    Headphones    Cameras      Tablets    Smartwatches    Speakers    Drones      Accessories    This is my Next    How-to    Good Deals     More from Verge Guidebook      Science      Video    Space    NASA    SpaceX      Health    Energy    Environment     All Science      Entertainment      Film    TV    YouTube      Games    Fortnite    Books      Comics    Music     All Entertainment      Video    Features    Podcasts    Newsletters    Store   ✕                  Apple      Gaming      Entertainment       Apple Arcade has game developers excited, but questions remain     New,   18  comments      By  Andrew Webster    Mar 26, 2019, 12:15pm EDT        Share     Tweet        Share     Share  Apple Arcade has game developers excited, but questions remain      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                     Yesterday, at its “show time” event in Cupertino, Apple unveiled perhaps its biggest gaming venture ever: Apple Arcade . It’s a subscription service that gets users access to a large library of games for a monthly fee, playable across iOS, Mac, and Apple TV. As the App Store and other mobile markets have become dominated by free-to-play games, often at the expense of so-called “premium” titles, this presents a potential solution. “Paid games are often critically acclaimed and beloved by the people who play them, but competing with free is hard, so even the best of these games have only reached a smaller audience,” Apple said when announcing its new service.  There’s still much we don’t know about Apple Arcade, including how much it will cost and, perhaps more crucially, how Apple will be splitting revenue with developers. (I spoke to nearly a dozen mobile game developers and publishers after yesterday’s announcement, and no one was able to discuss specifics at this time.) We do know that Apple will be helping fund the development of these games in some way, and it’s been able to lure big names like Final Fantasy mastermind Hironobu Sakaguchi and SimCity creator Will Wright. Meanwhile, the teams behind App Store hits like Monument Valley , Florence , and Alto’s Adventure are all on board as well.  For the developers I spoke to, there’s a sense of cautious optimism around Apple Arcade and gaming subscription services, in general. For Apple, the company’s focus, as always, on offering a premium service holds a lot of appeal for game creators. “I’m heartened to see Apple devoting so much energy to maintaining and improving the quality of the App Store, especially while still keeping indie games solidly in the spotlight,” says indie developer Zach Gage . But with so many questions around the service, there are a lot of potential pitfalls as well.              One of the concerns for developers is that subscriptions could eliminate a large percentage of paid game sales, though there isn’t much historical precedence to determine whether this will happen. But it’s also a problem that could be alleviated by the design of the App Store itself; during Apple’s onstage demo, Arcade had its own tab in the store alongside Today, apps, games, and search. “This means that there is a chance that Apple Arcade may become another source of revenue for game developers, as opposed to replacing the existing ecosystem,” explains Adriaan de Jongh, co-creator of Hidden Folks .  Ever since the 2017 redesign of the App Store , Apple has put a large focus on editorial curation. This has been especially important for smaller indie developers fighting against the wave of free-to-play games since being featured in the App Store has the potential to turn a relatively unknown game into a hit. Apple appears to be using a similar tactic with Apple Arcade, focusing on beautifully designed titles, often from a fairly small pool of notable mobile developers. “It’s clear the Apple has a vision for the level of quality they want to set,” says Gage, “and they’re willing to stand up for the kind of content they think matters.”  For subscribers, this is great news. It means you know most of what’s available in Apple Arcade will be a high-quality experience. But it could present problems for those less-heralded developers who are looking to break in. And de Jongh says he’s worried the service will be “out of reach” for most mobile developers. “It is now more important than ever to be in conversations with the App Store team in order to even be considered to become part of that highest tier of games on the App Store,” he says. “As a developer of smaller games, I fear I can’t keep up.”  “As a developer of smaller games, I fear I can’t keep up.”  One of the key selling points of Apple Arcade is that it will feature games you can’t play elsewhere. Apple boasts that the service will offer “over 100 new and exclusive games.” Some of those games appear to be mobile exclusives — i.e., they may be available on console or PC but not Android — much in the same way that Epic has managed to lure PC exclusives to its fledgling store . But depending on the terms of the exclusivity deals with Apple, this could be an issue for developers in the long run.  Hidden Folks , for instance, started life as a mobile game, but it was able to find new players after expanding to Steam and the Nintendo Switch. And de Jongh says the App Store still makes up nearly half of all of the game’s revenue, but other platforms are crucial. “I truly hope games funded by Apple Arcade will be able to go to other places after a short amount of time so that developers don’t shoot themselves in the foot with a quick Apple Arcade cash grab,” he says.  All that said, subscription services like Apple Arcade appear to be an inevitability. Last week, Google announced its own Stadia streaming service , Microsoft has its increasingly appealing Xbox Game Pass , Sony continues to invest in PlayStation Now, and even Nintendo offers classic games and the occasional exclusive for Switch Online subscribers. “As a company we want to be at the forefront of the market evolutions and we are convinced that subscription-based models are one of the next steps of the industry,” says Alexandre de Rochefort, CFO at mobile publisher Gameloft, which is among the first batch of Apple Arcade partners.  Sean Krankel from Oxenfree developer Night School Studios says he’s “hopeful for the emergence of subscriptions, mainly because the relationship between players and the service is so clear.” The studio has more experience with the emerging field than most; Oxenfree is available through Game Pass, and the team is working on an unannounced game for Apple Arcade.  “It’s been awesome because our game is getting played by people who might not otherwise care about story games,” Krankel says. “So far it’s all been extremely positive for us.”      In this Storystream  Apple TV Plus: the latest developments from the keynote    Apple Arcade has game developers excited, but questions remain    Apple wants to be the only tech company you trust    View all 43 stories     Next Up In Gaming                         Most Read                  Apple announces Apple Card credit card  Coming summer 2019              Europe’s controversial overhaul of online copyright receives final approval  The much-criticized ‘upload filter’ and ‘link tax’ will soon become law in EU nations              The Apple Card is Apple’s thinnest and lightest status symbol ever  There was one hardware announcement at Apple’s services event              All the things Apple didn’t tell us about its streaming TV service  Apple TV Plus is more mysterious than familiar              Apple TV Plus and the new Apple TV app, explained  It’s easy to confuse all this Apple TV stuff                        Command Line Command Line delivers daily updates from the near-future.    email address...    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 16. The sidebar size is long.         Loading comments...            Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved          tweet     share    ", "category": "technology"}