{"author": "Megan Geuss", "title": "74% of US coal plants threatened by renewables, but emissions continue to rise", "description": "In the US, coal is challenged by newer technology, but it's not happening fast enough.", "url": "https://arstechnica.com/science/2019/03/74-of-us-coal-plants-threatened-by-renewables-but-emissions-continue-to-rise/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/GettyImages-1067920352-760x380.jpg", "publishedAt": "2019-03-26T21:00:40+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              slow unseating    —  74% of US coal plants threatened by renewables, but emissions continue to rise  In the US, coal is challenged by newer technology, but it's not happening fast enough.    Megan Geuss - Mar 26, 2019 9:00 pm UTC         Enlarge  / Wind turbines spin as steam rises from the cooling towers of the Jäenschwalde coal-fired power plant. Sean Gallup/Getty Images     reader comments  47  with 31 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      The International Energy Agency (IEA) released a report on Monday saying that in 2018, \"global energy-related CO 2 emissions rose by 1.7 percent to 33 Gigatonnes.\" That's the most growth in emissions that the world has seen since 2013.  Coal use contributed to a third of the total increase, mostly from new coal-fired power plants in China and India. This is worrisome because new coal plants have a lifespan of roughly 50 years. But the consequences of climate change are already upon us, and coal's hefty emissions profile compared to other energy sources means that, globally, carbon mitigation is going to be a lot more difficult to tackle than it may look from here in the US.  Even in the US, carbon emissions grew by 3.1 percent in 2018, according to the IEA . (This closely tracks estimates by the Rhodium Group , which released a preliminary report in January saying that US carbon emissions increased by 3.4 percent in 2018.)  \"By country, China, the United States, and India together accounted for nearly 70 percent of the rise in energy demand,\" Reuters wrote .  74 percent of coal-fired power uneconomic in the US?  The numbers remind us that economics alone is likely not enough to rein in carbon emissions in the United States. Last week, the Department of Energy's Energy Information Administration (EIA) said that barring some significant and unforeseeable changes, carbon emissions from the US are likely to stay about the same through 2050 .  This estimate takes into account big carbon-cutting measures that were already on the books in many states at the end of 2018, including California's pledge to meet 100 percent of its energy needs with carbon-free electricity. (It doesn't, however, take very recent policy decisions into account, like New Mexico's similar pledge that was signed in March.)  Energy Information Administration  The projections from the EIA assume that coal will be phased out aggressively, but despite that phaseout, the EIA expects 17 percent of the nation's energy mix to come from coal-fired power in 2050.  There is some hope that the EIA's projections are overly conservative. Analyst firm Vibrant Clean Energy (VCE) and nonpartisan think tank Energy Innovation released a report (PDF) on Monday saying that 74 percent of coal-fired capacity in the US is uneconomic compared to new, local renewables. That is, the report compared the Marginal Cost of Energy (MCOE) of continuing to operate coal-fired power plants with the Levelized Cost of Energy (LCOE) of replacing that capacity with new wind or solar.  The result was that, megawatt-hour for megawatt-hour, brand-new renewable energy was cheaper than continuing to run existing coal plants 74 percent of the time. By 2025, the researchers found that 85 percent of the US coal fleet was uneconomic compared to brand new renewable energy.           VCE / Energy Innovation             VCE / Energy Innovation        So why aren't coal-fired power plants facing more retirements if they're such a bad deal to keep running compared to newer, cleaner energy? Ultimately, the cost of running a coal-fired power plant is different from the price that the owner of that power plant gets paid, and in many markets, old power plants can keep making a profit on the rates that they collect. Utility Dive notes specifically that many coal plants in the Northeast benefit from selling power on the regional grid operator's capacity market , which is a market for energy companies to sell their electricity years ahead of time.  VCE and Energy Innovation admit that simply comparing MCOE of coal and LCOE of renewable energy is not enough to determine whether a coal plant will shut down. But the firms' report says that any coal plant failing that comparison should trigger \"a wake-up call for policymakers and local stakeholders that an opportunity for productive change exists in the immediate vicinity of that plant.\"  Could batteries pick up the slack?  On Tuesday, Bloomberg New Energy Finance released a report saying that the LCOE of lithium-ion grid-scale batteries (that is, the cost of the batteries and installation divided by the amount of useable energy they'll provide over their lifetimes) has fallen 35 percent since the first half of 2018 to $187 per megawatt-hour.  Enlarge  For comparison, the VCE and Energy Innovation report that came out on Monday noted that most existing coal plants have an MCOE of $33 to $111 per megawatt-hour. If the price of batteries continues to fall as much as it did in 2018, banks of lithium-ion batteries could soon be competitive with a number of expensive but still-operational coal plants in the US. And unlike wind and solar, large banks of batteries offer dispatchable energy, which can be used regardless of whether the wind is blowing and the Sun is shining.  Still, waiting for economics to run its course and kill coal doesn't solve the problem of natural gas, which is extremely cheap and booming in the United States. Natural gas was partially responsible for the run-up in carbon emissions last year. To tackle that problem, it currently seems that policy or technology will have to intervene.                reader comments  47  with 31 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Megan Geuss Megan is a staff editor at Ars Technica. She writes breaking news and has a background in fact-checking and research.   Email  megan.geuss@arstechnica.com  //  Twitter  @MeganGeuss              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}