{"author": "Sean Gallagher", "title": "Lion Air 737 MAX crew had seconds to react, Boeing simulation finds", "description": "Boeing test pilots determine crash was unavoidable if MCAS wasn't shut down in 40 seconds.", "url": "https://arstechnica.com/information-technology/2019/03/simulations-show-lion-air-737-crew-had-little-time-to-prevent-disaster/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2018/11/1280px-Lion_Air_Boeing_737-MAX8_@CGK_2018_31333957778-760x380.jpg", "publishedAt": "2019-03-26T23:06:34+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Gone in 40 seconds    —  Lion Air 737 MAX crew had seconds to react, Boeing simulation finds  Boeing test pilots determine crash was unavoidable if MCAS wasn't shut down in 40 seconds.    Sean Gallagher - Mar 26, 2019 11:06 pm UTC         Enlarge  / A Lion Air Boeing 737 MAX 8 crashed in October 2018 because of problems with a sensor and a failure of flight control software. The crew had little time to react, data shows. PK-REN, Jakarta, Indonesia     reader comments  144  with 63 posters participating, including story author    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      In testing performed in a simulator, Boeing test pilots recreated the conditions aboard Lion Air Flight 610 when it went down in the Java Sea in October, killing 189 people. The tests showed that the crew of the 737 MAX 8 would have only had 40 seconds to respond to the Maneuvering Characteristics Augmentation System’s (MCAS’s) attempts to correct a stall that wasn’t happening before the aircraft went into an unrecoverable dive, according to a report by The New York Times . by  While the test pilots were able to correct the issue with the flip of three switches, their training on the systems far exceeded that of the Lion Air crew—and that of the similarly doomed Ethiopian Airlines Flight 302, which crashed earlier this month. The Lion Air crew was heard on cockpit voice recorders checking flight manuals in an attempt to diagnose what was going on moments before they died.  One of the controls—the electric stabilizer trim thumbswitch on the pilot’s control yoke—could temporarily reset MCAS’s control over stabilizers. The Lion Air pilots hit this switch over 24 times, buying them some time—but MCAS’ stall prevention software kicked in afterwards each time because of faulty data coming from the aircraft’s primary angle of attack sensor.  Completely disabling MCAS’ control over the aircraft’s stabilizers would be the only way to overcome that sensor failure in the current software version. That requires throwing two additional switches on the console and turning a trim wheel on the console manually to re-establish manual control.  The Lion Air crew would have had to accomplish this while dealing with a host of alerts, including differences in other sensor data between the pilot and co-pilot positions that made it unclear what the aircraft’s altitude was. As a result, the crew continued to fight MCAS’ attempts to push the nose down until the end.  Boeing is in the process of getting a software patch for MCAS ready for approval by the Federal Aviation Administration that corrects many of the problems that led to the Lion Air crash and may have contributed to the Ethiopia Airlines crash. That update is expected to be issued by the end of April, and it includes a previously optional feature that alerts air crews when the aircraft’s two angle of attack sensors are giving different information (a “disagree light”).  Piling it on  While the 737 MAX is currently prohibited from carrying commercial passengers, airlines can still fly the aircraft to ferry them to other locations. Southwest Airlines has been moving its 737 MAX aircraft to an aircraft parking facility in California.  But today, one of those aircraft had to make an emergency landing in Orlando shortly after it took off. The emergency this time wasn’t related to flight software—instead, it was because of an engine problem , according to a Southwest spokesperson.                reader comments  144  with 63 posters participating, including story author    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Sean Gallagher Sean is Ars Technica's IT and National Security Editor.  A former Navy officer, systems administrator, and network systems integrator with 20 years of IT journalism experience, he lives and works in Baltimore, Maryland.   Email  sean.gallagher@arstechnica.com  //  Twitter  @thepacketrat              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}