{"author": "Callum Booth", "title": "Huawei announces the P30 and P30 Pro – here are the beefy specs", "description": "Today in Paris, Huawei announced two new models of its photography-focused series of phones: the P30 and P30 Pro. In this piece, we’re going to look at the devices’ specs. There’ll be a hands-on coming soon and, excitingly, an in-depth analysis of the phones’ cameras. Let’s get into this! The cameras Huawei’s P-series of phones […]", "url": "https://thenextweb.com/plugged/2019/03/26/huawei-announces-p30-p30-pro-new-specs-beefy/", "urlToImage": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F03%2Fp30-header-image-temp.png&signature=fd9284b2a51130d0940cbe8c591bb88d", "publishedAt": "2019-03-26T13:56:52Z", "content": "         TNW News   Latest  Hard Fork  Plugged  The Next Police  IoT Lab  Investing 2.0  Fundamentals     More TNW   News  Events    - TNW Conference 2019    - Hard Fork Decentralized 2018     Enterprise  Intelligence  Answers  Spaces   About TNW   About  Team  Advertise  Jobs  Contact                News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces    About  Team  Advertise  Jobs  Contact      Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.    Got it!  or More info                The TNW2019 map is here – 40,000m2 of tech festival! Check it out →               Gadgets for humans            Gear  Huawei  Huawei  P30  P30 Pro  Camera  Random-access memory   Huawei announces the P30 and P30 Pro – here are the beefy specs  A whole lotta cameras                            Story by  Callum Booth       83  Shares                Today in Paris, Huawei announced two new models of its photography-focused series of phones: the P30 and P30 Pro. In this piece, we’re going to look at the devices’ specs. There’ll be a hands-on coming soon and, excitingly, an in-depth analysis of the phones’ cameras.  Let’s get into this!     The cameras  Huawei’s P-series of phones is known for its cameras, and the P30 and P30 Pro are no exception. The entry-level phone has three cameras, while the premium version has four.  The P30 Pro   40 MP, f/1.6 wide angle lens   20 MP, ultra-wide angle lens  8 MP, f/3.4 5x telephoto lens  ToF (time-of-flight) depth-sensing camera  409,600 ISO   The P30   40MP, f/1.8 wide angle lens  16MP, f/2.2 ultra-wide angle lens  8MP, f/2.4 telephoto lens  204,800 ISO   Chips, RAM and storage  Each phone will come with a Kirin 980 chipset.  The P30 Pro   This starts with 8GB of RAM and 128GB of storage  Other options will include 8/256GB and 8/512GB   The P30   This device has 6GB of RAM and 128 GB of regular storage    Displays, battery, and charging  Both phones have a “waterdrop” notch that holds the selfie camera, this will be 32MP. The phones also have an in-display fingerprint scanner.  The P30 Pro   6.47-inch curved OLED display  This has a 4,200mAh battery  And will support 40W fast charging   The P30   6.1-inch OLED display  The entry-level model will have a slightly smaller 3,650mAh batter  Supports 22.5W fast charging   Other things!  Both the P30 and P30 Pro will come in five variants, check ’em out here:   When it comes to water and dust resistance, the P30 Pro is IP68-certified, while the P30 was given an IP53 rating. You can find more info about the IP system here.  We’ll have more pieces on Huawei‘s P30 and P30 Pro coming soon, so make sure to keep an eye on Plugged .   TNW Conference 2019 is coming! Check out our glorious new location, inspiring lineup of speakers and activities, and how to be a part of this annual tech bonanza by clicking here .  For more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard .  Published March 26, 2019 — 13:56 UTC               Callum Booth  March 26, 2019 — 13:56 UTC     Read more        Most popular      Xiaomi’s new 100W charger will charge your phone in just 17 minutes                            The Heart of Tech™      More TNW   News  Events  Enterprise  Intelligence  Answers  Spaces       About TNW   About  Team  Advertise  Jobs  Contact          Stay tuned    Thank you!       Weekly     Daily     Breaking         OK                  Copyright © 2006—2019.  All rights reserved.  Made with ♥ in Amsterdam.              ", "category": "technology"}