{"author": "Connie Loizos", "title": "Former NEA partner Jon Sakoda takes the wraps off his new, Cisco-backed venture fund, Decibel", "description": "Jon Sakoda needed to decompress, he says. The founder-turned-venture investor had logged a dozen years with the investing heavyweight New Enterprise Associates after selling his last startup to Symantec in 2006, and what he wanted by last summer was more time with his kids, and less time with his p…", "url": "https://techcrunch.com/2019/03/26/former-nea-partner-jon-sakoda-takes-the-wraps-off-his-new-cisco-backed-venture-fund-decibel/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/Chris-Conroy-Photography-5926.jpg?w=609", "publishedAt": "2019-03-27T00:28:18Z", "content": "                        Former NEA partner Jon Sakoda takes the wraps off his new, Cisco-backed venture fund, Decibel     Connie Loizos   @Cookie  / 11 hours         Jon Sakoda needed to decompress, he says. The founder-turned-venture investor had logged a dozen years with the investing heavyweight New Enterprise Associates after selling his last startup to Symantec in 2006. And what he wanted by last summer was more time with his kids and less time with his phone, so he turned it off for three weeks.  “I can’t recommend it enough,” says Sakoda, who has since returned to work and is today taking the wraps off his new venture firm, Decibel , a term sometimes used to describe exponential changes in the power of sounds or signals sent through a network, and one that speaks to the “exponential power” of the firm’s network, says its new website.  While it’s tempting to poke fun at this claim, it appears from the outside to be true. Though Sakoda is the sole founding partner of Decibel — he says he’s looking to add investing professionals right now — not only does Decibel have the benefit of his extensive connections in Silicon Valley; it’s also majority backed by Cisco, the network gear maker that’s aggressively transforming itself into more of a software-focused company.  That translates into reach. Though Sakoda declines to comment on the exact size of Cisco’s investment or the fund’s overall composition, citing SEC restrictions, he tells us he’s working very collaboratively with the company, including its corporate venture arm, Cisco Investments.  He’s also working with some of the many founders to be swept into Cisco over the years via its brisk M&A strategy. For example, one of these, Jon Oberheide, a founder who sold his company, Duo Security, to Cisco for more than $2 billion last year, is currently working with one of Decibel’s portfolio companies already as an advisor.  Put into context, Oberheide is helping with half of Decibel’s portfolio, which includes the three-year-old, Vancouver-based cybersecurity startup CMD , which last month closed on $15 million in funding led by GV. (It’s this team that Oberheide is helping.) Decibel has also backed Blameless , a developer of software for site reliability engineers that announced $20 million in funding just last week led by Lightspeed Venture Partners.  Sakoda says more deals are in the works, and he explains that what he’s shopping for has little overlap with Cisco today but could eventually be a strategic fit for the corporate giant. For example, though Sakoda was involved in funding Snap on behalf of NEA, he says it’s not so likely he’ll be shopping for e-commerce or media startups for Decibel.  Absent these areas, though Sakoda suggests that anything goes as long as the company isn’t too far along.  “We’re really going to be looking for startups trying to find product market fit and help with how to grow,” he explains. “If a company has lots of revenue and is already scaling, it’s probably too late for us.”  It makes a kind of sense, considering that Decibel itself has a ways to go to establish itself. Though an earlier SEC filing suggests the fund is targeting $500 million , a pool that will be structured like a traditional venture fund (“investments, personnel, and fund governance is all independent” from Cisco, says Sakoda),  and though Decibel already has plans to write checks of between $5 million and $15 million to seed- and Series A-stage companies, ask Sakoda where the firm is based, and he’ll laughingly tell you he doesn’t quite know.  Though Decibel has (and takes advantage of) access to Cisco’s many offices, including six in San Francisco alone, Sakoda says he hasn’t “quite figured that out — yet. I’m working on it.”                        ", "category": "technology"}