{"author": "Taylor Hatmaker", "title": "FAA proposal aims to 'streamline' regulations for future space launches", "description": "On Tuesday, the FAA and Department of Transportation published a proposal that greases the wheels for the commercial space industry, long bound by outdated regulations that were not created with a modern vision of private spaceflight in mind. Last May, the Trump administration signaled its intentio…", "url": "https://techcrunch.com/2019/03/26/faa-space-launch-rule-dot-reentry-licensing/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/01/spacexcrs11-launch.jpg?w=606", "publishedAt": "2019-03-26T20:49:11Z", "content": "                        FAA proposal aims to ‘streamline’ regulations for future space launches     Taylor Hatmaker   @tayhatmaker  / 15 hours         On Tuesday, the FAA and Department of Transportation published a proposal that greases the wheels for the commercial space industry, long bound by outdated regulations that were not created with a modern vision of private spaceflight in mind.  Last May, the Trump administration signaled its intention to ease commercial spaceflight regulations with Space Policy Directive 2 . That directive called on Transportation Secretary Elaine Chao to “release a new regulatory system for managing launch and re-entry activity.” That system, released in draft form today, seeks to pave the way for an “industry that is undergoing incredible transformation with regulations that have failed to keep up.”  With less than a year of turnaround time, the FAA and DOT produced a document detailing “ Streamlined Launch and Reentry Licensing Requirements ” that will govern commercial space activity. As the document states:  This rulemaking would streamline and increase flexibility in the FAA’s commercial space launch and reentry regulations, and remove obsolete requirements. This action would consolidate and revise multiple regulatory parts and apply a single set of licensing and safety regulations across several types of operations and vehicles. The proposed rule would describe the requirements to obtain a vehicle operator license, the safety requirements, and the terms and conditions of a vehicle operator license.  “These rules will maintain safety, simplify the licensing process, enable innovation, and reduce costs to help our country remain a leader in commercial space launches,” Chao said of the 580-page document, embedded in full below.   View this document on Scribd  The new regulatory guidance comes on the same day that Vice President Mike Pence declared that U.S. astronauts must return to the moon again within the next five years “by any means necessary.” That considerably hastened schedule would upend NASA’s existing timeline for a U.S. return to the moon at 2028 at the soonest.   Trump wants to send astronauts to the Moon on the way to Mars                         ", "category": "technology"}