{"author": "James Peckham", "title": "Best smartwatch 2019: the top wearables you can buy today", "description": "The absolute best smartwatches for your wrist", "url": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uABJ7W87vLt8mGfdyupjaB-1200-80.jpg", "publishedAt": "2019-03-26T11:31:03Z", "content": "          TechRadar  The source for Tech Buying Advice      Search          RSS                   Reviews  How To  Phones  TVs  Laptops  Photography  Deals  More  Car Tech  Wearables  Tablets  Components  Audiovisual  Gaming  Computing  Downloads  News  Video  Magazine     Pro          Trending   Buying Guides   Galaxy S10   Best Laptops   Best Phones   Apple TV Plus   Best TVs    Brands  Samsung  Apple  Google  Huawei     News  Best smartwatch 2019: the top wearables you can buy today  Best smartwatch 2019: the top wearables you can buy today   By James Peckham  2019-03-26T11:31:03Z  Wearables     The absolute best smartwatches for your wrist                            Shares                 A smartwatch is the ultimate phone accessory. It can tell the time, of course, but it can also beam important notifications straight to your wrist, track your fitness stats and pay for your morning coffee. Today's best smartwatch models can perform a ton of tricks, such as enabling you to search the internet with your voice, track your location with GPS or even monitor your heart rate to protect your overall health. Oh, and some of them look absolutely stunning too. If you're thinking that a smartwatch is a pointlessly geeky accessory... think again. The choices we've ranked below are well-made, powerful and can genuinely make you fitter through some smart nudges. What's big in March? The latest big name smartwatch is the Fitbit Versa Lite , which is a cheaper version of a smartwatch included in our list below. Baselworld 2019 also saw some new hybrid watches and new styles of existing watches, although none of them are likely to break into this list. We've tested the vast majority of the top-end wearables you can buy right now from the Apple Watch to Fitbits, Garmin trackers to Tizen-sporting Samsung smartwatches. There's also Wear OS (you may have known that in its previous incarnation called Android Wear) which is Google's own wearable operating system. During our review process, we take into account the design, features, battery life, spec, price and more for each smartwatch, rank it against the competition and enter it into the list you'll find below. Smartwatches come and go from the ranking depending on the rest of the competition at the time, and bear in mind we may see products like the Samsung Galaxy Watch Active ,  Fossil Sport and Honor Watch Magic appear in the list after we've tested them properly. It looks like 2019 is set to be a big year in the wearables space too, so expect lots of change in this list if we hear official announcements for products like the Google Pixel Watch and the Apple Watch 5 . On a budget? Our guide to the best cheap smartwatches Looking for something active? Check out our list of the best fitness trackers Have an iPhone? We have a guide for the best smartwatches for iPhone There's also our selection of the best Wear OS watches Want traditional looks? Our guide on the best hybrid smartwatch Image 1 of 5 Image credit: TechRadar Image 2 of 5 Image credit: Samsung Image 3 of 5 Image credit: Samsung Image 4 of 5 Image credit: TechRadar Image 5 of 5 Image credit: TechRadar 1. Samsung Galaxy Watch The sporty Samsung watch gains some style OS: Tizen OS | Compatibility: Android, iOS | Display: 1.2\" or 1.3\" 360 x 360 Super AMOLED | Processor: Dual-core 1.15GHz | Band sizes: 22mm or 20mm | Onboard storage: 4GB | Battery duration: 4 days on 46mm / less on 42mm | Charging method: Wireless | IP rating: 50m | Connectivity: Wi-Fi, Bluetooth Low Stock $249.97  View at Amazon $299.99 View at Dell Small Business See all prices (57 found) ? 384 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Impressive battery life Useful rotating bezel Annoying charger Bixby isn't great Our best smartwatch you can buy right now is from Samsung, and instead of opting for the expected Gear S4 name it's called the Galaxy Watch . Following on from the Gear S3 series and the Gear Sport in 2017, the Galaxy Watch is much improved. We've tested out the larger 46mm version of the watch and it comes with a phenomenal four day battery life even when you're using it extensively. That's impressive considering a lot of other watches on this list last a day or so from a single charge. The rotating bezel remains a highlight of navigating around the Tizen OS on the watch, and the interface is one of the easiest to pick up that we've seen on a smartwatch. Apps available on the watch are more limited than Wear OS or watchOS - two rival smartwatch operating systems - but it still offers the core basics and Samsung had provided a watch that's good at fitness as well as sporting a great design and lots more functionality too. Read the full Samsung Galaxy Watch review What's next? It's not strictly a sequel to the Samsung Galaxy Watch, but the company has just unveiled its new Galaxy Watch Active . It's a sportier version without the rotatable bezel, plus the price is lower than Samsung's last smartwatch. Image 1 of 3 Image credit: Apple Image 2 of 3 Image credit: TechRadar Image 3 of 3 Image Credit: Apple 2. Apple Watch 4 The best Apple Watch money can buy OS: watchOS 5 | Compatibility: iOS | Display: 1.78\" OLED | Processor: Apple S4 | Band sizes: Varies based on watch size | Onboard storage: 16GB | Battery: 1 to 2 days | Charging method: Wireless | IP rating: Water-resistant to 50m | Connectivity: Wi-Fi, Bluetooth, NFC, LTE $384  View at Amazon $399 View at Walmart See all prices (327 found) ? 232 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Larger display Lightweight design Battery isn't amazing Still pricey Coming in a close second, the Apple Watch Series 4 is our second favorite smartwatch you can buy right now. This is the first time Apple has updated the design of its smartwatch line, and it looks all the better for it. You get a much bigger screen with the choice of 40mm or 44mm watch sizes, there's a wider display (which is still bright and clear) as well as all the rest of the tech we've come to expect from the Apple Watch. The speaker on this watch is louder than before, the design is still lightweight (yet it feels premium) and you can use all your existing Apple Watch straps with this latest generation too. The most exciting tech is the fact there's an ECG feature within the heart rate tracker. It can test your heart to see if you're at a high risk of atrial fibrillation, which will allow you to seek help earlier if your health is in danger. This tech isn't present at launch, and right now we only know it'll be available in the US. I's not an upgrade relevant to everyone, but for some people this could be some life changing tech. There are still tons of fitness features and the latest watchOS 5 apps onboard so you'll likely love this smartwatch. The Apple Watch 4 is our favorite watch you can use with an iPhone (this won't work with Android devices), but it's just been pipped to the title of best overall smartwatch. Read the full Apple Watch 4 review What's next? The Apple Watch 4 was announced and released in September 2018, and we don't expect to see the Apple Watch 5 until the same month this year. Image 1 of 5 Image credit: Mobvoi Image 2 of 5 Image credit: Mobvoi Image 3 of 5 Image credit: TechRadar Image 4 of 5 Image credit: TechRadar Image 5 of 5 Image credit: TechRadar 3. TicWatch E2 A fully-loaded Wear OS watch you’ve never heard of OS: Wear OS | Compatibility: Android 4.3+, iOS 8+ | Display: 1.39\" 400 x 400 OLED | Processor: Snapdragon Wear 2100 | Onboard storage: 4GB | Battery duration: Around 48h | Charging method: Magnetic connecting pin | IP rating: IP67 | Connectivity: Wi-Fi, Bluetooth 4.1 $159.99  View at Amazon $159.99 View at Amazon Check Walmart See all prices (3 found) ? Affordable price Easily two day battery life No NFC for payments Bland design One of the cheapest devices on this list, the TicWatch E2 is from a relatively small brand called Mobvoi but it has made a big splash with its latest couple of smartwatches. The E2 is waterproof, comes with great battery life and it's all available for an affordable price. You probably won't fall in love with the design of this watch - it's not particularly premium - but we like the look considering how much it costs. For health, the watch comes with built-in GPS, an accurate heart rate sensor and sleep tracking. All of the fitness features you'd expect are here, but make sure you note that it won't be able to do contactless payments as there's no NFC onboard. Read the full TicWatch E2 review Image 1 of 5 Image credit: Fitbit Image 2 of 5 Image credit: TechRadar Image 3 of 5 Image credit: Fitbit Image 4 of 5 Image credit: TechRadar Image 5 of 5 Image credit: Fitbit 4. Fitbit Versa A smaller and cheaper Fitbit Ionic OS: Fitbit OS | Compatibility: Android, iOS | Display: TBC, 1000 nits | Processor: Dual-core 1.0GHz | Onboard storage: 2.5GB | Battery duration: 3-4 days | Charging method: Proprietary charger | IP rating: 50M water resistant | Connectivity: Wi-Fi, Bluetooth $199.95  View at Amazon $229.95 View at Dell See all prices (80 found) ? 4 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Lightweight design Relatively low price No GPS Feels a little cheap and childish Fitbit is one of the biggest names in fitness tracking tech, but until late in 2017 the company hadn't gone anywhere near smartwatches. The company has now released two smartwatches, and both feature on this list but first we're starting with our favorite that was announced in March 2018. That favorite from Fitbit is the Versa that is a touch smaller than the other one (that's the Ionic) but it comes with Fitbit Pay for contactless payments, 2.5GB of storage for music and battery life that'll last around three days. It doesn't have GPS for tracking your runs and the design doesn't feel as premium as some of the other watches on this list, but we really like the Fitbit Versa and it's one of the more affordable choices on this list. Read the full Fitbit Versa review What's next? The new Fitbit Versa Lite was announced on March 6. It's a cheaper alternative to the watch we've just spoken about above, and we're hoping to have a review underway soon. Image 1 of 5 Image credit: Mobvoi Image 2 of 5 Image credit: Mobvoi Image 3 of 5 Image credit: Mobvoi Image 4 of 5 Image credit: Mobvoi Image 5 of 5 Image credit: Mobvoi 5. TicWatch Pro The watch with two screens OS: Wear OS | Compatibility: Android 4.3+, iOS 8+ | Display: 1.4\" 400 x 400 OLED paired with LCD screen | Processor: Qualcomm Snapdragon Wear 2100 | Onboard storage: 4GB | Battery duration: Up to 48h, 5 extra days in Essential mode | Charging method: Magnetic connecting pin | IP rating: IP68 | Connectivity: Wi-Fi, Bluetooth 4.1, NFC $249.99  View at Amazon Check Walmart See all prices (2 found) ? 494 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Innovative screen tech Premium design Limited app No LTE features One of our favorite Wear OS watches is the TicWatch Pro , which you can use with either an iPhone or with your Android phone. You may not have heard of TicWatch before, but the latest from the company it a top-end watch with a unique dual-screen feature. There are two displays on this watch - one layered on top of the other. On the top is a transparent LCD display that can display the time, your heart rate and more when the battery is low. Below that is a bright and bold full color OLED screen that will give you all of the benefits of Wear OS. That means you can have a normal smartwatch, which we found would last around two days, and then have the time and some other features still available when your battery is running low. Plus the low power mode also lasts for a whole 30 days too. In terms of smartwatch features there's GPS, NFC for Google Pay, Bluetooth for listening to music and the top Qualcomm Snapdragon Wear 2100 chipset in here running the watch as well. Then there's the price, which undercuts a lot of the other watches on this list. Read the full TicWatch Pro review Image 1 of 5 Image credit: Apple Image 2 of 5 Image credit: Apple Image 3 of 5 Image credit: TechRadar Image 4 of 5 Image credit: TechRadar Image 5 of 5 Image credit: TechRadar 6. Apple Watch 3 2017's best smartwatch is now cheaper OS: watchOS 5 | Compatibility: iOS | Display: 1.53\" OLED | Processor: S2 dual-core | Onboard storage: 8GB / 16GB (Non-LTE and LTE respectively) | Battery duration: 18 hours | Charging method: Wireless | IP rating: IPX7 | Connectivity: Wi-Fi, Bluetooth, NFC Low Stock $254.99  View at Walmart Marketplace $299 View at Walmart See all prices (162 found) ? 122 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Brilliant fitness tracking Non-LTE version much better value LTE is an unnecessary expense Battery too short for sleep tracking The Apple Watch 3 (or Apple Watch Series 3, if you're picky) was the best smartwatch but has recently been bumped off the top spot and down a few places since the launch of the Apple Watch 4. The Apple Watch 3 is essentially just the Apple Watch 2 frame with some new innards... but they make a big difference. Plus the price has recently dropped, making this a much more attractive proposition. The LTE connection is the headline event, although that's not really as useful as some might hope - plus it costs a lot more to use, and drains the battery. What we like is the non-LTE version, which is a lot cheaper, and offers all the smarts of the Watch 2 but with a longer battery life and faster speeds when flicking through apps. It's still water-resistant so you can swim with it and you won't have to worry about getting it wet in the rain when you're out for a jog. There's GPS onboard to make running that little bit easier plus it you can now upgrade to watchOS 5 too. Read the full Apple Watch 3 review Image 1 of 5 Image credit: Mobvoi Image 2 of 5 Image credit: TechRadar Image 3 of 5 Image credit: TechRadar Image 4 of 5 Image credit: TechRadar Image 5 of 5 Image credit: TechRadar 7. TicWatch S2 Remarkably similar to the E2 OS: Wear OS | Compatibility: Android 4.3+, iOS 8+ | Display: 1.39\" 400 x 400 OLED | Processor: Snapdragon Wear 2100 | Onboard storage: 4GB | Battery duration: Around 48h | Charging method: Magnetic connecting pin | IP rating: IP67 | Connectivity: Wi-Fi, Bluetooth 4.1 $179.99  View at Amazon $179.99 View at Amazon Check Walmart See all prices (3 found) ? 2 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Affordable Waterproof design Lacks NFC No LTE variant Another TicWatch is here in this list, and this one is remarkably similar to the TicWatch E2. In fact, the spec is almost exactly the same but the S in the name of this version stands for 'Sport'. Rather than extra fitness features, the reason for the S2 is to offer you a more durable design that may be applicable to anyone looking for an adventure watch. It's made of military grade materials, which is something the E2 doesn't offer. Everything else is here, including the affordable price point although it is a touch more expensive than the watch listed earlier in this ranking. There's built-in GPS, a waterproof design and the latest Wear OS software to play with. There's no NFC here, so you won't be able to use Google Pay on this watch and there's no LTE option but considering the low price those are unlikely to be things you'll miss much. Read the full TicWatch S2 review Image 1 of 3 Image credit: Misfit Image 2 of 3 Image credit: Misfit Image 3 of 3 Image credit: TechRadar 8. Misfit Vapor 2 A revamped watch from the fitness experts Compatibility: Android, iOS | Display: 1.2-inch or 1.4-inch display, 360 x 360 AMOLED | Processor: Dual-core 1.0GHz | Band sizes: 20mm straps | Onboard storage: 4GB | Battery duration: A day | Charging method: Proprietary | IP rating: N/A | Connectivity: Wi-Fi, Bluetooth, GPS $249.99  View at Amazon $249.99 View at Amazon See all prices (2 found) ? Affordable price NFC for Google Pay No LTE option Kind of flimsy The second attempt at a smartwatch from Misfit has gone down even better than the first. This watch is designed to sit somewhere in between a premium, fashionable smartwatch and a must-have for fitness lovers. It doesn't do either of those things perfectly, and instead does both quite well. It's a good looking watch that doesn't cost the same amount as some of the more expensive Wear OS watches you can buy. It is sporting the older Snapdragon 2100 chipset, but it features built-in GPS, NFC for Google Pay and a variety of other features that may make you want it. Read the full Misfit Vapor 2 review Image 1 of 5 Image credit: Fitbit Image 2 of 5 Image credit: Fitbit Image 3 of 5 Image credit: Fitbit Image 4 of 5 Image credit: TechRadar Image 5 of 5 Image credit: TechRadar 9. Fitbit Ionic The fitness brand's first big smartwatch play OS: Fitbit OS | Compatibility: Android, iOS | Display: TBC, 1000 nits | Processor: Dual-core 1.0GHz | Band sizes: Large | Onboard storage: 2.5GB | Battery duration: 2-3 days | Charging method: Proprietary charger | IP rating: 50M water resistant | Connectivity: Wi-Fi, Bluetooth $229.98  View at Amazon $269.95 View at Walmart See all prices (36 found) ? 4 Amazon customer reviews ☆ ☆ ☆ ☆ ☆ Bright display Variety of fitness options Slow interface Severe lack of apps The Fitbit Ionic was always going to be a tough move for the brand, trying to enter the world of smartwatches from fitness bands. The effort succeeds in some places: namely fitness, as you might imagine, where you can track all manner of things, from running to weight lifting to swimming. There's also dedicated bodyweight coaching sessions in there, and you can pay for items on the go using Fitbit Pay. When it first launched, the price was super high and it was a bit too expensive to wholeheartedly recommend. The good news is the price seems to have dropped in recent months so you can get it for at least $70/£70 cheaper than the RRP. If you're a Fitbit fan looking to do more than you get on an average band, this is a nice option. Read the full Fitbit Ionic review What's next? Rumors about a new Ionic are few and far between, but we've put together a guide on what we want to be improved if it releases a Fitbit Ionic 2 . Image 1 of 3 Image credit: Mobvoi Image 2 of 3 Image credit: TechRadar Image 3 of 3 Image credit: TechRadar 10. TicWatch C2 Another TicWatch to round off the list Compatibility: Android, iOS | Display: 1.3-inch 360 x 360 AMOLED | Processor: Dual-core 1.0GHz | Band sizes: 20mm or 18mm straps | Onboard storage: 4GB | Battery duration: A day | Charging method: Proprietary | IP rating: IP68 | Connectivity: Wi-Fi, Bluetooth, GPS $199.99  View at Amazon Check Walmart See all prices (2 found) ? Low price Google Pay and GPS Limited straps Outdated internals This isn't the greatest TicWatch you can buy - there's already three other devices from the manufacturer Mobvoi on this list - but instead it's an option if you're looking for a more premium device than the TicWatch E or S but don't want to opt for the Pro. The TicWatch C2 comes with a more high-end design than those two cheaper watches, but it doesn't cost as much as the TicWatch Pro. That makes it a solid Wear OS choice if you want a watch that looks good on your wrist with a few fitness features mixed in for good measure. You can't currently buy the watch without a leather band, which is a little bit odd but if you're happy with that or you don't mind buying another third-party strap, this could be a good smartwatch choice for you. Read the full TicWatch C2 review Looking for a watch to pair with your iPhone? Try our full list of the best Ready to buy your new smartwatch? Here are the best deals for our list ? Low Stock Samsung Galaxy Watch 46mm Bluetooth $249.97 View See all prices Apple Watch 4 $384 View See all prices Mobvoi Ticwatch E2 $159.99 View See all prices Fitbit Versa $127.69 View See all prices Mobvoi Ticwatch Pro $249.99 View See all prices Apple Watch Series 3 $196.19 View See all prices Mobvoi Ticwatch S2 $179.99 View See all prices Misfit Vapor 2 $249.99 View See all prices Fitbit Ionic $194.89 View See all prices Mobvoi Ticwatch C2 $199.99 View See all prices We check over 130 million products every day for the best prices View All Deals Photo illustration: TechRadar; Misfit; Mobvoi; Apple; Fitbit; Samsung    See more Wearables news           Tech deals, prizes and latest news     Get the best tech deals, reviews, product advice, competitions, unmissable tech news and more!    No spam, we promise. You can unsubscribe at any time and we'll never share your details without your permission.        Most Popular    Most Shared         1 Apple News Plus: magazine list, cost, and release date          2 Apple TV Plus release date, price info and everything you need to know          3 The best laptop 2019: our pick of the 15 best laptops you can buy this year          4 New iPhone 11 release date, price, news and leaks          5 Your next Volvo won't let you drive drunk or distracted          1 Apple Card: release date and all we know about the new iPhone-centric credit card          2 Over a million Asus laptops could have been hacked          3 Further details spilled on Chromium-based Edge browser – along with a download link          4 Huawei P30 Pro price and release date leak, and official renders posted          5 How to build your first gaming PC          TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site .  About Us  Terms and conditions  Privacy policy  Cookies policy  Advertise with us  ©   Future US, Inc.   1390 Market St, Suite 200 , San Francisco  California  94102 .  ", "category": "technology"}