{"author": "Peter Bright", "title": "HTML email reborn, as Google brings AMP to your inbox", "description": "With AMP embeds, email can now contain rich interactivity, not just text and pictures.", "url": "https://arstechnica.com/gadgets/2019/03/google-brings-amp-to-email-turning-your-inbox-into-an-app/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/lightning-760x380.jpg", "publishedAt": "2019-03-26T20:42:56+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              It's electrifying    —  HTML email reborn, as Google brings AMP to your inbox  With AMP embeds, email can now contain rich interactivity, not just text and pictures.    Peter Bright - Mar 26, 2019 8:42 pm UTC         Enlarge  / Lightning bolts have currents from 5,000 up to perhaps as many as 200,000 amps. John Fowler / Flickr     reader comments  114  with 88 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      Google is bringing AMP, its cut-down version of HTML, to email. Starting today, Gmail on the Web will be able to support embedded AMP content, with support rolling out to mobile clients later. Gmail will also be joined by Outlook.com, Yahoo Mail, and Mail.Ru, with their respective developers promising to add support soon.  AMP for email isn't just a warmed-over version of email with HTML formatting. The embedded AMP content will be able to offer features such as interactivity without having to click away from your inbox. For example, an online store could send you an email about a product or promotion you're likely to be interested in, and the AMP embed could allow scrolling through pictures of the products and even initiate the purchasing process. Or Pinterest could email you a selection of the day's popular items and you could pin them directly from your inbox.  Accelerated Mobile Pages were introduced by Google in 2015 as a narrow set of HTML, JavaScript, and CSS capabilities that produced pages that are fast to download and render, could easily be packaged together, and were amenable to being embedded in, for example, Google search results pages. JavaScript features were limited to those offered by a Google-supplied library. This greatly curtails the range of things that pages can do in favor of being extremely cache-friendly and having consistently good performance.   /wp-content/uploads/2019/03/ezgif-2-7ed55c47bf0d.mp4  AMP was met with some resistance at its introduction. Web developers questioned Google's approach—its JavaScript library is used to define special tags rather than using conventional HTML—as well as the need for a specific, narrowly defined format to achieve good performance. Some of these concerns have been mediated by Google's plan to build AMP on Web standards and introduce a new governance model that ceded control to a pair of committees. Sitting on those committees would be representatives from across both the technology and the content publishing industries.  Those limitations are arguably what enable AMP's interactivity in email. It would be dangerous to support the browser's full, unrestricted range of JavaScript capabilities in an HTML email, but that same danger doesn't exist for an AMP email, because the JavaScript library is carefully controlled and limited. AMP emails can't perform arbitrary scripting; instead, they opt into certain prepackaged pieces of behavior that they want to use.                reader comments  114  with 88 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Peter Bright Peter is Technology Editor at Ars. He covers Microsoft, programming and software development, Web technology and browsers, and security. He is based in Brooklyn, NY.   Email  peter.bright@arstechnica.com  //  Twitter  @drpizza              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                       ", "category": "technology"}