{"author": "Matthew Hughes", "title": "Mozilla just launched an Android password manager", "description": "It’s no secret that Mozilla is trying to distinguish itself from its competitors by heavily focusing on privacy and security. The latest salvo in that effort is Firefox Lockbox for ...", "url": "https://thenextweb.com/apps/2019/03/26/mozilla-just-launched-an-android-password-manager/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F03%2FFx_Blog_Lockbox_for_Android-1.jpg&signature=7c325e3bb2689ee0d0007a32d06da281", "publishedAt": "2019-03-26T19:12:57Z", "content": "                                                                                  News  Events   Index  TQ  Deals  Answers  TNW X     News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces     Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.    Got it!  or More info                          Sections   Latest  Insights  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0     About TNW   About Team Advertise Jobs Contact   TNW Sites   News Conference Hard Fork Decentralized Index TQ Deals Answers Cyberspace Culture        The TNW2019 map is here – 40,000m2 of tech festival! Check it out →             Mozilla just launched an Android password manager    by Matthew Hughes — in Apps            66  shares                                                      It’s no secret that Mozilla is trying to distinguish itself from its competitors by focusing heavily on privacy and security. The latest salvo in that effort is Firefox Lockbox for Android , which promises to securely and privately store passwords, while ensuring people remain logged in to their favorite apps and services. But does the world need another password manager?       TNW Conference is coming up in Amsterdam  You should definitely be there   See why    Maybe. What Firefox Lockbox does well compared to other password managers is the initial setup process, which is designed to be as painless as possible.  Once you’ve installed the app, it automatically copies over your passwords from Firefox, saving you time that would otherwise be spent manually typing them in one-by-one. Another advantage of this is that you know they’ll work, as they’re the same passwords as those saved in your phone’s autocomplete.  Once you’ve copied them over, you can subsequently access them in plaintext by using your phone’s fingerprint reader, or with facial recognition. And as a plus, it connects to the desktop version of Firefox, saving you from duplicated effort. According to Mozilla, credentials are protected with 256-bit encryption.  Firefox Lockbox is available to download now from Google Play . iPhone fans will be glad to know that there’s an iOS version, which Mozilla says has been downloaded 50,000 times so far. You can grab that here .   Android Apps Mozilla       Share on Facebook (0)      Share on Twitter (66)             Most popular      1   European Parliament votes ‘yes’ on controversial Copyright Reform     Már Másson Maack            2   Inside GitHub’s fight to protect devs from EU’s disastrous Copyright Reform     Már Másson Maack            3   Apple announces Apple Card, a titanium credit card that aims to revolutionize payments     Rachel Kaser            4   Facebook is hiring 22 people for its secretive blockchain division     Matthew Beedham            5   Xiaomi's new 100W charger will charge your phone in just 17 minutes     Ivan Mehta             Never miss out  Stay tuned with our weekly recap of what’s hot & cool by our CEO Boris .     T h a n k  y o u !          Do it     Join over 260,000 subscribers!    Who's Hiring Add your company         Latest      1   Bethesda's games are going back to Steam, Epic gets snubbed     Rachel Kaser            2   This app exposes which cryptocurrency a user is most likely to shill on Twitter     David Canellis            3   Here’s how to exhibit your startup for free at TNW2019     Ailsa Sherrington            4   Blizzard tweaks loot boxes in Heroes of the Storm amid gambling controversy     Rachel Kaser            5   CERN’s new study brings us closer to understanding antimatter and why we exist     The Conversation                               Events  About  Team  Advertise  Jobs  Contact        © 2006–2019 The Next Web B.V.  Made with ♥ in Amsterdam.  Powered by        Stay tuned     Treat yourself  Sit back and let the hottest tech news come to you by the magic of electronic mail.    T h a n k  y o u !          Sign up     Prefer to get the news as it happens? Follow us on social media.       1.76M followers         1M likes           Help us out     Who are you?  Got two minutes to spare? We'd love to know a bit more about our readers.  Start!   All data collected in the survey is anonymous.                                                          ↑  ↓ Navigate up/down   Enter Go to article   / Search new term   Esc Close search  ", "category": "technology"}