{"author": "Nicole Lee", "title": "Apple News+ has issues, but it's a great deal for casual readers", "description": "You can't beat that price.", "url": "https://www.engadget.com/2019/03/26/apple-news-plus-hands-on/?utm_campaign=homepage&amp;utm_medium=internal&amp;utm_source=dl", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D1800%252C1058%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C940%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2019-03%252F86b26900-4fcd-11e9-b52b-3b36eeb9b89b%26client%3Da1acac3e1b3290917d92%26signature%3Dfbea0890a90d95f84640f3a7f84e523db0358f7a&client=amp-blogside-v2&signature=311e01c88b0d27ce0977fa35c4f5f23a2287cdf1", "publishedAt": "2019-03-26T14:45:00Z", "content": "                                               Login                        Home        Gear        Gaming        Entertainment        Tomorrow        The Buyer's Guide        Video        Reviews                                      Log in        Sign up                                                                 Show More Results                               3 related articles                                      Login                            'Moons of Madness' blends Lovecraft with 'Dead Space'             macOS update adds support for Apple's News+ subscription service             ASUS releases fix for ShadowHammer malware attack                   Latest in Gear               UPS launches a drone 'airline' to deliver medical samples       24m ago  View             Google wants to bring local news back to underserved cities       46m ago  View             Uber's Ride Pass brings discounts to 20 more cities       1h ago  View             Huawei is working on a series of stylish smart glasses       2h ago  View             Image credit: Apple                       Save                                                Apple News+ has issues, but it's a great deal for casual readers  $9.99 for over 300 periodicals is a bargain.           Nicole Lee , @nicole  5h ago\n          in Personal Computing          Comments      88  Shares             Share              Tweet              Share              Save                         Apple                         Yesterday, Apple unveiled Apple News+ , an all-you-can-eat subscription service that offers access to over 300 different magazines and periodicals, including newspapers like the Wall Street Journal and the Los Angeles Times, for $9.99 a month. I already subscribe to a couple of other Apple services like iCloud and Apple Music that are a little bit underwhelming, so I'll admit I'm a bit wary of getting another one. But for a magazine lover like myself, News+ sounded incredibly intriguing.            I had liked iOS's Newsstand before that went away, so I was interested to see if Apple News+ would offer a better experience. Importantly, I wondered if subscribing to News+ would lead me to cancelling my existing magazine subscriptions. After trying it out for a few hours, my answer is... not really. Yet, I'll likely subscribe to News+ all the same. As mentioned in Apple's presentation, News+ is (unsurprisingly) an extension of the existing News app, and not an app of its own. It also requires iOS 12.2, so be sure to upgrade if you want to try it out. News+ is available on the MacOS News app as well, as long as you update to 10.14.4. When you launch the News app on iOS, you'll see the free news portion in the main \"Today\" home screen, along with a new \"News+\" option in the bottom row. On the MacOS app, the \"News+\" option sits underneath the \"Today\" on the left sidebar. Select that, and you'll see some information about what News+ offers. You can then sign up for the service right on the spot. The first month is free, but Apple will start charging you $9.99 a month once the free trial is over. Once you have that squared away, you'll see the News+ homescreen, which is comprised of a selection of your favorite magazines at the top (this section will be empty if you are new to News+), followed by several sections -- First Look and featured stories are human-curated, while stories from categories like \"Health\" and \"Travel\" are based more on your personal preference (it defaults to a curated list on your first time, but you can customize it by \"following\" different topics in the app). Along the top are navigation buttons for browsing the magazine catalog, either in its entirety or via specific genres like Business & Finance or Entertainment. I have to admit, I was impressed with this semi-curated experience. What really sells it for me is that I had instant access to all of the magazine articles on the home screen with just a tap. I could immediately select and read full stories from sources as varied as Rolling Stone , National Geographic , Vanity Fair and the Wall Street Journal without having to endure long loading times, which is sometimes the case with magazine-specific apps. In a way, by collecting all of these stories on the News+ homepage, Apple had created a Franken-zine of sorts of all my different interests. I can see how this could be attractive for casual magazine readers who prefer a buffet-style approach to media consumption. If you do want full access to certain magazines, News+ offers that too. Tap a particular magazine title, for example, and you'll see the most recent cover along with a table of contents. If you tap the magazine title again at the top, you'll be brought to a general overview page where you can access a whole year's worth of back issues as well (Which is good if you happen to miss a particular issue). Also on this page are the publication's latest headlines, which includes stories that are online-only and not available in the print version (at least, not yet). Some publications also offer links to online video, which, again, is obviously not available in print. This is all well and good, but what is the experience of actually reading these magazine stories, especially on my tiny little iPhone? I'll have to admit this is where I was the most skeptical. In Newsstand, for example, it often felt as if some magazines were just PDF scans of the print version, which is just hell to read on a small device. I was pleasantly surprised, however, to find that this was not necessarily the case with News+. Though Wired , Vanity Fair and the New Yorker had their own distinctive fonts and styles, each story was given the full-screen treatment, and looked like they were designed to fit on the iPhone's display. News+ also lets you increase the font size, just in case the text is too small for you. The same look and feel carries over to the MacOS side too. There are a few caveats though. For one thing, you'll still get ads. Yes, Apple made a big deal that there's no ad tracking in News+, but that doesn't mean the magazines won't have ads. Of course, you can easily bypass them by going straight to a story from the table of contents, but not so much if you were to flip through a magazine's pages ( Dwell , for example, had me flip through 10 pages of ads before I got to the editor's letter). Plus, there are certain magazine layouts that just aren't suited to the single-story treatment. Domino , for example, has catalog-style pages with various furniture and accessory recommendations that is heavy on images. On the iPhone, they look very much like PDF scans that I have to zoom in and out of to read properly. This is more the responsibility of the publication and not the News+ app, but it does put a damper on the experience. Even on the MacOS app, I found the experience to be pretty clunky and less than satisfactory. Perhaps there are simply some magazine formats that work better in print than in digital. There also appears to be some confusion over whether a News+ subscription offers you full access to certain publications. Apparently the Wall Street Journal sent a memo stating the News+ app would only contain a curated collection of its stories. It turns out, however, that this is wrong: a News+ subscription does provide full access to the Wall Street Journal , but general news interest stories are floated to the top more than others. If you want stories on other topics, you'll have to search for them (you can find this feature in the Following tab of the app), which might be a pain for some. The subscription also only allows for three days worth of archives. What's more, it seems that an Apple News+ subscription stands on its own. Just because you can read the New Yorker on Apple News+, for example, doesn't mean you now have unlimited access to New Yorker articles on the web. It appears that, at least for now, if you want full digital access to a certain publication, you'll still need to subscribe to it separately. Not to mention, a lot of periodicals actually offer a combined print and digital rate for the same price. Wired for example is $5 a year for both the print and digital packages (that works out to just under $0.42 a month). If you still want the option for print magazines, this is certainly a more attractive deal. Plus, magazine prices vary wildly, and what's a good deal for one person, may not be for another. If the only magazine you care about is Wired , for example, then an Apple News+ subscription won't make much sense. On the other hand, if you don't want to spend the $40 a month for a WSJ subscription, then the $10 a month for News+ is a big saving. It's also worth mentioning Kindle Unlimited, which many have posited might prove to be a potential rival to News+. For $10 a month, Kindle Unlimited subscribers get access to a rotating selection of over a million books and audiobooks, as well as \"top magazine issues.\" The problem with Kindle Unlimited, however, is that it's not a real magazine subscription, since the magazine selection changes every month. The issues also take a long time to download, and the layout appears to mostly be PDF scans, which isn't ideal. Readly, another $10 a month magazine subscription app, has a similar problem with PDF scan layouts that are hard to read on a small screen. In the end, I was pleasantly surprised by how much I liked the News+ app experience. I liked that most of the stories I read seem tailor-made for the smaller iPhone screen, and that the News+ app offered me access to online-only stories and formats. What I especially liked was the curated home screen that provides access to a whole array of different magazine stories in one fell swoop. Plus, it offers some of my favorite periodicals in their full form, while letting me sample from others without additional cost. All of that is reason enough for me to keep my $10 a month News+ subscription going. Yet, it's still not quite enough for me to give up my existing subscriptions. For one thing, I have a subscription to the New York Times , which isn't available on News+ at all. I also want to be able to read Wired and New Yorker stories on the web, so I can access them regardless of what computer I'm using. Additionally, I appreciate that these two magazines offer a companion print subscription for the same price. I like the option of kicking back and casually leafing through them on the weekends, when I want a break from the constant barrage of technology. There's just something about flipping through a large, glossy magazine that can't quite be replicated on a backlit screen. Still, I'm not completely tied to physical media, and am willing to give it up for the right price and service. News+ could very well allow for web access in the future, and maybe it'll add the New York Times or the Washington Post too. If so, that could be enough to persuade me to cancel my other subscriptions. Until then, however, I guess I'll cough up for yet another Apple service.          Follow all of the news news from Apple’s March event here!             In this article:  apple , applemarch2019 , applenews , applenews+ , entertainment , gear , internet , mobile , personal computing , personalcomputing              By Nicole Lee  @nicole    Raised in the tropics of Malaysia, Nicole arrived in the United States in search of love, happiness and ubiquitous broadband. That last one is still a dream, but two out of three isn't bad. Her love for words and technology reached a fever pitch in San Francisco, where she learned you could make a living writing about gadgets, video games and the internet. Truly, a dream come true. Other interests include baseball, coffee, cooking and chasing after her precocious little cat.     88  Shares             Share              Tweet              Share              Save                        Comments       Sign In                              24m                  24m ago in    Robots      UPS launches a drone 'airline' to deliver medical samples     It's the first such effort in the US.             By  J. Fingas , 24m ago               Save                                                    View              46m                  46m ago in    Services      Google wants to bring local news back to underserved cities     Google will work with McClatchy to develop sustainable business models for local news outlets.             By  A. Dellinger , 46m ago               Save                                                    View              1h                  1h ago in    Internet      Apple TV+ needs more than just A-list talent     Star power isn't enough to make people pay for another streaming service.             By  D. Cooper , 1h ago               Save                                                    View              1h                  1h ago in    AV      'Moons of Madness' blends Lovecraft with 'Dead Space'     It's a different kind of Mars survival game.             By  J. Fingas , 1h ago               Save                                                    View              1h                  1h ago in    Transportation      Uber's Ride Pass brings discounts to 20 more cities     Users can avoid surge pricing for $14.99 per month.             By  C. Fisher , 1h ago               Save                                                    View       More Stories       From around the web                                   About    About Engadget  About Our Ads  Advertise  Brand Kit  Buyers Guide  Contact Us  RSS Feed         Sections    Reviews  Gear  Gaming  Entertainment  Tomorrow  The Buyer's Guide  Video  Podcasts  Deals         Contribute    Comment Guidelines  Send us a tip!  Support         International    繁體中文  简体中文  日本版  UK         Apps    Android  iPhone  iPad              Join Our Newsletter        Subscribe          Follow Us                                                              © 2019 Verizon Media. All rights reserved.        Learn More    Reprints and Permissions    Suggestions    Privacy Policy (Updated)    Terms of Service (Updated)    Trademarks    Advertise                                       ", "category": "technology"}