{"author": "Frederic Lardinois", "title": "Google makes emails more dynamic with AMP for Email", "description": "Google today officially launched AMP for Email, its effort to turn emails from static documents into dynamic, web page-like experiences. AMP for Email is coming to Gmail, but other major email providers like Yahoo Mail (which shares its parent company with TechCrunch), Outlook and Mail.ru will also…", "url": "https://techcrunch.com/2019/03/26/google-makes-emails-more-dynamic-with-amp-for-email/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/GS_Gmail-AMP_header2_1.gif?w=721", "publishedAt": "2019-03-26T16:00:15Z", "content": "                        Google makes emails more dynamic with AMP for Email     Frederic Lardinois   @fredericl  / 17 hours         Google today officially launched  AMP for Email , its effort to turn emails from static documents into dynamic, web page-like experiences. AMP for Email is coming to Gmail, but other major email providers like Yahoo Mail (which shares its parent company with TechCrunch), Outlook and Mail.ru will also support AMP emails.  It’s been more than a year since Google first announced this initiative. Even by Google standards, that’s a long incubation phase, though there’s also plenty of back-end work necessary to make this feature work.  The promise of AMP for Email is that it’ll turn basic messages into a surface for actually getting things done. “Over the past decade, our web experiences have changed enormously—evolving from static flat content to interactive apps—yet email has largely stayed the same with static messages that eventually go out of date or are merely a springboard to accomplishing a more complex task,” Gmail product manager Aakash Sahney writes. “If you want to take action, you usually have to click on a link, open a new tab, and visit another website.”   With AMP for Email, those messages become interactive. That means you’ll be able to RSVP to an event right from the message, fill out a questionnaire, browse through a store’s inventory or respond to a comment — all without leaving your web-based email client.  Some of the companies that already support this new format are Booking.com, Despegar, Doodle, Ecwid, Freshworks, Nexxt, OYO Rooms, Pinterest and redBus. If you regularly get emails from these companies, then chances are you’ll receive an interactive email from them in the coming weeks.  For developers, supporting this format should be fairly easy, especially if they have prior experience with building AMP pages. The format supports many popular AMP markup features, including carousels, forms and lists. It’s also worth noting that these messages still include standard HTML markup as a fallback for email clients that support AMP.  Since its first announcement, Google has also brought on a number of partners that will support AMP for Email on their platforms. These include email delivery and analytics platform SparkPost, the email design and marketing tool Litmus, Twilio Sendgrid and Amazon’s SES and Pinpoint email and marketing tools.   AMP for email is a terrible idea   No everybody is going to like this (including our own Devin Coldewey ). AMP itself, after all, remains somewhat controversial given that it creates a new markup and infrastructure that wouldn’t be necessary if people created faster and simpler web sites to begin with. Bringing it to email, which for all its shortcomings remains one of the few formats that reliably work across all vendors and clients, won’t be everybody’s cup of tea either. Marketers, however, are bound to love it and I doubt most users are going to care about the politics here if it allows them to get their work done faster.                         ", "category": "technology"}