{"author": "Eric Johnson", "title": "Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Kara Swisher podcast Reco…", "description": "Hamilton and Davis spoke with Recode’s Kara Swisher at South By Southwest earlier this month.", "url": "https://www.recode.net/podcasts/2019/3/25/18280341/backstage-capital-arlan-hamilton-deeds-not-words-wendy-davis-decode-kara-swisher-podcast-interview", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Jvq5z2gdm8MG-tDSBpz0KlsXpzA=/0x251:3220x1937/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15984357/1134772363.jpg.jpg", "publishedAt": "2019-03-25T10:20:00Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Venture Capital      Politics      Diversity          Full Q&A: Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Recode Decode   Hamilton and Davis spoke with Recode’s Kara Swisher at South By Southwest earlier this month.  By  Eric Johnson @HeyHeyESJ    Mar 25, 2019,  6:20am EDT        Share     Tweet        Share     Share  Full Q&A: Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Recode Decode      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Backstage Capital founder Arlan Hamilton.  Robin Marchant / Getty Images for Twitter     On the latest episode of Recode Decode , Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis joined Recode’s Kara Swisher onstage to talk about being seen and heard in historically male-dominated fields; the current political climate in America; and how, sometimes at the urging of their own peers, women and people of color make apologies and accommodations for the people who discriminate against them.  Hamilton recalled a story about a successful black woman in New York who she thought was going to invest in Backstage, but instead used a meeting to give her fashion counseling:  “She said, ‘First of all, I don’t need to see you in blue anymore. You’re never going to raise money if you don’t dress the part, if you don’t dress better, if you can’t wear what you’re wearing,’” Hamilton said. “And I do believe it was well-meaning because I feel like she felt she had to do the part ... It just felt so wrong. And then about two blocks out I was like, ‘No way. That’s crazy .’ And it was literally two or three days later that Marc Andreessen invested in me for the first time.”  Hamilton and Davis spoke with Swisher at South By Southwest earlier this month; last week, Hamilton stepped down as CEO of the incubator within her firm, Backstage Studio , to be replaced by general partner Christie Pitts. Davis previously appeared on Recode Decode after launching Deeds Not Words — a nonprofit working to get women “in the room” and/or elected to political office — and confirmed on this episode that she may run against Texas Sen. John Cornyn in 2020.   You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts , Spotify , Google Podcasts , Pocket Casts , and Overcast .  If you listen to Recode Decode , we’re conducting an audience survey and want to hear how we can better serve you. Please take a few minutes to share your thoughts at recode.net/podsurvey . Thanks!  Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Arlan and Wendy.   Kara Swisher: Hey, everybody. God, I’m tired. It’s hot here in Texas. I just went on a University of Texas college tour. My son is going to college next year, he’s a junior, and that was something.  So, now I’m here and I’m so excited to do this. We have a lot of great things we’re doing here at the Vox headquarters, and we’re also going to be doing a Pivot tomorrow, a live Pivot with Scott Galloway, which should be really fun. But Mark Cuban’s coming, Peter Kafka’s coming, and Casey Newton is coming. There’s a giant quote by Casey Newton out here.  But without further ado, this is a topic I talk about a lot, I write about a lot, which is diversity and equity, gender equity and all kinds of issues. I’ve tried my hardest in Silicon Valley to remind most of the white men that women and people of color exist. And I’ve tried really hard to bring up these issues with them, because ...  Audience member: Wendy!  Okay. All right. But I’m so excited to be interviewing these two. I have interviewed both before. I’ve had Wendy on the podcast . I don’t think I’ve had Arlan on the podcast, but she’s coming. And so without further ado, Wendy Davis and Arlan Hamilton. Thank you.  Audience member: I love you, Wendy!  Wendy Davis: I love you back.  Okay. All right. So, we have so much to talk about. This is, again, called Against the Odds, this talk, although I think we’ve all done rather well in general. But I want to talk about where we are right now in the various areas. You’re in politics and the stuff you’re doing, and Arlan, what you’re doing around venture capital. Where are we against the odds, each of you? What do you think are the biggest challenges that are being faced in the areas that you are working in? Why don’t we start with you, Wendy?  WD: The area I’m working in now really is attempting to make sure that we’re involving as many young women in political discourse and political leadership as we possibly can. And it can be challenging to convince young people who’ve been ignored for such a long time, particularly in a state like ours. Young women of color who’ve been on the receiving end of so many hostile policies here in our state, to convince them that they actually have the power to make a difference is a challenge.  But we have been working all over the state and we have extraordinary young women who are stepping forward, who are wanting to participate in leading the conversation, that is reflective of them, their lives, their values. And they’re just doing amazing work. So, I’m encouraged.  On a national level, there’s been a lot of that. There’s been this new group of energy put into Congress, the squads led by AOC, apparently. All the kind of things that are going on. It seems like ... I was gonna start something called a Militia Etheridge, but I like her group better. It’s an open carry state, right?  WD: I’m gonna get a t-shirt that says that.  Go right ahead. How do you look at it compared to the national scale with Texas? It shifted really quickly.  WD: It’s shifting, and it’s shifting because in the 2018 election cycle, we demonstrated that what we’ve believed for a long time is actually true, that we are a purple state, that we are trending blue, and that when we do participate, we can really make a difference. And I think young people played ... I know young people played a huge role in that, still not yet reflective of the percentage that they occupy in the population, but their participation increased dramatically in 2018.  I think seeing that outcome, a lot of times the thing that’s most difficult to overcome is people’s belief that their voice doesn’t matter. So, when we have a robust election cycle that we did in 2018, it begins to help plant the idea and the belief in people’s minds that, “Hey, you know, it really does,” so I think we’re gonna see in Texas, just as we’ve seen in elsewhere around the country, the continued political leadership of women. We elected the first two ever in the history of the state of Texas, despite the very vast population of Latinas in our state, we finally just elected our first two Latinas to Congress, Victoria Escobar from El Paso and Sylvia Garcia from Houston. So, we’re on trend to do some amazing things.  That’s both appalling and fantastic.  WD: Yes.  Just appalling. So Arlan, speaking of that, not seeing ... Arlan and I were just at an amazing event in San Francisco called Lesbians Who Tech. We had Stacey Abrams there, Laurene Powell, Susan Wojcicki, all kinds of people. And you also talked onstage about what’s going on. Talk about not seeing. You’re a venture capitalist, a woman venture capitalist, a woman venture capitalist of color, which means you’re it, kind of thing. So, talk ... Well, yes, it’s a very small group of people.  Arlan Hamilton: It’s a small group, but it’s definitely a mighty group and I think that a lot of them were there before I was there. I was just a bit louder and more pissed off.  Talk about that. Talk about not being seen. Because I think it’s a big issue.  AH: I mean, I think the reason I started ... first of all, I’m from Texas. I grew up in Dallas. It’s really nice to be here. I started Backstage Capital because I was noticing that not only were people being overlooked, but I would reach out to people from Texas in Silicon Valley to men, investors and such, and I’d say, “Thinking about raising this fund for black people, for LGBT people,” and I would start listing things off that I was, and I would literally get emails back that would say, “You can’t talk about that stuff here. You can’t say it out loud.” Like, “I can’t talk about my identity out loud? We have a big problem, even bigger than I thought.”  And if that is what was happening, truly happening there, just imagine what it’s like to be ... and some of us don’t have to, we don’t have to imagine, but just imagine what it’s like to be the person who is trying to get the attention.  I had a conversation earlier today with a white man who ... we were kind of commiserating about how hard it is to get investment and he had tried many times, talked to a lot of investors and didn’t get a yes. And I said, “That’s terrible, but the point is you were able to talk to the investor. You got in the room.” That’s what I’m saying is being blocked and has been for years.  I’m actually really, though, optimistic, because it has changed so much in three years. I mean, South By has changed so much in three years. It used to be kind of you go into a corner and in some JW [Marriott] room and you kind of go and talk about diversity and, “We’re gonna make this happen,” and because those things happened, now it’s like diversity everywhere, everybody gets the diversity, you know? It’s like, “You’re getting one, too.”  I like it. “Everybody gets the diversity.” It’s like “the internets.”  AH: Yeah. Exactly.  Talk about the challenges, because you just recently, you started an accelerator, which I want to talk about in a minute. But you also recently just got into a Twitter situation with one of Silicon Valley’s biggest investors.  AH: Yeah, Paul Graham.  Paul Graham of Y Combinator.  AH: I don’t know if it was a tiff with us, because he wasn’t really volleying too much after I started talking.  Right. Explain what happened.  AH: I’ll say that I don’t have many issues with Paul. I mean, there are some kind of surface-level things and some things that I think we could talk about and I’d love to talk to him about it. I don’t have the sort of disdain, I don’t have Peter Thiel-level disdain for him.  Okay.  AH: But you know, he said something on Twitter about some of his favorite investors are operators and he listed a few and that was his business. That’s his feed. And then one of my friends on Twitter that I met before, she said, “Hey, that’s cool. That’s a great list. Maybe also talk to Arlan and then you’ll have a little broader list next time.” And he came back with, “Or maybe I could just go in the next room and talk to my wife, because she’s an investor.”  And she was not on that list.  AH: She wasn’t on the list.  Right, yeah. I noted that.  AH: She wasn’t on the list. Jessica. The thing is, okay, I’ll get into it.  I love a Twitter war, as you know.  AH: What I did was — and if you look at it, it’s all there, I didn’t delete anything — I posted it and I said, “This is a problem, because he thinks that he can walk in the next room and that’s his diversity, that’s his view. And he has a lot of power and a million people pay attention to what he says, and that’s a problem.”  So, his response to that could’ve been many things, including, “Hey, you don’t know me well enough to put that on me out here, let’s talk about it,” or, “I would prefer you didn’t put my name out your mouth.” He could’ve said all that. But instead he said, he basically accused me of being sexist and accused me of demeaning Jessica’s contribution. And that is when I took offense, because of all people, Paul Graham is not gonna tell me that I’m sexist. Of all people.  That is when his lovely minions decided they were gonna just attack everything about me and that’s when it got really ugly. Our stuff is just I’d like to have a word with him. I don’t have a problem with him having an opinion. I also don’t, it’s not my place to say that his list is wrong. That’s his list. He didn’t come to my list and say, “No, I don’t like Drake.” That’s fine. But it’s the fact that his go-to, his defense is to kind of throw his wife under the bus whether she believes it or not, that’s how I saw it and that’s how a lot of people saw it.  All right. Wendy, talking about this. This is like Silicon Valley ...  AH: Yeah, you’re like a ...  But it’s typical all through, the idea of not opening things up. Talk a little bit about, you started a group after you were a legislator. Talk a little bit about what you’ve done since then. We did a great podcast about Deeds Not Words . Where do you imagine we are? Because it does feel like we’re sort of in this in-between place right now, that it looks like forces of progressives are on the rise, and at the same time, the retrograde is happening. It feels super confusing to me, at least.  WD: Yeah. To your point, Arlan, they’re not gonna just make the room available to you, right? You have to kick the door open. And that’s what we’re trying to teach young women to do. Deeds Not Words exists very specifically and only to make sure that we are helping to show young women a path to effectively using their voices.  It is not lack of passion that millennials or Generation Z suffer from. It’s sometimes a lack of understanding about how to be most effective in getting their voices and their passions moved to the forefront of conversation. So, we spend a whole lot of time with them. We have 19 high school and college chapters around the state and we spend a whole lot of time in that Texas capitol where these young women come. They take the capitol by storm in a beautiful way. They testify in committee hearings, they are working on a number of issues, all of which fall in some way, shape, or form under a gender equity umbrella.  One of the biggest issues they’re working on in this legislative session centers around the backlog of rape kits in our state. Sexual assault reform, making sure that all those protections for our campuses that are being stripped away by Betsy DeVos under Title IX are being reinstated at the state level. And when they show up in these committee hearings, because they’ve been helped to figure out where is the room and how do I get in the room, and how do I sign up to speak in the room, and when I do get recognized in the room, how do I best present myself, we do a lot of work with them on that.  And I’m telling you, when they sit down, these lawmakers, some of the crustiest old white Republican lawmakers, they just sit up and take notice. And so many of their bills that they work on sail out of committee unanimously. Two years ago, our girls helped to pass seven bills into law and they’re gonna have an even bigger record this time, so they’re doing it.  And I think when we show young women how to be powerful in those spaces, what I hope happens is that they sit in those committee hearings, they look up at that dais, and they say, “I want to be there. I belong there. I’m gonna run and I’m gonna beat your ass, and I’m gonna be sitting up there making that decision one day.”  When you look back at what happened with you, when you reflect back on it, it seems like you’ve gone back, you did this filibuster , so well known. How do you reflect on that? Because you were pushing, pushing, pushing, pushback, and it keeps pushing back. That’s one of the things that I think a lot of people who are running, when they start to ... obstacles start to naturally form, not naturally, unnaturally form in their way, really. How do you think about your experience? What happened to you now, reflecting back on it?  WD: Well, I think it was ...  And for those who don’t know, explain.  WD: I conducted a 13-hour filibuster to try to kill — thank you — to try to kill a bill that would be very bad for women’s ability to access safe and legal abortion in our state. And what was beautiful about that experience, it didn’t have anything to do with what I did, it was the fact that in a state where we believe the deck is stacked so high against us, we give up before we even start. For whatever reason on that day, thousands and thousands and thousands of women, and many men as well, stormed the Texas capitol. And it was because of them in the final 15 minutes of that night when the filibuster was ultimately called to an end, it was the use of not just their figurative voices but their literal ones as they screamed with all their might that they kept a bill from passing by the midnight deadline.  Now, the next day it passed into law, or the next week. They called us back to another special session. It passed into law. All of our fears came true. Clinics across the state closed. Women lost their access to that care and we started seeing the ripple effect that we knew would follow it. Medicaid births went up exponentially. Teen birth rates went up exponentially. Our maternal mortality rate went up exponentially. And of course, self-induced abortion went up. And women’s health care was compromised. But the great thing was we never gave up. We took it all the way to the Supreme Court and three years later, the Supreme Court overturned that law. Yes, please clap. That’s great.  So, what we learned in that experience in the state where we tend to give up before we even start is that you just have to keep pressing ahead. Own your truth, own what you know is the right thing to do, and before long, you’re going to really begin to move the needle. And here’s why I feel like we have been so successful, and when I say we, I mean the collective we in Texas that have been working so hard on issues like this. In this legislative session, we flipped 12 house seats, we flipped two senate seats. That’s unheard of, by the way. It was extraordinary that we did it, yes. We have nine seats left to go in the Texas house to completely flip it into Democratic control and we’re gonna do everything we can in 2020 to make that happen.  But in the meantime, because people worked so hard and particularly women, women in the state kicked ass. Not just in running, but in being the people who were creating their own grassroots organizations, turning people out to vote, doing all the hard volunteer work that it takes to succeed for candidates in our state. And it was because of them that those seats flipped, and the legislators know that.  And what has been so fascinating to watch, some of these Republicans who did come back, but they barely came back, they almost lost their seats, those are my favorite ones to watch in the session, because suddenly they’re trying to look like the greatest champion and friend to women you’ve ever seen. They recognize our power. And I can just feel us at a tipping point right now, and I feel like even in a place like Texas, we’re gonna actually start moving some incredibly important progressive values forward, because they just can’t ignore us anymore.  So, she said, “even in a place like Texas.” It should not be that way, “even in a place like San Francisco,” or, “even in a place like Palo Alto.” How do you assess the situation? You said it’s gotten better.  WD: Yeah.  I don’t perceive that in any way whatsoever.  AH: Cool beans. Cool beans. It has. First of all, it has because ... I don’t know if I would be able to get up every day and do what we do if it hadn’t. It’s not a dramatic change, but it is different. It has nothing to do with some sort of angelic men coming together and saying it’s better now. It is a lot of ...  Explain what “better” is from your perspective.  AH: The fact that we’re talking about it. The fact that it’s no longer whispered and there’s a lot of people ... there are a lot of people who feel empowered right now. There’s strength in numbers.  When I think back to 2015 where it was like, I was screaming out online and in front of people saying, “Things are going to change. There’s going to be a reckoning and we have to get in front of this.” Really, the difference between that and today where, honestly, walk outside here and just take a good look at what this place looks like right now compared to what it looked like four years ago. It’s just different. And I mean, people who are in the room right now didn’t feel like they could be in the room four years ago. They didn’t feel like they were part of this. Not only do they feel invited, but they understand this is just as much theirs as it is anyone else’s.  So, talk about that in terms of venture capital and investing. How has that changed? Because the numbers, they still ...  AH: Oh, the numbers suck.  What is it? Two percent?  AH: It’s less than 2 percent for women in general.  Right.  AH: Like all women that give life, why we’re here, it’s less ...  I know, I have done that. But go ahead.  AH: Yes, I know. Less than 2 percent. And then when it comes to black women in particular, it doesn’t even register. $86 billion in 2018 in venture, most of it obviously growth and probably half of it SoftBank, but ...  Yeah. And half of that the Saudis, but let’s not mention that again.  AH: And so little ... true. So little for black women that we can’t even quantify it. And probably half of that was Zume Pizza, which is a SoftBank deal. That sucks.  So, the money is not there for women, people of color.  AH: The money is not there and that’s what I think about, we talk about what has to change, what’s next. But the point of it is that ... like if I look at it in an optimistic way, which I have to sometimes ...  Yeah, I want to understand your optimism, because I have zero.  AH: Sometimes I do. And sometimes I just lay in bed and I’m like, “Oh my god, this is a dumpster fire. This is terrible.” But the optimistic side of me says, “If it’s only taken three years for people to start shifting minds and hearts,” they say we couldn’t shift hearts. That’s the one thing that I was warned about, you’re not gonna be able to change someone’s internal thought about this and their heart about this. You may be able to talk to them about the bottom line, you may be able to ... you’re not gonna ... I see it that people have shifted their thinking and what they do on a day-to-day basis based on understanding.  Explain. Give me actual manifestation of that. What do you think they shifted? Talking about it is one thing.  WD: Absolutely.  Doing something about it is another.  WD: And there’s a lot of people who just talk about it, who like the aesthetics, a lot of people who like to take the picture with me or someone on the Backstage team because now they’re “woke.”  Yeah.  WD: You know, so I don’t, I don’t ...  I understand that’s not a word we need to use anymore but go ahead.  WD: Right. We, I don’t know who “we” are, but I’m going to use ...  I was told. I used it somewhere ...  WD: Maybe that, I don’t know, I don’t know the circumstances, so.  I was using it as a joke, but go ahead.  WD: Oh okay. Yeah, I’m always like a couple of years behind on the jargon.  Yeah, me too.  WD: So there are those, but there are people, I think — you know, you see it — I haven’t had a chance to think about it so we’ll see what happens on the Twitters when I say this. You see it with the way in which white women ally. It’s a lot less, you know, again, it’s a lot less talk and it’s a lot less sort of setting a very fine plate at a dinner table. It’s more like this is half your table and what do you want to do with your side?  And going back to my original thought, I think that that has to happen. I want things to change overnight too, like I really hate incremental change when it comes to something so important. But if we think about the fact that nothing was changing before and now three years later, I can come to an event like this, I can show people that we saw 5,000 companies that were led by an underrepresented founder in the last less than five years alone...  I can show that the 100 companies that we invested in and people aren’t afraid to listen and people back that. We have 50 million-plus follow-on funding last year alone and that wasn’t from us. That was from outside people who didn’t know these companies before that they existed. So, if I think about how much has changed in my view and how much has been accomplished by us in these three years and then I look three years ahead, that is where I get my optimism. I think things will be ... I think it’s all about leverage. I think, just like you mentioned, things are changing and the leverage is shifting.  Wendy, talk a little bit about sort of the national theme, because we’re in the middle of a presidential cycle already. I have to interview Amy Klobuchar tomorrow, for example, obviously I’m going to have to talk about the issues around her management, but that’s besides the ... Initially, because I do want to talk about tech policy and all the other things. But how do you look at it on a national level? Because again, as I said, it feels like there’s a shift but not a wave, I guess, I don’t know how the right political term is in that way.  WD: I don’t know. We’ll know more whether it’s a shift or a wave in 2020, whether the momentum that we saw beginning in ... Sorry, in 2018, whether that continues into 2020. So we’ll know more obviously in a couple of years. I feel like there’s tremendous momentum and I think it’s going to continue. Obviously we have more women ever elected to Congress than we’ve ever had before, more women of color than we’ve ever had before, and they’re changing the conversation. And not everybody’s real comfortable with it, you know, but it’s exactly what democracy is about and it’s exactly what’s supposed to happen when people come from different life experiences and different backgrounds and they move different values to what’s being heard.  So I think it’s a very healthy thing for the Democratic Party. There’s a lot of soul searching going on about, you know, whether it’s getting too scary left or whether the Democratic Party is going to turn into what we saw happen with the Republican Party with the Tea Party kind of fracturing it, but I think we can rise to the occasion. And I think the fact that so many women ran and won this time and many others ran and almost won, it’s not going to be a one-cycle phenomenon that women stepped up.  So in that vein, are you running for Senate?  WD: I might run for U.S. Senate.  And this is for Cornyn’s seat, right?  WD: For John Cornyn’s seat, yeah. It’s actually ... I should’ve said that differently. For the seat that John Cornyn currently occupies. But, you know, we’re having great conversations about that between me, Joaquin Castro, MJ Heger. We want to make sure that we’re best positioned to advance the person who’s going to take that seat and I want to be a great team player in helping to make that happen. If we decide that that’s me then I will do it. But if Joaquin decides that this is something that he wants to do, then MJ and I are going to get behind him. So, we’re working collaboratively on it.  Right. What does that mean? I just wish you would just not work collaboratively sometimes. I wish women would just say, “I will have that.” I do that all the time so I will take the most money, thank you and please give me more. But when you think about running for Senate, is there anything that detracts from it besides cooperating with others in the race? How do you look at it? Why you want to do this?  WD: Well, it’s going to be a tough race, there’s no question. When Beto ran against Ted Cruz, he had the advantage of the built-in negatives that Ted Cruz brings with him and the fact that he’s just so widely disliked. And John Cornyn has been every bit as dangerous for all of us and the future of this country and the things that we ought to be working on and yet he’s been more quiet about it.  Likable, he’s likable enough.  WD: He’s polite, you know, more polite, I guess I should say.  AH: Less creepy?  WD: A little less creepy, yeah. He doesn’t quite have that creep factor and so it makes it harder. You know, I faced that challenge in 2014 when I ran against Greg Abbott. People didn’t really know a whole lot about him, he never served in a policy-making body before, he’d been our AG and had previously been on the Supreme Court but didn’t have like a policy record that you could run against. And he’s a likable person when you have conversations with him and it’s really hard to help people understand why that person actually is going to be very, very bad for them and their families.  And there will be a challenge like that with John Cornyn, making sure that voters understand what his record has been, how very much an aide to Donald Trump he has been, and how and why for the future of this state and what we ought to be working on to make sure that our families are drinking clean water and breathing clean air and having access to health care and education and all the things that lift up our opportunities, that he’s been bad for all of those things.  So it’s not going to be easy. And the thing that I will admit, when you come through the kind of really tough race that I came through in 2014, when you get beaten by the misogynistic stick so hard it makes you struggle for air, that’s tough. I feel almost a responsibility in some ways to show young women yeah, I really got beaten hard with that stick and it hurt and it was painful but I’m strong enough to rise up over that and to not let them have the final victory over me.  Because if we allow misogyny to defeat us as women candidates in that way, if we prove to them that that’s a successful strategy not only to beat us but to take us down forevermore, then we’re empowering it and I don’t want to be a part of empowering that. It’s something that gives me pause, of course, because I know what it felt like, but it also gives me resolve in the same way.  How would you do that differently? How would you handle that differently?  WD: You know, I would handle it differently by calling it for what it is. At the time ... I’ll just give you an example. One of the things that they really went after me about was what was I considered one of my strengths as a person running for office, that I had come from poverty, that I had been a single mom, that I had worked two jobs and gone to college and ultimately made my way to Harvard Law School, and, you know, did the things that I did. And I saw that and it had previously been a strength for me in my Senate race, for example, my state Senate race. But they took my biography and they just shredded it and they made me look like I was a bad mom, that somehow I had abandoned my children.  And I remember so distinctly my two daughters having to come to a huge Democratic event in Austin, both of whom read their heartfelt remarks that they wrote about the fact that their mom was a good mom and that they love me and felt supported by me and I felt so angry in that moment that my daughters had gotten put in that position. What I would do differently is I would just call it for the baloney — to say the politest word I can think of — that it is. I would hope and I think we would have more women calling it out, too, other women on social media and otherwise who would say, “Uh-uh, we’re not suffering that.”  Well, it’s an interesting thing, I just recently interviewed Hillary Clinton , and one of the things I asked her about was the creepy thing, Trump behind her. And I’m like, “Why didn’t you turn around and say, ‘Back off,’ or something like that?” And she explained it, she thought that it would cause all kinds of problems if she had said, which was a creepy guy hovering behind her, that she would get more flak because of that. But in not saying anything she accepted what was happening, which was a creepy guy hovering behind her that she didn’t defend herself again. Arlan, when you’re thinking about that, like not looking the part of a venture capitalist, how do you ...  AH: Do I not?  You don’t look like any venture capitalist ... You do, you do to me. You do to me. But, you know, you’re not wearing the bad slacks and the Allbirds or whatever the hell ...  AH: Patagonia.  Discussing “intermittent fasting” with me. Literally, I’m like, “I’m not interested in any way by your eating schedule and you need to stop talking to me about it,” and they keep talking and finally, the way I got them to shut them down was you know, when men talk about ... When women talk about food like this they have an eating disorder, when it’s men it’s intermittent fasting.  AH: Exactly.  But, in any case ...  AH: Is there a Kara Swisher as a service?  What, in the service, what do you mean?  AH: As a service.  Yes, there is. Yes. I was going to have an ad.  AH: I just want you with me everywhere I go.  Well, you can just ... “Fuck you,” is usually a good thing.  AH: Okay. Fair enough.  Start with that and move on up the stack. But when you don’t look like that, how does it ... Has that change affected your fundraising, affecting ... You change differently, like Wendy’s now going to say, you know, I’m not, I’m a good ... You’re not going to defend her, you’re not even going to say, “I’m a good mother.”  WD: I’m not even ... It’s ridiculous.  I’m not even going to defend it, like it’s ridiculous.  WD: It doesn’t deserve a response.  How do you look when you have to sort of start to fundraise? Do you have to do something different or can you ...?  AH: I don’t do anything different than normal because I launched that way. I sort of launched ...  “This is Arlan.”  AH: This is who I am and it needs to be different. It needs to be a shake-up, what’s happening is not working so far for diversity efforts and other things. So I don’t feel ... I had one time where a black woman who is very successful and who — I think she was very well-meaning — she told me, I walked into her office I thought she might invest ... This was in New York maybe two years or plus and I walked in and I was, I forgot what it was. She saw a picture of me in a blue shirt or something and I thought we were going to have a meeting about investing and her team asked me about that. And she said, “First of all, I don’t need to see you in blue anymore. You’re never going to raise money if you don’t dress the part, if you don’t dress better, if you can’t wear what you’re wearing,” like this, right?  And I do believe it was well-meaning because I feel like she felt she had to do the part. I was crushed by that and I walked out and I was like for a split second I said, “Is this how it’s going to have to be? Do I need to like, I guess I’ll go and check out some clothes that are different.” It just felt so wrong. And then about two blocks out I was like, “No way. That’s crazy .” And it was literally two or three days later that Marc Andreessen invested in me for the first time and he invested in me, in all three funds. And I don’t think Marc cared what I was wearing, what color I was wearing, what it looked like.  No, Marc is badly dressed himself.  AH: Right, but that’s part ...  You are not badly dressed.  AH: But that’s part of it.  He happens to be, he doesn’t think about it.  AH: How in the world do we need to be wasting our time talking about, this lady and I wasting our time talking about what I’m wearing when she and I could be making power moves together but we’re talking about it because you don’t think ... She was saying out in that world, they’re going to eat you alive if you don’t dress the part. And, you know, they stole hoodies from us . I’m dressed the part. I’m dressed the part.  So as far as looking, in general the way I speak and the way I handle myself, what my thing is is what I am in life. I try to do no harm. I think of myself as a kind person. I have the best intentions, I think. Sometimes I will call people out because it’s like see something, say something. My mom taught me that early. See something, say something. But I’m not out to get anybody. I’m not out to ...  Do you need to have a massive hit to become legitimate? There’s lots of VCs that sort of have good outcomes.  AH: Yeah, exactly.  Do you get that ability to do that? There’s not that many VCs that have big hits.  AH: It’s a double standard, you know. I started getting asked about my returns, like exits, like a year in. We’re doing pre-seed deals and they’re talking about, “This is a 10-year fund with a two-year extension.” And a year in, people were like, “I need to see something. I need to see some exits from you to take you seriously.” And I knew then, I was like, “Oh, this is how that’s going to be.”  So I had a conversation with myself, as I do often, and I did answer. And I said, “You know, this is how they can ship it to me but I’m not going to accept it. I’m not going to sign for it,” is what I said in the past, right?  Right.  AH: I understand that’s going to come from me from all directions.  That you need to prove it.  AH: Earlier than anyone else.  Earlier than anybody else.  AH: Than anyone else. I sat with this guy, he was a friend of mine, he’s a white venture capitalist, has a little less than a hundred million under management. He had on his long shorts and probably Allbirds. He sat in my office one day and very casually told me how he’s in his 50-year and has had no exits, had nothing like that, having a great time though, making some great decisions in my view, and how he got $15 million with sight unseen on the next fund.  And the fact that I have those conversations and I know it’s really happening, I know what’s really happening behind closed doors in venture, allows me not to take that from people who are outside. Anyone who’s challenged how we’re doing things, our track record, any of that, A) don’t have our vision, they don’t understand that you can’t start a movement doing things the old way, and B) have never even attempted something as bold on their own.  So I think about the source, and a lot of that insecurity is theirs. I don’t have that insecurity for myself when it comes to what we’re doing. I hold myself, however, to a very high standard and I know the milestones and the KPIs [Key Performance Indicators] that we must hit in our opinion as a fund and as a firm and that is what’s important to us and to our portfolio and to our LPs. If you’re not writing a check and you’re not an LP, you know, I’m not having that conversation necessarily with them, but absolutely, to answer your question, since almost day one it has been double standard always.  “What’s going on? What are you doing?”  AH: Oh, sure, you know, because a couple of things. I was bold and I said I believe this is going to work and people want to see results, but also some people, you know, they want to stand against the wall, do nothing, and put their foot out. And, you know, I’m Jackie Jackson, I’m over here just jumping.  I’ve heard that. I’ve heard that about several ... I’ve heard about you. I’ve heard about several women funds and it’s often by someone who just sucks.  AH: Absolutely!  And what’s interesting is someone who actually did say something about you and I think another woman’s fund and I said, “Well, you really suck, actually.” And they’re like, “What?” And I go, “You really suck. If they suck, you really suck.”  AH: Oh yeah, exactly.  Like, you know, if you want to do it on that curve and it was a really interesting thing they’re like, “Well, it’s just my opinion.” I said, “Your opinion’s stupid, but let’s move on.”  AH: Thank you. That’s the deck.  It’s sort of like when you talk to a board, like you know when they had the Twitter board, I heard a story saying “all men and no women of the Twitter board” when they have 10 white guys on it.  AH: Yeah, and like all of them were named the same, like started with a J.  It was the best lead I ever wrote, I should’ve retired after it. It was a story about the board of Twitter and I said, “Here on the board of Twitter, which has three Peters and a Dick,” which was such a ... And they did, they actually did.  AH: They literally did.  Which was a great lead, I thought so. But one of the things ... Dick called me, it was Dick Costolo, and said, it was so funny, he’s like, “All right, first of all, that’s really unfair, but very funny,” which is why I like Dick Costolo. And he said, “Well, it’s not fair to do this,” and I said, “It’s mathematically impossible that this happened, that you have the same exact people on the board.” And he said ... And I say this all the time, he said, “Well, you know, we have standards.” That’s the thing they tend to say.  AH: Yeah, ooh.  So then I said, “Why is it the word ‘standard’ only comes up when it’s mentioning women, people of color, and it’s never the 10 white guys who have been running Twitter into a wall for years now?” It was really interesting, it’s a really interesting thing. Not to say that you couldn’t screw up or you couldn’t screw up, but it was a really interesting ...  AH: Jason Calacanis once said that he was — again, I think he might’ve had some good intentions with it, foot-in-mouth disease — but he said, you know, “What you need to do is lower your standards so you can invest in more people of color,” or something really stupid he said. And I said, “I may lower my standards and have coffee with you and tell you why that’s wrong.”  Did you?  AH: We ended up talking on his podcast, yeah. We had a little conversation.  But he will talk to you, which is really great.  AH: Oh yeah, he will.  To finish up, we’re going to have some questions from the audience to get ready, we’ll have about 10 minutes or so for questions. What do you think the key things are for — this [session] is called “Against All Odds,” I’m not sure I kind of understand that — but what do you think are the key things you need to do today in the areas you’re in? Like you said, you’re not going to pay attention anymore, what do you think the key attributes would you say for people to be successful in your each areas? Wendy, why don’t you start?  WD: I would say it’s fearlessness, but it’s not really fearlessness because everyone feels fear. And when you’re doing hard things, no matter if it’s in the political world, the financial world, you feel fear. The real challenge is gaining the ability to push through fear and to center yourself around something that’s bigger than you that you believe in so strongly, as Lady Bird Johnson would say, “You forget to be afraid.” That, I think, is our great challenge but also our great opportunity, because if we can gain the ability to do that, we are capable of doing anything.  And to go back to what I said earlier, a big problem that we have in the political context is that people have been conditioned to believe that their voices won’t matter, and it’s taught them over time not to participate, and so our great challenge is to continue work on helping people to see that they have the power to make extraordinary differences. Whether it’s writing a $5 check, whether it’s taking their one responsibility to go and vote, working on a campaign or running for office themselves.  That’s really the only way we’re ever going to change this, and that’s the remarkable, wonderful thing that happened after November 8th of 2016 is that so many people woke up and said, “I can no longer rely on other people to do this. I’m going to have to take responsibility and do my part,” and I think we’re going to continue to see people do that through 2020. And I hope, if we do elect a Democratic president in 2020, we won’t then decide we don’t need to worry about things anymore.  As in, “Phew, that’s over.”  WD: Yeah. That we’ll just stay as vigilant and involved as we need to be.  How about you, Arlan?  AH: That’s great. I think when I think about the next few years, for us to be successful we have to cut out the noise. We have to also realize, let’s not rewrite history. Y Combinator in its first year was a few poorly dressed nerds in a room eating chili, and they then had time, resources, space to breathe, all of that, and that is what ... Why you have Airbnb and Dropbox and all of these wonderful companies now, and it’s why they do wield so much power, and we respect them and kind of emulate them in some ways.  So we’re however many years or months into this renaissance as women of color and other underrepresented, underestimated people. We can’t get complacent. I don’t think we will. We can’t be beaten down by those people on the sidelines who are truly on the sidelines. Not doing anything, throwing at us their opinions.  And so I’ll close it by saying something that, once again, I’ll quote my mom. She said this to me. She was quoting something that she didn’t know where the quote came from, but she told me this while she was talking about a medical situation she was in, and she said to me, “The seed does not always see the petal.” And of course it was emotional and everything, but if you think about that, think about all of what we’re going through right now, even though we’re early in this, all of it is for something, and if we get distracted by mediocre people telling us what we’re doing wrong, we’ve completely lost the plot ourselves.  That’s a really good point. I think it’s really interesting observing, just listening to. One of the things that they always say about women who are super tough or say things out loud or aloud, “Those women don’t give a fuck.” They say it about me a lot, other people. I think what the real issue is, we give all the fucks. Do you know what I mean? We don’t not give a fuck. We give all of them.  WD: That’s right.  And I think that’s a very big differential. Okay. Questions from the audience. Put up your hands. We have a mic. Please ask questions of these women. Right here.   AH: Shout out to all the introverts as well.  Audience member: Hello. Where do you think the primary responsibility for increasing diversity lies: among the powerful or among the marginalized? On the one hand, I see narratives like Sheryl Sandberg’s Lean In basing almost an unfair burden on women, and blaming them for not asserting themselves, but on the other, as women it’s difficult to understand how to affect change without relying on our own agency. So how do each of you strike that balance?  I like that you wrote that down.  AH: Yeah.  That’s so cool. Everybody else better have a question or I will ask you myself to ask a question. Go ahead. Who do you think it relies on?  WD: Are you talking to me first?  Yes. I’m talking to you.   WD: So I really liked what Arlan said a minute ago about white women and the evolving role of understanding how it is that we own responsibility for making sure that we are not just setting the table, but instead making room at the table and saying, “Here’s your half. What do you want to do with it?”  So part of it is recognizing power and privilege and the role that you play in it, right, and making sure that you are taking the time and doing the work to not lift other people up, but to give them the space to be able to lift themselves.  I remember reading Sheryl Sandberg’s book and I had this visceral reaction to it. Maybe it’s part of my own story. I’m sure Arlan could talk about this from her amazing life story that she’s had, but the obstacles that are in the way of women, and particularly women of color, are not there because of some failure on our part. The idea that we just aren’t doing enough — and if we will just represent ourselves better and do more, then we can accomplish it — completely gives a pass to the structures that have been in place, the systemic structures that have held women — and women of color particularly — back. And unless and until we take those on and force changes in them, we’re not going to have the opportunity to even be in the room that lets us lean in, right?  I think that’s right. I used to tell Sheryl she should have called it Lean In and Fall Over because that’s the experience of most people. But Arlan? Go ahead.  AH: I agree completely, and my first answer to myself was both. It’s a combination. Lena Waithe says it best when she talks about allyship. She’s like, get out the way. Get out the way and let us do our thing. But it’s both because there is that responsibility of those who do have privilege. By the way, we all have privilege. We have some privilege. Everyone in this room has a different privilege.  It’s my responsibility not to only focus on myself and what I’m working on, but to also kind of listen and be sure that I’m looking, and the elevator thing, sending it back down or up or side to side. But most important — I love allies and I care about them and I’m very grateful to them — but mostly I’m all about us just doing it ourselves.  We don’t need permission to be in a home that we partially own ourselves. The allyship, even the people who are oppressing, I like that they’re becoming more woke. I do. It will make for a better party when we jam, but we’re going to do it either way.  Yeah. I think it’s important to shame the powerful almost continually. I think it’s great. They’re very ... It’s very easy to do. Negging works particularly well as you move up the billionaire scale. Something I often do is sometimes I objectify them. It’s like, “Did you gain five pounds?” Often, I got to tell you, it works.  AH: I have a question. Can I do a question in the Q&A?  Sure.  AH: I was wondering, you interview so many people that are just ... Zuck, you’ve interviewed him many times during the shitshow that is ... All of that, and you’ve been doing this for a long time, and you have ...  I’m 103 years old.  AH: My question is, I think I know, but I really would love to know how you think about this. Why do you think people ...  Continue to talk to me?  AH: Because you’re so honest, and you’re putting a mirror up to them.  Yeah.  AH: They don’t have anywhere to hide with you.  They don’t, no.   AH: Is it because they just respect you that much because you’re doing that?  Sure. Yeah, respect. That’s it. No.  AH: They’re terrified of you.  It’s interesting because I don’t know why Mark Zuckerberg keeps talking to me. It’s not good for him. It never is. It ends badly, and the last time, the Holocaust deniers , I was like ... When he started going down that road, by the way, he was saying Holocaust deniers don’t mean to lie, and so I just let him keep talking. All right, they do, but okay.  I think there’s two things. Marc Andreessen has a theory that it’s Stockholm Syndrome in Silicon Valley, and they just don’t know what to do but talk to me.  AH: They would be lost if you weren’t showing up at their door?  Yeah. They’re like, “We got to talk to her.” I think the issue is, I think smart people ultimately like smart questions, and instead, a lot of reporters tend to beat around the bushes. Like, “I hear, Mark, that there’s some issues around privacy at Facebook, and you might ...” and I’m like, “What the fuck are you doing?!” That kind of thing. I think people appreciate that because you’re not hiding the question, and I think that’s probably one of the reasons.  The other one is, I know more than they do. I just do. I don’t know better, because they’re billionaires. They’ve done very well, but I do talk to more people, and so when they start down the road, they go down Bullshit Avenue or Obfuscation Lane I go, “No, no, no, no,” and they’re like, “Uh oh. What does she know? Maybe she doesn’t realize.” They don’t know what I know, and I think it’s a really very good weapon in that regard because I actually do know. So when they tend to do that I tend to stop them.  AH: So it’s a combination: a little bit of their ego and their intelligence.  Right.  AH: That’s trapping them into, “I have to be interviewed,” or, “I’m not relevant right now if I’m not being interviewed.”  Well, that’s part of it, too. Like sometimes when a really powerful person goes, “Oh, I should come on your podcast,” I’m like, “I don’t know,” and then they’re like, “But I want to!” and I’m like, “Maybe.”  AH: Is any bit of it like you hypnotizing them with the sunglasses?  Yes. That’s it. That’s it.  AH: Cool.  I think people want to ultimately tell the truth, ultimately, and it’s sort of like that movie with Tom Cruise when he goes, “Tell me the truth.” That whole scene.  AH: “You can’t handle the truth.”  No, you couldn’t handle the truth. I want to know the truth, and so I tend to do that.  AH: Okay.  I don’t know why. They’re stupid. I can’t tell you why. I think a lot of people don’t ask the direct question. I think the direct question is always the best question, and it’s what people want to know, and I think it’s really important, and I also don’t treat them ... I don’t lick them up and down all day like most people.  AH: That’s a visual that I’ll never be able to forget.  But they do! They get licked up and down all day, and then they think they hung the moon. I’m like, “You didn’t. I was there when you didn’t have any money and I was there when this was happening and don’t pull that crap with me.” I don’t know. I wouldn’t do an interview with me.  In any case, another question, please. Right here. But thank you for asking that.  Audience member: I’m going to totally fan girl out right now. I love all three of you. Arlan, you said something about changing hearts as well as changing minds. Kara, you contribute now to the New York Times.  Yes.  Audience member: President Obama this past week said if you read the New York Times and you watch Fox News, you feel like you’re living in two different worlds.  Yep.  Audience member: And if you’re stuck in one of those filter bubbles, you don’t know what’s happening in the other. So the question is how do you break the filter bubble, and how do you think we as a society will reach across the island and break those filter bubbles to change hearts?  I don’t know. Everybody’s got a filter. I have some thoughts. My mother watches Fox News all the time, and I was one time caught in her apartment during a snowstorm, and it was on full play all the time, and I literally by the end of it I was homicidal. So they’re very deft at propaganda. That’s what it is, come on. Read the Jane Mayer piece . Come on, stop. And by the way, look, the New York Times is liberal. They are. They are.  Well, they’re sort of center-liberal or something, but I think that ... I don’t know if we can, and I think our country’s always been that way. Back to the time of Hamilton and Washington. There were competing news. The whole idea of the press being in the middle is a new phenomena, and I don’t think it’s ever really been true.  The one thing the right wing has done really well is used the internet, because they were pretty much zeroed out from the major networks. The major networks were centrist liberal kind of, liberalish, liberal-light kind of stuff, and so I think that it’s really hard when you get ... especially when you have someone like President Trump who really just keeps repeating untrue lies constantly.  I think people are sort of like, “Well …” They equalize things. It’s really hard when someone doesn’t mind doing that and does it a lot.  AH: Sociopath.  Yeah.  AH: Yeah.  It is.  AH: I tend to ...  That’s the technical term for what’s going on, but go ahead.  AH: I mean he is, right? I tend to just get in the fetal position and watch Rachel Maddow and pretend that she’s stroking my forehead and telling me it’s going to be okay, but I also I do watch Fox every once in a while because I want to know what people are hearing, and I want to empathize with them and understand how they could believe this thing. I think it also helps a little that I grew up in a cult because I understand cult behavior.  But that’s another story.  AH: Totally other story. I’m fascinated by it. So you can sell almost anything to almost ... To anyone. There’s not one person depending on how much they make or what their worth is, all of that, can be sold something. My opinion of Trump is what it is, but beyond that, the reason, the fact that he was able to tap into a certain group like this, people are upset because of this, the cover, is it GQ [Esquire] with the American Boy cover? People are really upset about that.  I’m actually like, I want to read this. I understand where they’re coming from, and idealistic for me is us all working together, and all living together and having parity. It’s not like black people take over the world, which would be still a cool party. Cool party. But it’s not that. It’s, I have this idealistic view of things. So I want to understand, and I think that’s ... we’re just curious people.  I think the right plays the left all the time because the left always goes, “Oh, I want to understand.” The right’s like ... They do not want to ... We get played every day of the freaking week by them.  AH: But I want to know the same way I learned all the rules of venture capital so I could break them if I needed to. I want to know what people are hearing.  Sure. But I think they do go, “I’m a nice person.” Like, I don’t care. You’re still doing horrible things to the country.  AH: Sure, sure.  That’s the move. And the progressives tend to go leaning in and then bang. I’m a little bit more no, I’m not leaning into you people at all. I just don’t ...  AH: I’m still there. I’m still at the place where I kind of I want to learn a little bit.  Wendy, what do you think?  WD: Well, it’s a really good question because it’s, I think, one of the most important questions we need to grapple with, and one of the hardest ones to figure out what the answer is. Probably everyone in this room has someone in their family who has been, and I believe this, brainwashed by Fox News.  My brother, who I grew up with — of course I grew up with him, he’s my brother — but I have three siblings and he’s only 15 months older than I am, and we were so close growing up. We grew up in the same family with the same struggles, and my brother moved away to Tennessee, and he started watching Fox News, and I don’t even know him anymore. I love him so much, and it breaks my heart.  I got one of those.  WD: How did this happen? How does he see the world so differently than me? And if I can figure out how to crack that code with my brother, then maybe I can give a better answer to the question.  Is he trying to crack the code with you on the other side?  WD: No.  No. Exactly.  WD: No.  Let me just tell you, I don’t think we should try to get along. I just think we should win. That’s all. I don’t know. Part of me is ... I know it sounds terrible.  AH: It’s not terrible, it’s the quality of life. We only have a certain amount of years on this earth.  Yeah. I know.  AH: And the quality of life that I want to enjoy is always having tried.  I just wrote a column in the Times about having a stroke , which I had seven years ago.  AH: It was a great article.  And one of the things I said is, I just don’t have time for this. No. You don’t get to get away with it, and you don’t have time to be so fucked up about whatever you’re doing on social media or whatever. But one of the things that happened with me just recently, Tucker Carlson went after me for some reason, that guy.  WD: Badge of honor, badge of honor.  That’s not a badge of honor. He’s such a jackass. But he went after me, and he goes, “Kara Swisher, the elitist who went to private schools and this and that, and she’s untalented,” and my mom who watches Fox News and watches Tucker Carlson.  First of all, Tucker Carlson went to ... I checked into it and did the reporting. He went to a private school that was seven times more expensive than my private school and went to a more expensive college, and I was like, “You are so much more elitist than I was.” I mean, I’m elitist, sure, but it was a really interesting thing.  And what got my mom, though, was she goes, “Well, you’re not un talented. That’s just not true,” and I go, “You know, maybe the things they’re telling you are just not true .” It was an interesting moment.  Anyway, last quick question. Anybody else? Right here, very quick.  Audience member: What are you saying to the young people or kids that you have about some of the xenophobic, homophobic people they might come across, how you pay it forward. How are you teaching them to be more ...  That’s a great question.  Audience member: … to have more humility?  Go ahead, you two.  WD: They teach me, truly. They are so deeply rooted in a value that understands and fights against that as wrong, and they are leading the way with just a little bit of guidance from me in how they’re moving that value and that voice to a conversation that names it, that shames it, and that ultimately is going to overcome it or at least overcome it in a way that allows us to regain the kind of power that can suppress it and put it back into that closet that it was in before Donald Trump let it out, and everybody started wearing it loud and proud, as they do right now.  Arlan, last word?  AH: I’ll leave it at that since you work on such a great nonprofit.  Do you feel good about Gen Z? I do. I have two Gen Z kids.  AH: Oh, yeah.  WD: 100 percent.  AH: I used to be afraid of teenagers, and a teenager can still cut me a certain way by looking at me like I’m not cool, but man, I’m so impressed. I met so many teenagers recently who have been following what we’re doing, and I’m just like, when I get old it’s going to be awesome because you’re to be there. It’s so great. You’re going to take care of me. I’m really stoked. I’m really stoked.  On that note, Arlan Hamilton, Wendy Davis.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.              Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.              Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.              Apple’s plan for its new TV service: Sell other people’s TV services  Apple’s TV plans, explained. (Spoiler: Apple isn’t taking on Netflix yet.)                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 308. The sidebar size is long.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay  For FAANG companies, everyone is a frenemy.  By  Jason Del Rey                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}