{"author": "Loren Grush", "title": "Mike Pence wants NASA to put humans on the moon by 2024", "description": "Today at the fifth meeting of the National Space Council, Vice President Mike Pence declared that the Trump administration is committed to sending humans back to the Moon by 2024, four years earlier than NASA’s previous target of 2028.", "url": "https://www.theverge.com/2019/3/26/18282598/nasa-mike-pence-vice-president-space-policy-lunar-landings-2024-gateway-sls-orion", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LALdYLuvwPmHKm1jx85aO3rrRpw=/20x0:1859x963/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15988369/Screen_Shot_2019_03_26_at_3.44.22_PM.png", "publishedAt": "2019-03-26T21:16:34Z", "content": "                                                                           Log In or Sign Up     Log In    Sign Up              Tech     Reviews     Science     Entertainment     Video    Features    Podcasts    Newsletters    Store    More                   Tech      Video    Amazon    Apple    Facebook    Google      Microsoft    Samsung    Tesla    AI    Cars      Cybersecurity    Mobile    Policy    Privacy    Scooters     All Tech      Reviews      Phones    Laptops    Headphones    Cameras      Tablets    Smartwatches    Speakers    Drones      Accessories    This is my Next    How-to    Good Deals     More from Verge Guidebook      Science      Video    Space    NASA    SpaceX      Health    Energy    Environment     All Science      Entertainment      Film    TV    YouTube      Games    Fortnite    Books      Comics    Music     All Entertainment      Video    Features    Podcasts    Newsletters    Store   ✕                  Policy      Science      US & World       Mike Pence tells NASA to accelerate human missions to the Moon ‘by any means necessary’     New,   19  comments      Though he didn’t specify how to speed things up  By  Loren Grush @lorengrush    Mar 26, 2019,  5:16pm EDT        Share     Tweet        Share     Share  Mike Pence tells NASA to accelerate human missions to the Moon ‘by any means necessary’      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Vice President Mike Pence at the National Space Council Meeting  Image: NASA     Today at the fifth meeting of the National Space Council, Vice President Mike Pence declared that the Trump administration is committed to sending humans back to the Moon by 2024, four years earlier than NASA’s previous target of 2028.  Pence, speaking at NASA’s Marshall Space Flight Center in Huntsville, Alabama, noted that the administration will meet this goal “by any means necessary.” He called on NASA to adopt new policies and argued that the space agency would need to embrace “a new mindset that begins with setting bold goals and staying on schedule.” To do that, he said the administration may consider ditching some of NASA’s current contractors — which are currently developing new vehicles to take humans into deep space — and using commercially developed rockets instead. “If commercial rockets are the only way to get American astronauts to the Moon in the next five years, then commercial rockets it will be,” said Pence. “Urgency must be our watch word.”  “Urgency must be our watch word.”  However, Pence offered few clear recommendations and changes that would help to accelerate NASA’s return, apart from potentially switching rockets and contractors. “It was rhetoric about ‘by all means possible’ and ‘we’ll provide the resources necessary’ and ‘leadership is essential,’” John Logsdon, a space policy expert at George Washington University, tells The Verge . “I mean, they’re all good words. But the devil’s in the details.”            A view of the Moon from the International Space Station  Image: NASA    The administration has been very clear about its desire to return humans to the Moon since the beginning of the Trump presidency. In December of 2017, Trump signed his first space policy directive , instructing NASA to send humans back to the Moon. However, NASA has been relatively vague about its timeline for following through on this directive. Recently, the agency came up with 2028 as a placeholder date for the first humans to land on the Moon, and now the administration is expressing its displeasure with that timeline. “Ladies and gentlemen, that’s just not good enough,” Pence said during his speech.  Right now, the space agency’s strategy for getting back to the lunar surface relies on building a space station in orbit around the Moon, called the Gateway. Such a platform would serve as a way station for astronauts to travel to and from the Moon’s surface. Additionally, NASA has been focusing on developing a new monster rocket called the Space Launch System (SLS), which would be used to launch a crew capsule called Orion into deep space. Not only would the SLS send people to the Gateway, but it would also be used to deliver cargo and help bring new modules to the lunar space station. And just recently, NASA called on commercial companies to come up with designs for landers that could transport humans from the Gateway to the Moon.  “Ladies and gentlemen, that’s just not good enough.”  However, NASA does not plan to start building the Gateway until 2022, and doesn’t intend to test out the first human-rate landers on the Moon until the mid-2020s. Additionally, the SLS has suffered from a series of delays and cost overruns that threaten the current unaccelerated timeline. The rocket was originally expected to launch as early as 2017, sending the Orion capsule on a three-week-long trip around the Moon. But the rocket’s debut flight has since been pushed back to June of 2020. And recently, NASA officials admitted that the 2020 date will most likely move to 2021 — a move that apparently angered those within the administration . The delay prompted NASA to consider alternatives for launching Orion in 2020, including using commercially available rockets such as SpaceX’s Falcon Heavy or ULA’s Delta IV Heavy instead of the SLS.            An artistic rendering of the Space Launch System during launch  Image: NASA    However, faced with the charge of meeting the ambitious 2024 deadline, NASA administrator Jim Bridenstine told Pence that NASA has to have the SLS and “accelerate its agenda.” Rather than use commercial rockets, Bridenstine said that the SLS will be ready for its current launch date. “I am confident we can get to that first launch in 2020 for SLS and actually fly the crew capsule around the Moon,” Bridenstine said, though he did not elaborate on what has changed that would prevent the delay to 2021. Boeing later clarified to The Verge that it plans to deliver the core of the SLS rocket this year, and that it’s been able to accelerate development by coming up with a new plan that will allow the company to work on different sections at the same time, while piecing parts of the rocket together.  “Boeing and NASA have implemented changes in both processes and technologies to accelerate production, without sacrificing safety or quality, and we remain on schedule to deliver the first SLS core stage to NASA by the end of this year,” Boeing said in a statement. However, Boeing did note that it was struggling with flat budgets.  “To me it was a grand speech without any teeth.”  If the SLS does remain an essential part of NASA’s deep-space exploration plans, that means that something else about the agency’s current strategy needs to change. No concrete insights were given about that, though. Pence made it clear that NASA needs a greater sense of urgency and a change in culture, but he did not offer up any guarantees of more funding from the administration. “To me it was a grand speech without any teeth,” Laura Forczyk, a space consultant and owner of space research and consulting firm Astralytical, tells The Verge . “It was another big set of promises.”  In fact, this speech comes at an awkward time, as the president’s recent budget request proposed significantly cutting funding for NASA , including the budgets for SLS and Orion. And NASA officials even admitted after the budget request was released that even more funding may not be enough to accelerate development. “Getting ... to launch as fast as technically possible is a prime objective of this budget, something that more money will not accelerate,” Jeff DeWit, the chief financial officer for NASA, said during a press conference on the budget request in March. “This is a deeply technical condition in terms of getting there faster. So we are not asking for more money for us to do the job. We just need a little more time.”            An artistic rendering of NASA’s Gateway project  Image: NASA    Even if the administration decided to give more money to NASA or significantly change the agency’s plans, the executive branch can’t make those decisions alone. As is the case for all government agencies, any major funding decisions have to be approved by Congress. And when setting the annual budget, lawmakers can also set NASA’s agenda. It’s one of the reasons why the SLS remains a significant part of the space agency’s plans. The rocket is mostly being built out of Alabama — the site of today’s Space Council meeting — and this location has garnered a lot of support for the vehicle from Alabama representatives in Congress, notably Sen. Richard Shelby (R-AL). They have strived to keep the rocket alive by giving it extra funding and mandating its development, as it supplies jobs in the state.  “I applaud the call to get on with it.”  So if NASA wants to accelerate its timeline for the Gateway or its deadlines for the completion of lunar landers, Congress must approve it. Granted, Congress has been setting a precedent in recent years for giving NASA more funding than that the president’s budget requests have asked for, so it’s possible lawmakers may provide the necessary cash flow. But until that happens, Pence’s words are just that: words.  During his speech, Pence did invoke the memory of President John F. Kennedy, who made a similar bold declaration to send humans to the Moon without any guarantees from lawmakers. “Some will say it’s too hard, too risky, too expensive,” he said. “But the same was said back in 1962.” Circumstances have changed drastically since the 1960s, and we will find out this year if Congress decides to follow through on Pence’s call to action.  “It is time to go back,” says Logsdon. “So I applaud the call to get on with it.”       Next Up In Science                         Most Read                  Apple announces Apple Card credit card  Coming summer 2019              Europe’s controversial overhaul of online copyright receives final approval  The much-criticized ‘upload filter’ and ‘link tax’ will soon become law in EU nations              The Apple Card is Apple’s thinnest and lightest status symbol ever  There was one hardware announcement at Apple’s services event                 Huawei’s P30 Pro is a photographic powerhouse with a tiny notch  Huge battery, absentee bezels, and a promising new quad-camera system              All the things Apple didn’t tell us about its streaming TV service  Apple TV Plus is more mysterious than familiar                        Command Line Command Line delivers daily updates from the near-future.    email address...    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 40. The sidebar size is long.         Loading comments...            Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved          tweet     share    ", "category": "technology"}