{"author": "Catherine Shu", "title": "Google will open a new office complex and add hundreds of jobs in Taiwan", "description": "Google announced today it will expand its office space in Taiwan with a new complex in Banqiao District, New Taipei City. The space will be in Taipei Far Eastern Telecom Park, about a 20-minute drive away from its offices in Taipei 101. Google currently has 2,000 employees in the country and plans …", "url": "https://techcrunch.com/2019/03/26/google-will-open-a-new-office-complex-and-add-hundreds-of-jobs-in-taiwan/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/GettyImages-975091058.jpg?w=604", "publishedAt": "2019-03-26T14:30:05Z", "content": "                        Google will open a new office complex and add hundreds of jobs in Taiwan     Catherine Shu   @catherineshu  / 13 hours         Google announced today it will expand its office space in Taiwan with a new complex in Banqiao District, New Taipei City. The space will be in Taipei Far Eastern Telecom Park, about a 20-minute drive away from its offices in Taipei 101. Google currently has 2,000 employees in the country and plans to hire several hundred more, with an emphasis on hiring more women, said Rick Osterloh, Google’s senior vice president of hardware, during a press conference today.  The complex will also play an important role in Google’s Intelligent Taiwan project, which it announced in May 2018 . Last year, the project trained about 5,000 students in AI technology and 50,000 digital marketers.  In the wake of Project Dragonfly , Google’s controversial project to build a censored version of its search engine for China, close attention will be paid to what the company does in Taiwan and its other hubs in Asia. Google reportedly halted Dragonfly last year, before employees told The Intercept that they had seen evidence of continued work on the project. A Google spokesperson said there was no link between those issues and the expansion of its Taiwan offices.  After Google completed its $1.1 billion acquisition of a large part of HTC’s smartphone unit at the beginning of 2018, Taiwan became its biggest Asian engineering hub. Google pulled out of China in 2010, citing censorship issues, and the revelation of Project Dragonfly, an apparent reversal on its earlier stance, was met with controversy internally by Google employees. The company’s potential re-launch in China was also one of the main topics of questioning during CEO Sundar Pichai’s House Judiciary committee hearing in December.                        ", "category": "technology"}