{"author": "Jon Brodkin", "title": "Verizon refuses to admit that its “first to 5G” commercials are misleading", "description": "Ad industry self-regulator urges Verizon to pull 5G ads, but Verizon files appeal.", "url": "https://arstechnica.com/information-technology/2019/03/verizon-refuses-to-admit-that-its-first-to-5g-commercials-are-misleading/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/verizon-5g-sign-760x380.jpg", "publishedAt": "2019-03-26T16:47:42+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              More 5G word games    —  Verizon refuses to admit that its “first to 5G” commercials are misleading  Ad industry self-regulator urges Verizon to pull 5G ads, but Verizon files appeal.    Jon Brodkin - Mar 26, 2019 4:47 pm UTC         Enlarge Verizon     reader comments  81  with 62 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      The advertising industry's self-regulatory division has urged Verizon to stop claiming that it has America's first 5G network, but Verizon claims that its \"first to 5G\" commercials are not misleading and is appealing the decision.  The National Advertising Division (NAD), an investigative unit managed by the Council of Better Business Bureaus, announced its recommendation to Verizon last week. The NAD investigated after a challenge lodged by AT&T, which has been misleading customers itself by renaming large portions of its 4G network to \"5G E.\" But AT&T's challenge of Verizon's 5G ads was \"the first case involving advertising for 5G\" to come before the self-regulatory body, the NAD said. Further Reading AT&T’s “5G E” is actually slower than Verizon and T-Mobile 4G, study finds  Specifically, AT&T challenged three Verizon commercials that included claims that Verizon is \" first to 5G \" and that it has launched America's \"only 5G ultra wideband network.\" While \" ultra wideband \" does refer to real radio technology, it's more of a marketing term when Verizon uses it in the context of 5G. Verizon doesn't even always use that qualifier to describe its future 5G service—at one point, this commercial says Verizon is \"building America's first 5G network\" without the ultra wideband language.  Verizon: \"First to 5G\"  The problem is, Verizon hasn't launched any mobile 5G service, despite these ads being around since September 2018. Verizon plans to launch 5G mobile service in April, but it will initially be available only in parts of Chicago and Minneapolis and be usable only with a single Motorola phone via a hardware adapter. Despite those limitations, it'll cost $10 more per month than Verizon 4G service.  Verizon does offer a \"5G\" home Internet service in a few cities, but it's initially based on Verizon's own 5G technology instead of the industry's 5G standard, and the early rollout has reportedly been disappointingly small.  NAD: Ads' message not supported by evidence  The NAD's announcement of its ruling said the following:  NAD found that one message reasonably conveyed by the stories told in these commercials, and by some of the claims, is that Verizon has achieved the important milestone of deploying the first mobile wireless 5G network. Although NAD acknowledged that the commercials' featured stories are told in the past and future tenses, it noted that each also featured a Verizon engineer talking about Verizon's network in the present tense, using words such as now and today .  NAD concluded that by discussing the historic achievements that Verizon has already made in the field of mobile wireless technology in conjunction with present-tense claims such as \"First to 5G,\" \"building America's first and only 5G ultra wideband network,\" \"… once again, we're transforming reliability as we know it, building America's first and only 5G ultra wideband network, with unprecedented capacity enabling faster speeds,\" and \"Now, with the launch of the only 5G ultra wideband network, we're doing it again…\", Verizon reasonably conveys the unintended, and unsupported, message that 5G mobile service is currently available.  NAD also found that Verizon's advertising conveyed a comparative message. If, as advertised, Verizon is \"First to 5G\", NAD determined that this necessarily means that its competitors may be second or third.  The NAD recommended that Verizon's commercials \"be discontinued or modified in order to avoid conveying certain messages, including the unintended message that Verizon has launched [a] 5G mobile wireless network.\"  The NAD press release also explains why it found Verizon's defense unconvincing:  While Verizon argued that the \"first and only 5G network\" claims are limited to its \"ultra wideband network\" and, thus, qualified to avoid conveying the message that Verizon is the nation's only 5G network, NAD disagreed. Verizon explained that it is building the nation's only \"ultra wideband\" network based on three exclusive features of its current network: its unrefuted wide spectrum holdings, deep fiber resources, and the ability to deploy large numbers of small cells. However, NAD noted, Verizon's claim, \"America's first and only 5G ultra wideband network\" is not linked directly to the exclusive technology or benefits Verizon is claiming to provide. Consequently, to the extent that Verizon wants to use its \"first and only ultra wideband network\" claim, it can do so if it ties this claim directly to its unique technology or performance benefits.  Verizon: The ads show “corporate pride”  The NAD noted that a recommendation to modify or discontinue ads \"is not a finding of wrongdoing,\" and these recommendations have no legal force. But the system of self-regulation has halted many misleading ads because advertisers generally follow NAD recommendations.  Companies can appeal NAD recommendations to the National Advertising Review Board (NARB), which is also part of the Council of Better Business Bureaus. Verizon said it will do so.  Verizon's response to the recommendation said it \"believes NAD failed to properly evaluate the net impression of the challenged commercials\" and \"disagrees that the challenged claims or net impression of the commercials at issue convey anything more than corporate pride in its achievements and the development of its next generation 5G Ultra-Wideband Network.\"  Verizon also said it \"disagrees that reasonable consumers are likely to misunderstand its claims about its '5G Ultra-wideband network,' which is unique from networks under development by other carriers.\"  Verizon in January pledged that it won't falsely claim that 4G phones are really 5G, in response to AT&T changing phone network indicators from 4G to 5G E despite not providing any 5G smartphone service. AT&T has rolled out mobile 5G in parts of 12 cities, but for now it's only usable with a single Netgear hotspot .  We wouldn't be surprised to see future NAD cases involving AT&T's 5G E claims, but AT&T is already facing a false advertising lawsuit filed by Sprint.                reader comments  81  with 62 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Jon Brodkin Jon is Ars Technica's senior IT reporter, covering the FCC and broadband, telecommunications, wireless technology, and more.   Email  jon.brodkin@arstechnica.com  //  Twitter  @JBrodkin              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}