{"author": null, "title": "LOOPY!", "description": "a tool for thinking in systems", "url": "https://ncase.me/loopy/", "urlToImage": "http://ncase.me/loopy/social/thumbnail.png", "publishedAt": null, "content": "              In a world filled with ever-more-complex\n\t\t\ttechnological, sociological, ecological, \n\t\t\tpolitical & economic systems...\n\t\t\ta tool to make interactive simulations may not be that much help.\n\t\t\tBut it can certainly try.       play with simulations It's the ancient, time-honored way of learning:\n\t\t\t\tmessing around and seeing what happens.\n\t\t\t\tPlay with simulations to ask \"what if\" questions, and get\n\t\t\t\tan intuition for how the system works!   programming by drawing Raw code is too inaccessible.\n\t\t\t\tAlso drag-and-drop is too mainstream.\n\t\t\t\tBut with LOOPY, you can model systems by simply drawing circles & arrows,\n\t\t\t\tlike a wee baby         remix others' simulations Want to build upon your friends' models?\n\t\t\t\tOr challenge your enemies' models?\n\t\t\t\tLOOPY lets you have a conversation with simulations!\n\t\t\t\tYou can go from thinking in systems,\n\t\t\t\tto talking in systems.      NOW PLAY WITH AN EXAMPLE:      OR, MAKE A MODEL FROM SCRATCH →      Like duct tape, you can use LOOPY for all sorts of things:     However you choose to use LOOPY, hopefully it can give you not just\n\t\t\tthe software tools, but also the mental tools to understand\n\t\t\tthe complex systems of the world around us.\n\t\t\tIt's a hot mess out there.   TRY OUT LOOPY →   Happy simulating! <3      LOOPY is a part of   EXPLORABLE EXPLANATIONS   a movement to make learning active, not just passive   LOOPY is also open source and public domain,\n\t\t\tmeaning it's free for coders, educators, and just about anybody\n\t\t\tto re-use and re-mix LOOPY as they see fit. (Get the source code on Github!)   LOOPY is made by Nicky Case,\n\t\t\t( my wobsite | my tweeter ) thanks to my generous supporters on Patreon! (see them all here)  And if you like what I make, feel free to toss coins at me on Patreon . <3      share:         ", "category": "technology"}