{"author": "Angela Chen", "title": "Everything wrong with the young blood injection craze", "description": "Recently, the US Food and Drug Administration made a somewhat strange request: please don’t buy transfusions of young blood plasma to improve your health. The announcement is a conclusion of sorts to years-long hype over the tantalizing possibility that the fountain of youth can be found in the bodies of other people. Verge Science interviewed some scientists about why young blood to reverse aging became hyped, and what is real and what isn’t.", "url": "https://www.theverge.com/2019/3/26/18280967/young-blood-food-drug-administration-health-aging-longevity-parabiosis-science", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Z5APLtUvL6X1CTYHwUIGV7IAgZ0=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15986345/Textless_1.jpg", "publishedAt": "2019-03-26T14:00:00Z", "content": "                                                                           Log In or Sign Up     Log In    Sign Up              Tech     Reviews     Science     Entertainment     Video    Features    Podcasts    Newsletters    Store    More                   Tech      Video    Amazon    Apple    Facebook    Google      Microsoft    Samsung    Tesla    AI    Cars      Cybersecurity    Mobile    Policy    Privacy    Scooters     All Tech      Reviews      Phones    Laptops    Headphones    Cameras      Tablets    Smartwatches    Speakers    Drones      Accessories    This is my Next    How-to    Good Deals     More from Verge Guidebook      Science      Video    Space    NASA    SpaceX      Health    Energy    Environment     All Science      Entertainment      Film    TV    YouTube      Games    Fortnite    Books      Comics    Music     All Entertainment      Video    Features    Podcasts    Newsletters    Store   ✕                  Featured Videos      Science      Verge Video       Everything wrong with the young blood injection craze     New,   4  comments      This story has real science, overgeneralized results, lots of high hopes, and people trying to make a quick buck  By  Angela Chen @chengela    Mar 26, 2019, 10:00am EDT        Share     Tweet        Share     Share  Everything wrong with the young blood injection craze      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email             Recently, the US Food and Drug Administration made a somewhat strange request: please don’t buy transfusions of young blood plasma to improve your health. The announcement is a conclusion of sorts to years-long hype over the tantalizing possibility that the fountain of youth can be found in the bodies of other people.  To find out why that’s not exactly the case, we spoke to Irina Conboy and Michael Conboy , a husband-and-wife research team at UC Berkeley. Back in 2005, the Conboys published one of the landmark papers that kicked off this hype — but the research wasn’t looking at blood transfusions and it wasn’t exactly done in humans. That didn’t stop companies like Ambrosia Health from promising that a couple liters of blood (at $8,000 a pop) would reverse aging, even though the procedure was more likely to put people in danger.  The latest Verge Science video covers this odd story, which is about real science, overgeneralized results, lots of high hopes, and people trying to make a quick buck.    Verge Science on YouTube The home base for our explorations into the future of science.   Subscribe!           Next Up In Science                         Most Read                  Apple announces Apple Card credit card  Coming summer 2019              Europe’s controversial overhaul of online copyright receives final approval  The much-criticized ‘upload filter’ and ‘link tax’ will soon become law in EU nations                        Command Line Command Line delivers daily updates from the near-future.    email address...    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 4. The sidebar size is short.         Loading comments...            Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved          tweet     share    ", "category": "technology"}