{"author": "Vlad Savov", "title": "Huawei’s P30 Pro is a photographic powerhouse with a tiny notch", "description": "The new Huawei P30 Pro flagship has a huge battery, absentee bezels, and a promising new quad-camera system. It will compete against Samsung’s Galaxy S10 series for supremacy in the high-end Android smartphone market across Europe and Asia.", "url": "https://www.theverge.com/2019/3/26/18281466/huawei-p30-pro-price-release-date-specs-camera-photos", "urlToImage": "https://cdn.vox-cdn.com/thumbor/FoAM4hHAijxRW6RWiMwepj1toE0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15986684/huawei_p30pro_vladsavov24.jpg", "publishedAt": "2019-03-26T13:30:00Z", "content": "                                                                     Google      Huawei’s P30 Pro is a photographic powerhouse with a tiny notch  Huge battery, absentee bezels, and a promising new quad-camera system  By  Vlad Savov @vladsavov    Mar 26, 2019,  9:30am EDT           Share     Tweet        Share     Share  Huawei’s P30 Pro is a photographic powerhouse with a tiny notch      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email        What if you could have it all: super fast performance, marathon battery life, a bezel-starved screen, and a camera that competes with the Google Pixel for quality and pocket cameras for zoom? Huawei would have you believe that its new P30 Pro Android flagship is precisely that sort of no-compromise device. Announced at another gala event in Paris today, the P30 Pro addresses the few downsides of Huawei’s already excellent Mate 20 Pro from last year, and it adds a sophisticated new camera system that promises up to 10x lossless zoom. You won’t be able to buy it in a US carrier store, but this will still be one of the best-selling high-end devices across the globe this year. And probably one of the best.  Getting to grips with the P30 Pro is easy because it’s the same size, shape, and thickness as practically every other Android flagship phone on the market today. Putting this up alongside Samsung’s Galaxy S10 Plus , the handset Huawei hopes to outshine with the P30 Pro, the differences between them are minute. Huawei’s phone has a chin that’s about a millimeter thicker, and it features probably the world’s smallest notch to date, which is literally just a cutout for the camera. Huawei is omitting an earpiece on the P30 Pro, making innovative use of electromagnetic levitation to vibrate the top of the screen to generate call sound. That means there are no stereo speakers on this phone, and there are also more discreet phone calls because call sound will only propagate in one direction.              Photo: Vlad Savov / The Verge     My two biggest gripes about the Mate 20 Pro were its curved screen edges and the inconsistent in-display fingerprint sensor. The P30 Pro still has curved glass on both the front and back, but it’s a much gentler slope, something a lot closer in form to Samsung’s latest Galaxy S devices. I’m a fan of this subtler curvature both on Samsung and on Huawei’s phones. It achieves the intended softening of the edges of the device and makes for a prettier, more cohesive design, but it doesn’t deprive me of useful screen space. Huawei also says that its new in-display fingerprint scanner, which remains optical (as opposed to pressure-sensitive alternatives like Samsung’s ultrasonic one), is 30 percent faster than the one on the Mate 20 Pro.  Before getting lost in all of the details about Huawei’s new quad-camera system, it’s worth quickly noting the salient specs of the P30 Pro. This new phone is built around the 7nm Kirin 980 processor that Huawei designs itself, which I really enjoyed in my time reviewing the Mate 20 Pro and the Honor View 20 . It’s still a flagship-quality part, and it’ll remain so for the foreseeable future. Huawei will pair that with a typical 8GB of RAM and storage options from 128GB to 512GB.  The display is a 6.47-inch curved OLED panel with 2340 x 1080 resolution and a 19.5:9 aspect ratio. On the inside, there’s a massive 4,200mAh battery, which can be topped up to 70 percent full in 30 minutes using Huawei’s 40W SuperCharge wired charging. The P30 Pro also supports 15W wireless charging as well as reverse wireless charging. So yes, you’ll be able to charge your Samsung Galaxy Buds off the back of this phone, if you wish.              Huawei is today also launching a non-Pro P30, which scales the screen size down to 6.1 inches, has a smaller 3,650mAh battery, and accepts slower 22.5W charging. The P30 Pro is IP68-certified certified for dust and water resistance, whereas the P30 only extends to IP53. That may or may not be because the P30 still has a headphone jack and an earpiece, both items that the Pro model lacks. The smaller phone will also have a simpler three-camera setup, omitting the periscope zoom and the fourth, depth-detecting sensor.                                                    The big deal with the P30 Pro is its new camera setup. Huawei’s breathless marketing will tell you that it’s “rewriting the rules” of mobile photography, and while I wouldn’t go quite that far, it really does look extremely promising. First, the subtle bit: Huawei’s built a new AI-driven HDR+ mode that creates an intelligent exposure map for the entire frame of a photo and then adjusts each section of the image. It will detect faces and landscape markers, such as grass or the sun, and treat each of them appropriately. This, along with some strikingly sharp and well-exposed sample photos I was able to shoot with the P30 Pro, gives me reason for optimism that Huawei has taken steps to bridge the gap between its cameras and Google’s supreme Pixel.    P30 Pro camera specs  Ultra wide angle: 20MP, 16mm, f/2.2  Main sensor: 40MP, 27mm, f/1.6, OIS  Telephoto: 8MP, 125mm, f/3.4, OIS  Time-of-flight (ToF) camera for depth detection  Selfie: 32MP with Super HDR Shot & Super Low Light Shot    Part of what might explain the apparent improvement in image quality I noticed in my first try with the P30 Pro is the new RYYB SuperSpectrum main camera sensor. It’s still a 40-megapixel sensor that defaults to producing 10-megapixel shots by combining four pixels into one, but each pixel is now different. Huawei has replaced the RGB sub-pixel arrangement with one featuring red, blue, and yellow color sensors. And since the yellow sensors will absorb both red and green light, Huawei says this new arrangement soaks up 40 percent more light than RGB, which leads to better, cleaner photos. The SuperSpectrum part is on both the P30 Pro and the P30.             Huawei P30 Pro (left) next to Huawei P30.     The reason for that big vertical slab of cameras on the back of the P30 Pro is, of course, this phone’s zoom capabilities. In order from top to bottom: you get an ultra wide angle lens for grand architecture or big group photos, the main camera, which is now augmented with optical image stabilization, and a new periscope zoom lens that offers 5x of optical zoom. Huawei claims that, by combining the image data from the main camera and the telephoto lens, the P30 Pro can produce a 10x lossless zoom. That’ll be something to test in a review.  In my brief testing, I was most impressed with Huawei’s time-of-flight (ToF) camera and the way it enhances portrait mode on this phone. Using the depth information from the ToF sensor, Huawei is much more precise about identifying its subject and neatly separating the person from the background. But the novelty now is that Huawei is also gradating the simulated bokeh in its portrait mode: the bokeh will be less pronounced closer to the subject and increasingly softer and blurrier as you get further away from it. What that means is that you won’t get the 2D cutout effect with portrait photos. You can see a couple of the sample shots I took in the hands-on video above. The great thing about them is they were my first tries. This camera evidently makes it easy to take good photos, and that’s what every phone camera should aspire to.  On the video front, Huawei is promising to add a Dual Video recording function that will shoot simultaneous video from both the main and the telephoto sensor, combining them into a single widescreen side-by-side video. This will come as part of a future software update.              If I haven’t made it obvious yet, I’m excited for the Huawei P30 Pro. Huawei, despite its clashes with US regulators and a chronic inability to keep its new phones secret, keeps improving at a rate that few other smartphone manufacturers can match. Questions around Huawei’s EMUI user experience and that new fingerprint sensor remain to be answered, but in terms of pure engineering firepower, the P30 Pro gives you about as much performance as you can ask for today.  Huawei is pricing the P30 Pro at €999 with 8GB of RAM and 128GB of storage, or €1,099 for the 8GB / 256GB configuration, or €1,249 for 8GB / 512GB. The P30 will cost €799 with 6GB of RAM and 128GB of storage. Both phones are going on sale immediately, and the P30 Pro is available in a new blue gradient color variation called Breathing Crystal, along with a Pearl White, an iridescent red called Amber Sunrise, Huawei’s signature Aurora, and a basic Black.        Grid View                             Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge         Photo by Vlad Savov / The Verge               Photography by Vlad Savov / The Verge    The Verge on YouTube Exclusive first looks at new tech, reviews, and shows like Better Worlds.   Subscribe!                 Processor with Dieter Bohn   Apple still has a lot to prove with its new subscription services      Tech   Asus just patched the ShadowHammer malware that was masquerading as a security update      Apple   The Apple Card is a perfect example of Apple’s post-iPhone strategy    View all stories in Tech         Loading comments...              Chorus      Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Tip Us  Community Guidelines  About  Ethics Statement    All Systems Operational Check out our status page for more details.      Vox Media  Advertise with us  Jobs @ Vox Media © 2019 Vox Media , Inc. All Rights Reserved           tweet     share             ", "category": "technology"}