{"author": "Jason Del Rey", "title": "Apple’s credit card is competition for the banks that built Apple Pay", "description": "The new Apple credit card the company announced on Monday does more than give its users cash back and cool iPhone features — it also means Apple is going head to head with the same big banks it needed to get its Apple Pay service off the ground in the first place.", "url": "https://www.recode.net/2019/3/25/18281302/apple-card-goldman-sachs-iphone-apple-pay", "urlToImage": "https://cdn.vox-cdn.com/thumbor/PDwLIiaPMqU0V-FvZwmQOQT9duY=/0x117:1632x971/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15986107/Apple_Card_hand_iPhoneXS_payment_032519.jpg", "publishedAt": "2019-03-25T21:59:40Z", "content": "                                                     Log In or Sign Up     Log In    Sign Up              Topics     Writers     Podcasts    Events    More                   Topics      Charts    Commerce    Finance and VC      Future of Work    Media    Policy      Social    Transportation    Voices       Writers      Kara Swisher    Peter Kafka    Jason Del Rey      Shirin Ghaffary    Eric Johnson    Rani Molla      Theodore Schleifer    Kurt Wagner       Podcasts    Events   ✕                  Apple      Apple Pay      Payments       Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay   For FAANG companies, everyone is a frenemy.  By  Jason Del Rey @DelRey    Mar 25, 2019,  5:59pm EDT        Share     Tweet        Share     Share  Apple’s new credit card means the tech giant is now battling the same banks that built Apple Pay      share     tweet       Linkedin          Reddit       Pocket         Flipboard     Email                    Apple introduced Apple Card on Monday, March 25, at an event in Cupertino, Calif.  Apple     The new Apple credit card the company announced on Monday does more than give its users cash back and cool iPhone features. It also pits Apple against the same big banks it needed to get its Apple Pay service off the ground more than four years ago.  The Apple Card, backed by Goldman Sachs, carries no fees and 2 percent “daily” cash back when someone uses it to make a purchase via Apple Pay’s payment service. Apple Pay is an increasingly popular payment method in apps and on websites, and can also be used for tap-to-pay phone payments in brick-and-mortar stores.  That means Apple is now going to be competing with banks like Chase and Citi to get iPhone users to choose the Apple Card as the default card for Apple Pay payments.  “They relied on a whole ecosystem of banks to build out Apple Pay to get it to where it is today, and now they’re making a conscious decision to compete directly with those partners,” said Jordan McKee, research director at 451 Research.  Apple’s move is just the latest example of the biggest players in the tech industry leveraging their dominance among modern consumers for cooperation from titans of traditional industries. Often, that cooperation turns into competition.  The Apple Card will also allow iPhone users to track their weekly and monthly spending across shopping categories. At least for now, those features don’t appear to be open to iPhone users using another bank’s card.  “They’re not just competing in Apple Pay, but they are [also] opening up features only for the Apple Card that other banks can’t leverage,” McKee said.  Still, it’s tough to want to shed tears for America’s big banks. They have a history of making big money by selling your data so marketers have a new contact to hawk their services or wares. They’ve also collectively made fortunes by charging sometimes-usurious penalty interest rates and other late fees . It seems, at least initially, as though Apple is taking a shot directly at the industry by prioritizing privacy with no data sharing or selling, as well as biometric authentication. The card also carries no fees and no penalty interest rates.  For years, Apple downplayed the idea that it would ever compete with the banks. After all, Apple need those credit cards so consumers could utilize Apple Pay. Now, Apple is establishing itself as a competitor in financial services. And it feels like just the beginning.        Recode Daily  Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.      Your email    Subscribe     By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy.           More From Recode     Recode Daily: Apple’s preview of its video service raises more questions than it answers    Investing in Uber’s IPO means investing in Uber’s rivals    We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it    Recode Daily: Inside Apple’s push toward the services side of its business    American consumers spent more on Airbnb than on Hilton last year    Full Q&A: Backstage Capital founder Arlan Hamilton and Deeds Not Words founder Wendy Davis on Recode Decode               Most Read               We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.              American consumers spent more on Airbnb than on Hilton last year  That means Airbnb now owns about 20 percent of the entire US consumer lodging market.                   Recode Daily Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.     Your email    Subscribe   By signing up, you agree to our Privacy Policy and European users agree to the data transfer policy. This Article has a component height of 10. The sidebar size is short.        The Latest            Recode Daily: Apple’s preview of its video service raises more questions than it answers  Plus: Uber and Lyft drivers protest for higher pay, Google rolls out public events, and Apple launches a credit card.  By  Shirin Ghaffary                 Investing in Uber’s IPO means investing in Uber’s rivals  What is Uber? It’s an amalgamation of a bunch of Ubers of other countries.  By  Theodore Schleifer                 We still don’t know what’s in Apple’s streaming video service, how much it will cost or why we should pay for it  Oprah? Sure. Reese, Jen, and Steven, too. But Apple’s preview raises more questions than it answers.  By  Peter Kafka                 Recode Daily: Inside Apple’s push toward the services side of its business  Plus, Uber acquires a Dubai rival, Los Angeles seeks scooter company data, and Boeing updates its 737 Max-8.  By  Shirin Ghaffary                       Chorus    Terms of Use  Privacy Policy  Cookie Policy  GDPR Commitment  Communications Preferences    Contact  Send Us a Tip  Masthead  Sponsorships  Podcasts  Newsletters  RSS            A Verge affiliate site  Vox Media  Advertise with us  Jobs @ Vox Media       All Systems Operational Check out our status page for more details.     2018 Vox Media, Inc. All Rights Reserved             tweet     share    ", "category": "technology"}