{"author": "Jon Brodkin", "title": "Music labels sue Charter, complain that high Internet speeds fuel piracy", "description": "Sony, Universal, Warner claim Charter refused to kick music pirates off network.", "url": "https://arstechnica.com/tech-policy/2019/03/music-labels-sue-charter-complain-that-high-internet-speeds-fuel-piracy/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/getty-music-pirate-760x380.jpg", "publishedAt": "2019-03-25T20:50:53+00:00", "content": "                              Skip to main content           Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums    Subscribe           Close           Navigate   Store  Subscribe  Videos  Features  Reviews    RSS Feeds  Mobile Site    About Ars  Staff Directory  Contact Us    Advertise with Ars  Reprints      Filter by topic   Biz & IT  Tech  Science  Policy  Cars  Gaming & Culture  Store  Forums      Settings    Front page layout    Grid      List      Site theme    Black on white       White on black           Sign in      Comment activity  Sign up or login to join the discussions!         Stay logged in  |  Having trouble?      Sign up to comment and more  Sign up              Pirates love fast Internet    —  Music labels sue Charter, complain that high Internet speeds fuel piracy  Sony, Universal, Warner claim Charter refused to kick music pirates off network.    Jon Brodkin - Mar 25, 2019 8:50 pm UTC         Enlarge  / \"Yarr, matey, a pirate would be lost at sea without a swift broadband connection.\" Getty Images | OcusFocus     reader comments  242  with 167 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit      The music industry is suing Charter Communications, claiming that the cable Internet provider profits from music piracy by failing to terminate the accounts of subscribers who illegally download copyrighted songs. The lawsuit also complains that Charter helps its subscribers pirate music by selling packages with higher Internet speeds.  While the act of providing higher Internet speeds clearly isn't a violation of any law, ISPs can be held liable for their users' copyright infringement if the ISPs repeatedly fail to disconnect repeat infringers.  The top music labels—Sony, Universal, Warner, and their various subsidiaries—sued Charter Friday in a complaint filed in US District Court in Colorado. While Charter has a copyright policy that says repeat copyright infringers may be disconnected, Charter has failed to disconnect those repeat infringers in practice, the complaint said:  Despite these alleged policies, and despite receiving hundreds of thousands of infringement notices from Plaintiffs, as well as thousands of similar notices from other copyright owners, Charter knowingly permitted specifically identified repeat infringers to continue to use its network to infringe. Rather than disconnect the Internet access of blatant repeat infringers to curtail their infringement, Charter knowingly continued to provide these subscribers with the Internet access that enabled them to continue to illegally download or distribute Plaintiffs' copyrighted works unabated. Charter's provision of high-speed Internet service to known infringers materially contributed to these direct infringements.  The complaint accuses Charter of contributory copyright infringement and vicarious copyright infringement. Music labels asked for statutory damages of up to $150,000 for each work infringed or for actual damages including any profit Charter allegedly made from allowing piracy. The complaint focuses on alleged violations between March 24, 2013 and May 17, 2016.  During that time, plaintiffs say they sent infringement notices to Charter that \"advised Charter of its subscribers' blatant and systematic use of Charter's Internet service to illegally download, copy, and distribute Plaintiffs' copyrighted music through BitTorrent and other online file-sharing services.\" The music industry's complaint repeatedly focused on BitTorrent and other peer-to-peer networks, saying that \"online piracy committed via BitTorrent is stunning in nature, speed, and scope.\"  Lawsuit: High speeds enabled piracy  The music labels' complaint also seems to describe the basic acts of providing Internet service and advertising high speeds as nefarious:  Many of Charter's customers are motivated to subscribe to Charter's service because it allows them to download music and other copyrighted content—including unauthorized content—as efficiently as possible. Accordingly, in its consumer marketing material, including material directed to Colorado customers, Charter has touted how its service enables subscribers to download and upload large amounts of content at \"blazing-fast Internet speeds.\" Charter has told existing and prospective customers that its high-speed service enables subscribers to \"download just about anything instantly,\" and subscribers have the ability to \"download 8 songs in 3 seconds.\" Charter has further told subscribers that its Internet service \"has the speed you need for everything you do online.\" In exchange for this service, Charter has charged its customers monthly fees ranging in price based on the speed of service.  That paragraph from the music labels' complaint merely describes the standard business model of Internet providers. There is nothing illegal about offering higher Internet speeds in exchange for higher prices.  But the labels also allege that Charter's lax approach to copyright enforcement helped it earn more revenue, in part because piracy supposedly inspired consumers to subscribe to faster Internet tiers.  \"For those account holders and subscribers who wanted to download files illegally at faster speeds, Charter obliged them in exchange for higher rates. In other words, the greater the bandwidth its subscribers required for pirating content, the more money Charter made,\" the complaint said. Further Reading Rightscorp wins landmark ruling, Cox hit with $25M verdict in copyright case  The complaint argues that, while Charter performs network management to block \"spam and other unwanted activity,\" the ISP \"has gone out of its way not to take action against subscribers engaging in repeated copyright infringement.\"  \"Charter condoned the illegal activity, because it was popular with subscribers and acted as a draw to attract and retain new and existing subscribers. Charter's customers, in turn, purchased more bandwidth and continued using Charter's services to infringe Plaintiffs' copyrights,\" the complaint said. \"Charter undoubtedly recognized that if it terminated or otherwise prevented repeat infringer subscribers from using its service to infringe or made it less attractive for such use, Charter would enroll fewer new subscribers, lose existing subscribers, and ultimately lose revenue.\"  Infringement notices that music labels send to Charter and other ISPs identify violators by their IP addresses.  \"Because the copyright holders could only determine the unique IP addresses of an ISP's infringing subscribers but not their actual identities, they served subpoenas on Charter and other ISPs to obtain the infringing subscribers' names and contact information,\" the complaint said. \"Although Charter's customer agreements allowed it to produce that information and no real doubt existed as to their customers' underlying infringement, Charter vigorously opposed the subpoenas, undermining the record companies' efforts to curb direct infringement activity.\"  When contacted by Ars, a Charter spokesperson said, \"We will defend against these baseless allegations.\" We asked Charter if it ever terminates the accounts of alleged copyright infringers, but the company provided no answer.  Industry has sued several ISPs  The record companies last week also sued Charter subsidiary Bright House Networks in US District Court in the Middle District of Florida, a TorrentFreak article noted. Music labels had previously sued ISPs such as Cox and Grande Communications.  Under the Digital Millennium Copyright Act, ISPs cannot be held liable for Internet users' copyright infringement if the ISPs \"'adopt and reasonably implement' a repeat infringer policy that provides for termination of users' accounts 'in appropriate circumstances,'\" an EFF explainer notes. But the law is vague enough that courts have had to interpret its meaning in various cases over the years.  In 2013, AT&T and other ISPs began using a \" six-strikes \" Copyright Alert System, working in conjunction with the Motion Picture Association of America (MPAA) and the Recording Industry Association of America (RIAA). The system ended up doing little to thwart copyright infringement and was shut down early last year . Further Reading AT&T steps up copyright enforcement, kicks customers off network  Music publishers have called on ISPs to filter out pirated content, and they have filed various lawsuits against ISPs. Cox lost a jury verdict in a music piracy case in 2015. Another lawsuit involving Cox was settled last year, but Cox faces yet another lawsuit filed in August 2018 .  In the Grande case , a federal judge this month ruled that Grande does not qualify for a legal safe harbor because of the ISP's \"complete abdication of [its] responsibilities to implement and enforce a policy terminating repeat copyright infringers.\"  While ISPs have often resisted disconnecting alleged pirates, AT&T recently terminated the broadband service of more than a dozen customers who were accused multiple times of copyright infringement.  Disclosure: The Advance/Newhouse Partnership, which owns 13 percent of Charter, is part of Advance Publications. Advance Publications owns Condé Nast, which owns Ars Technica.    Promoted Comments       bayoublue  Wise, Aged Ars Veteran   et Subscriptor    jump to post    If anyone can make me hate Charter less, it is the RIAA.       108 posts | registered 12/1/2017         crhilton  Ars Tribunus Militum     jump to post    This argument seems blatantly stupid when we're talking about 2-4MB files that you're going to listen to hundreds if not thousands of times.  People happily pirated music over 56K.       2243 posts | registered 12/21/2011         RuralNinja  Wise, Aged Ars Veteran     jump to post    Going by their insane logic, shouldn't the music companies also find themselves liable for manufacturing a product that is so easy to be pirated? Makes as much sense as suing Charter for providing the internet it took place on.       171 posts | registered 8/2/2012                    reader comments  242  with 167 posters participating    Share this story   Share on Facebook  Share on Twitter  Share on Reddit         Jon Brodkin Jon is Ars Technica's senior IT reporter, covering the FCC and broadband, telecommunications, wireless technology, and more.   Email  jon.brodkin@arstechnica.com  //  Twitter  @JBrodkin              You must login or create an account to comment.       Channel Ars Technica      ← Previous story  Next story →      Related Stories       Sponsored Stories  Powered by       Today on Ars              Store  Subscribe  About Us  RSS Feeds  View Mobile Site      Contact Us  Staff  Advertise with us  Reprints      Newsletter Signup  Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox.                 CNMN Collection WIRED Media Group © 2019 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 5/25/18) and Privacy Policy and Cookie Statement (updated 5/25/18) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy .  Your California Privacy Rights The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices                ", "category": "technology"}