{"author": "Napier Lopez", "title": "Here’s why the Huawei P30 Pro’s camera could redefine smartphone photography", "description": "Huawei‘s P20 Pro and Matte 20 Pro had the best camera hardware of any smartphone in 2017, bar none. Sure, the Pixel 3 had my favorite camera – Google’s image processing is still the best – but Huawei managed to combine solid, versatile software with a giant camera sensor and triple lens setup that remains unmatched a […]", "url": "https://thenextweb.com/plugged/2019/03/26/heres-why-the-huawei-p30-pros-camera-could-redefine-smartphone-photography/", "urlToImage": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F03%2FP30-4-of-5.jpg&signature=3a07835b8d914c8d541f5925256ed3e7", "publishedAt": "2019-03-26T23:17:07Z", "content": "         TNW News   Latest  Hard Fork  Plugged  The Next Police  IoT Lab  Investing 2.0  Fundamentals     More TNW   News  Events    - TNW Conference 2019    - Hard Fork Decentralized 2018     Enterprise  Intelligence  Answers  Spaces   About TNW   About  Team  Advertise  Jobs  Contact                News  Events ▾    TNW Conference 2019    Hard Fork Decentralized 2018     Business ▾    Index    TNW X     AMAs  Spaces    About  Team  Advertise  Jobs  Contact      Latest  Hard Fork  Plugged  The Next Police  Fundamentals  IoT Lab  Investing 2.0       STARTS IN     ·  :  ·  :  ·  :  ·     GET TICKETS          Have a cookie    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.    Got it!  or More info                The TNW2019 map is here – 40,000m2 of tech festival! Check it out →               Gadgets for humans            Gear  Huawei  Huawei  P30 Pro   Here’s why the Huawei P30 Pro’s camera could redefine smartphone photography  Huawei is raising the bar on what smartphone cameras are capable of                            Story by  Napier Lopez       85  Shares                Huawei‘s P20 Pro and Matte 20 Pro had the best camera hardware of any smartphone in 2017, bar none. Sure, the Pixel 3 had my  favorite  camera – Google’s image processing is still the best – but Huawei managed to combine solid, versatile software with a giant camera sensor and triple lens setup that remains unmatched a year later. The P20 Pro remained at the top of DxOMark until the P30 and P30 Pro were revealed today .  My point is, it would’ve been easy for Huawei to just make a minor tweak here or there and call it a day, perhaps focusing primarily on the software side of things as Google and Samsung have done the past for the past couple of years. Instead, Huawei decided to raise the bar far higher with the P30 and P30 Pro, creating the most deliciously overkill camera  on a smartphone yet. Huawei thinks it’s a game-changer, and though I only spent a few minutes with the phones, I’m inclined to agree.      It’s a shame so much of the device has already leaked, because it dampens the impact of what Huawei is doing here. There are two key changes in particular.  First is a telephoto ‘periscope’ lens that allows for 5x  optical  zoom – meaning little to no sharpness degradation. No, Huawei isn’t the first to propose the idea, but it’s the first to execute it.  Instead of a traditional glass stack, this lens uses a mirror to fold like a periscope. It allows for a greater zoom value than what the physical confines of a cellphone would typically allow without a dramatic drop in performance.  For some context, the telephoto lens on the iPhone XS and Galaxy S10 only provide 2x optical zoom. In fact, though we call them telephoto lenses, they wouldn’t qualify as such in traditional photography. Their  equivalent focal length  is approximately 52mm, which lies strictly in the “normal” range.   The P30 Pro‘s telephoto, on the other hand, is equivalent to a 125mm lens; it’s probably the first honest-to-goodness telephoto lens on a smartphone.  Huawei didn’t stop there either. The company claims that using 10x “hybrid” zoom – combining optical zoom with data from the other sensors – there’s virtually no degradation. And for those times you really just need to zoom and don’t care as much about image quality, the camera supports 50x digital zoom.  And that’s not even factoring the ultrawide, which makes the P30 Pro’s focal length range something like a mini DSLR with almost every lens you could need.  Second is a major update to the primary 40MP sensor. Huawei is using a new type design it calls a ‘SuperSpectrum sensor’.  Its aim is to capture much more light than previously possible – enough to apparently challenge full-frame cameras.   If you’re into the technical side of photography, you’ve probably seen the above image before. It’s called a Bayer filter, and it’s how the vast majority of cameras ‘see’ color. Camera sensors are fundamentally monochrome, but the Bayer filter attenuates the amount of light arriving at the sensor depending on its color. This – plus some complicated math – allows monochrome sensors to reconstruct a color image. The problem is that, by definition, a filter limits the light that hits the camera sensor.  Huawei‘s solution: use brighter filters. Specifically, it changed all the green spots – which make up the majority of a Bayer filter – to yellow. The new sensor is able to capture 40 percent more light than its predecessor and required a revamping of the entire camera stack – particularly as yellow isn’t a primary color of light.  The end result is a camera that can all but see in the dark. The average smartphone camera works at up to ISO 6,400. The P20 Pro reached 102,400. The P30 Pro reaches ISO 409,600 . That’s firmly in full-frame DSLR territory. The ISO rating is better than a Canon 5D Mark IV, and matches Sony’s low light king, the A7s II. Of course, that’s not to say the P30 Pro’s images will be quite so clean in low light, but it indicates Huawei thinks its images at low ISO are at least usable.  But Huawei didn’t stop there, making other improvements throughout:   Huawei has widened the aperture from F1.8 to F1.6  Huawei added OIS to the primary sensor  The P30 and P30 Pro use AI to improve HDR performance  Macro mode lets you get as close as 2.5cm  A time-of-flight depth sensor improves AR tricks, and the P30 Pro can now do measurements using AR.  Huawei claims portrait is good enough to (finally) work around odd chunks of hair. Portrait mode now applies a more detailed multi-layer depth map that’s closer to a DSLR or mirrorless camera  You can also now simulate slow shutter effects – such as silky water effects – without a tripod.  Video has been improved in both stability and low light performance.    Don’t sleep on the standard P30 either. It’s basically the same setup, except with a more pedestrian 3x telephoto lens, no time-of-flight sensor, and a primary sensor with an F1.8 aperture and no OIS. Despite being the lower-end model, Huawei says the standard P30 should significantly outperform last year’s P20 Pro and Mate 20 Pro.  I was able to shoot with the cameras for a few minutes at a preview event. Unfortunately, it was during the daytime, so I couldn’t quite test Huawei‘s low light claims, but taking a few photos in a dark indoor space yielded impressive results.  I did have fun playing around with the new periscope lens. Huawei‘s claim that 10x zoom shows no sharpness degradation seemed to hold true, and it’s certainly true at 5X, although the sensor is significantly worse than the primary shooter. If anything, I’m actually a little concerned at how good the zoom feature is. 50x digital zoom lets you get creepily close to strangers hundreds of feet away.  Whatever you may think of Huawei as a global company right now – security risks shouldn’t be taken lightly – the company deserves praise for doing more to advance smartphone photography than anyone but Google. Or perhaps even more than Google.   Though the Pixel 3 has remained my favorite camera, there are obvious faults that could be remedied with better hardware (which has only mildly improved since the original Pixel). As I’ve written before, I expect more from a phone that costs near a grand. While you can do amazing things with software processing, it’s still no replacement for good hardware. There’s a reason professionals still use DSLRs.  Huawei‘s showing smartphone hardware still has room for significant improvement. And perhaps more importantly, there’s no reason you can’t advance both hardware and software at once.  I still think the company’s noise reduction and sharpening are too aggressive, so I’ll leave final judgement until I spend more time with the device. Nonetheless, the P30 Pro‘s versatility in various shooting scenarios – from ultrawide to super-telephoto, from broad daylight to super-low-light – could very well redefine what we expect from smartphone photography. I anticipate we’ll see many copycats in the months to come. The bar has been set.   TNW Conference 2019 is coming! Check out our glorious new location, inspiring lineup of speakers and activities, and how to be a part of this annual tech bonanza by clicking here .  For more gear, gadget, and hardware news and reviews, follow Plugged on  Twitter  and  Flipboard .  For more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard .  Published March 26, 2019 — 23:17 UTC               Napier Lopez  March 26, 2019 — 23:17 UTC     Read more        Most popular      Xiaomi’s new 100W charger will charge your phone in just 17 minutes                            The Heart of Tech™      More TNW   News  Events  Enterprise  Intelligence  Answers  Spaces       About TNW   About  Team  Advertise  Jobs  Contact          Stay tuned    Thank you!       Weekly     Daily     Breaking         OK                  Copyright © 2006—2019.  All rights reserved.  Made with ♥ in Amsterdam.              ", "category": "technology"}