{"author": "Cherlynn Low", "title": "Huawei P30 Pro hands-on: Another bid for smartphone camera glory", "description": "A new type of camera sensor could lead to excellent low light performance.", "url": "https://www.engadget.com/2019/03/26/huawei-p30-pro-hands-on-quad-camera/?utm_campaign=homepage&amp;utm_medium=internal&amp;utm_source=dl", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fimg.vidible.tv%2Fprod%2F2019-03%2F26%2F5c999103791cad1605e05a14%2F5c99915d573ec644bb36e35c_o_U_v1.jpg&client=amp-blogside-v2&signature=f7c1b1ab4afe2f6b978cbc4206329dfe4d204342", "publishedAt": "2019-03-26T13:30:00Z", "content": "                                               Login                        Home        Gear        Gaming        Entertainment        Tomorrow        The Buyer's Guide        Video        Reviews                                      Log in        Sign up                                                                 Show More Results                               3 related articles                                      Login                            FTC will examine privacy policies at major internet providers             Apple News app kept crashing after iOS 12.2 update             Apple News+ has issues, but it's a great deal for casual readers                   Latest in Gear               Google streamlines two-step verification with security keys       3h ago  View             VP Pence wants US astronauts back on the Moon by 2024       5h ago  View             FTC will examine privacy policies at major internet providers       7h ago  View             Google forms an external council to foster 'responsible' AI       7h ago  View             Image credit:                       Save                                                Huawei P30 Pro hands-on: Another bid for smartphone camera glory  The company continues its focus on mobile photography with intriguing new sensor tech.           Cherlynn Low , @cherlynnlow  15h ago\n          in Mobile          Comments      116  Shares             Share              Tweet              Share              Save                                            Since it first partnered with Leica on the P9 , Huawei has focused on delivering unique cameras on its flagships. With the P30 and P30 Pro, the company continues that tradition by serving up a four-camera setup with an intriguing new sensor that promises vastly improved performance in low light.            The four cameras on the P30 Pro are a 40-megapixel Super Spectrum sensor, an ultra-wide 20-megapixel one, a so-called \"Periscope zoom\" setup that offers 5x optical zoom, as well as a time of flight depth-sensing camera.            Gallery: Huawei P30 and P30 Pro hands on | 34 Photos         34                       +30              You'll mainly be using the Super Spectrum camera, which to me is the most intriguing feature. Instead of using an RGB color filter on top of the monochrome layer of the sensor, Huawei swapped out the greens for yellow, which it says lets in more light (since yellow light has longer wavelengths than green).The company then recalibrated its processing algorithms to calculate the right color values from yellow. The benefit of this is much better light sensitivity. In fact, Huawei said the P30 Pro can actually go up to ISO 409,600. And while the regular P30 can only hit ISO 204,800, that's still twice what the P20 Pro is capable of (ISO 102,400). I took the P30 Pro into a dark hallway to shoot some plates of yummy snacks and was surprised at how bright the image looked. It was impressively sharp with rich colors, and looked almost as if I'd taken it in a regularly lit office. This improved light sensitivity can also be used in videos or under regular daylight to get higher shutter speeds. When you need to squeeze more of the scene into your shot, the 20-MP ultra wide angle camera comes in handy. Huawei says it has a field of view larger than 120 degrees, though it declined to share exact numbers. I switched lenses while pointing the P30 Pro at a nearby building. Initially, I was only able to frame one tower and half of another from a rooftop patio across the street. Switching over to the ultra-wide lens let me squeeze in other adjacent skyscrapers from about a block away on either side. I used the zoom camera to get up close to some windows and details on the edge of the building, as well as some spines of books on a shelf. I was surprised at the clarity I got even at 10x zoom, and could clearly see the stamped leather texture of book covers. This combination of super wide and close-up cameras will very likely make the P30 Pro incredibly useful at concerts, vast fields or almost any potentially challenging shooting situation. Unfortunately, I didn't get to try out the time of flight sensor specifically, since Huawei said it doesn't do anything yet. It's supposed to help with some AR tools like measuring the length, width and height of objects around you. This function could be very helpful, but I'll have to wait till I get to test it out to judge. Still photography has long been a focus for Huawei, but with the P30 and P30 Pro, it's turning its attention to videography. On the latest flagships, the company uses a combination of optical and AI stabilization to reduce shaky cam effects. You can make use of the 10x hybrid zoom when filming, too. When I tried getting up close with a distant window while recording a clip though, the footage had a weird jitter. I didn't see this distortion when filming at less than 3x zoom, though. There's a fifth camera on the P30s, and that's the 32MP selfie shooter. That seems a tad excessive for selfies, but the pictures I snapped with the P30 Pro looked pleasant anyway. Huawei tweaked its HDR algorithms with AI to better capture the detail in your face even if there's a very bright light source behind you, though it did tend to wash out the background a bit. The camera is housed in a tiny notch at the top of the edge-to-edge display, and this cutout is smaller than those you'll find on the P20 Pro , the Galaxy S10+ , the iPhone XS Max and the Pixel 3 XL . To be fair, Samsung's flagship keeps its notch tucked away in the top right corner so it feels less obtrusive, but I found the P30 Pro's cutout easy to ignore.         Cherlynn Low / Engadget          The rest of the P30 Pro's 6.47-inch curved OLED panel is bright and vibrant, and the rounded sides make the phone feel classier than its predecessor. The regular P30 has a flat 6.1-inch screen, so it feels a little less elegant than its larger brother. Both the P30 and P30 Pro have a 2,340 x 1,080 resolution, making the bigger handset slightly less pixel dense. I didn't notice a significant difference in image quality, but I do wish they were both a bit brighter -- they were a little tough to see outside, even on a cloudy day. Under the screen lies another intriguing piece of technology, though I didn't get to test it out as the company only mentioned it briefly. The P30 Pro will also pack a new speaker feature that will deliver audio through the screen, vibrating the sound to the user. But why? Well it should mean no one else can hear your calls, to start with. Plus, it leaves one less thing to clutter up the front of the phone. Huawei also uses an in-display fingerprint sensor on the P30s, just like it did with the Mate 20 . Instead of opting for an ultrasonic fingerprint sensor like Samsung did on the Galaxy S10s, Huawei is continuing to use an optical scanner, which could be less secure since it only scans an image of your fingerprint instead of actually reading the ridges on your skin. I did appreciate Huawei's helpful onscreen indicators though, and the P30 Pro logged me in pretty quickly -- within a second of my touching the screen. In fact, the new flagships felt remarkably swift during my hands-on. The Kirin 980 chipset with 6GB of RAM is a beefy combination, but Huawei also worked to improve its EMUI 9.1 software overlay on top of Android 9 Pie . The company said it tweaked its software so that launching an app is now 52 percent faster than before, while the response time of a tap is now 69 percent faster. These upgrades showed when I launched app after app, and jumped from settings to Google Maps to Chrome. The phone didn't feel like it was simply keeping up, it felt like the P30 Pro was almost pre-empting my moves. Buildings even popped up instantly when I zoomed in on cities in Google Maps. Still, the P30 Pro I was using was brand new, and I expect that over time and with other processes and apps running, the performance will be different. Huawei also offers a couple of rather specific special software features on the P30s. If you own an Audi car, you can use your P30 as a key via the new Audi Connect digital key. For gym rats, you can pull your information directly from a compatible treadmill into the Huawei Health app, and those who own Huawei laptops can seamlessly send files and record their notebook screens with the OneHop service. These all sound somewhat useful, though their appeal is clearly limited. Powering the P30 Pro is 4,200mAh battery (3,650mAh on the P30), which Huawei says will last over 24 hours even with heavy use. Plus, with the company's new 40W Super Charge technology, you can get the P30 Pro up to 70 percent in just 30 minutes. The regular P30 doesn't offer the new fast charging standard, though both phones do offer reverse wireless charging like the Galaxy S10 (and the Mate 20 Pro). With this, you can juice up compatible accessories by placing the device on your phone. I didn't get to test this out so I'm not exactly sure how it works yet, and Huawei hasn't shared what wireless charging standard this is compatible with. Finally, all this is wrapped up in a gorgeous frame. Huawei's P series is known for its unique and attractive finishes, and the P30s come in an array of gradients that I couldn't help but gawk at. There's the signature Aurora finish that's a white-purple gradient, a green-purple option called \"Breathing crystal,\" a white-pink-yellow flavor called \"Pearl white,\" an orange-red version called \"Amber sunrise,\" and a basic black for the less adventurous. The P30 and P30 Pro seem like they have a lot to offer. They're powerful, attractive flagships with versatile cameras and some unique features. In the UK, at least, the P30 Pro is priced at £899 for 128GB model, or £1099 for the 512GB model, while the P30 will cost £699 at launch. But chances are, they'll never make their way to the US. So, best to keep your excitement in check. Mat Smith contributed reporting.             In this article:  cameras , gadgetry , gadgets , gear , huawei , huawei p30 , huawei p30 pro , huaweip30 , huaweip30pro , mobile , samsung , smartphone        116  Shares             Share              Tweet              Share              Save                        Comments       Sign In                     35m                  35m ago in    AV      ‘Angry Birds: Isle of Pigs’ washes ashore on PlayStation VR     The VR game has 13 new levels and could see 100 levels by the end of the year.             By  C. Fisher , 35m ago               Save                                                    View              1h                  1h ago in    AV      'Anthem' patch taps into NVIDIA's AI-powered antialiasing     The update boosts framerate and allows you to replay critical missions.             By  A. Khalid , 1h ago               Save                                                    View              3h                  3h ago in    Security      Google streamlines two-step verification with security keys     You'll even have your choice of Bluetooth keys.             By  J. Fingas , 3h ago               Save                                                    View              4h                  4h ago in    Transportation      Disposable delivery drones pass test with US Marines     The one-time use drones can carry more than 1,000 pounds of supplies.             By  A. Khalid , 4h ago               Save                                                    View              5h                  5h ago in    Space      VP Pence wants US astronauts back on the Moon by 2024     There's one problem: the budget might not be there for it.             By  J. Fingas , 5h ago               Save                                                    View       More Stories     From around the web                            About    About Engadget  About Our Ads  Advertise  Brand Kit  Buyers Guide  Contact Us  RSS Feed         Sections    Reviews  Gear  Gaming  Entertainment  Tomorrow  The Buyer's Guide  Video  Podcasts  Deals         Contribute    Comment Guidelines  Send us a tip!  Support         International    繁體中文  简体中文  日本版  UK         Apps    Android  iPhone  iPad              Join Our Newsletter        Subscribe          Follow Us                                                              © 2019 Verizon Media. All rights reserved.        Learn More    Reprints and Permissions    Suggestions    Privacy Policy (Updated)    Terms of Service (Updated)    Trademarks    Advertise           ", "category": "technology"}