{"author": "Catherine Shu", "title": "Hong Kong-based fintech startup Qupital raises $15M Series A to expand in mainland China", "description": "Qupital, a fintech startup that bills itself as Hong Kong’s largest trade financing platform for SMEs, has closed a $15 million Series A led by CreditEase FinTech Investment Fund (CEFIF), with participation from returning investors Alibaba Hong Kong Entrepreneurs Fund and MindWorks Ventures, both p…", "url": "https://techcrunch.com/2019/03/26/hong-kong-based-fintech-startup-qupital-raises-15m-series-a-to-expand-in-mainland-china/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2016/02/6325401535_de8687a23f_b.jpg?w=600", "publishedAt": "2019-03-27T04:05:29Z", "content": "                        Hong Kong-based fintech startup Qupital raises $15M Series A to expand in mainland China     Catherine Shu   @catherineshu  / 7 hours         Qupital , a fintech startup that bills itself as Hong Kong’s largest trade financing platform for SMEs, has closed a $15 million Series A led by CreditEase FinTech Investment Fund (CEFIF), with participation from returning investors Alibaba Hong Kong Entrepreneurs Fund and MindWorks Ventures, both participants in its seed round. To date, Qupital has raised $17 million, including a seed round two years ago , and will use its latest funding to expand its supply chain financing products, launch in mainland Chinese cities and hire more people for its tech development and risk management teams.  CreditEase, which provides loans and other financial services for SMEs in China, will act as a strategic investor, aiding with Qupital’s geographic expansion. Existing investor Alibaba has already helped Qupital reach small businesses on its platform. Qupital will open branches in Chinese cities including Shanghai, Hangzhou, Guangzhou and Shenzhen, along with setting up a new technology center in the Guangdong-Hong Kong-Macau Greater Bay Area for talent and tech development. In total, it will hire about 100 people for its Hong Kong office this year.  Founded in 2016, Qupital offers lending for SMEs that frequently have cash flow issues because they are in a cycle of waiting for invoices to be paid. Qupital’s loans cover most of the value of an invoice, then matches that with investors and funders who cover the cash with the expectation of a return. The company makes money by charging SMEs a service fee that is a fixed percentage of the total invoice value and then a discount fee, and taking a percentage of net gains made by investors.  Qupital has now processed 8,000 trades, totaling HKD $2 billion in value. It won’t disclose how many SMEs it has worked with, but co-founder and chairman Andy Chan says that number is in the hundreds.  Chan tells TechCrunch that in China, Qupital will not compete directly against traditional financial institutions, because it focuses on financing the Hong Kong business entities of Chinese companies in U.S. and Hong Kong currency, instead of onshore renminbi. It will also target SMEs underserved by traditional lenders, by using alternative data sources to determine their creditworthiness.  In a prepared statement, CEFIF managing director Dennis Cong said “The growing volume of SME and cross-border trading drives a huge demand for alternative financing for SME’s who are underserved in the market and opportunities for investors to earn a decent risk-adjusted return. We look forward to working with Qupital to broaden its source of capital base and create unparalleled investment opportunities for CreditEase.”                        ", "category": "technology"}