{"author": "Chelsea Whyte", "title": "All the info our brain needs for language nearly fits on a floppy disk", "description": "To learn language, we store information about word sounds, syntax and more. It turns out that all this amounts to about 1.5 megabytes of data – just over the size of a floppy disk", "url": "https://www.newscientist.com/article/2197652-all-the-info-our-brain-needs-for-language-nearly-fits-on-a-floppy-disk/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/26171836/ft6b11.jpg", "publishedAt": "2019-03-27T00:00:00Z", "content": "                                  ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            All the info our brain needs for language nearly fits on a floppy disk          Mind   27 March 2019     One bit at a time Description:Astrakan Images / Alamy By Chelsea Whyte As you learn your first language , your brain stores about 1.5 megabytes of information – just a little over the amount that would fill a floppy disk (that’s the thing used to represent the save icon , if you are too young to remember them). “I thought it would be much more,” says Frank Mollica at the University of Rochester in New York. When you hear a word you know, your brain is accessing all kinds of information to help you make sense of it: the sounds that make up the word, the meanings it has, its context in a sentence, the tense of a verb, and more.   Advertisement       Mollica and his colleagues used a branch of mathematics called information theory to figure out how many bits of data you’d need to encode all of this to lean English. These are estimates, Mollica says, but they give us a ballpark idea that can quantify how much information language acquisition requires. They started with phonemes – the distinct sounds that make up words. There are around 50 phonemes in English and each require 15 bits, so phonemes alone require about 750 bits.  Read more: Humans couldn’t pronounce ‘f’ and ‘v’ sounds before farming developed  We also need to learn to say individual words. The team found that learning the average English vocabulary size of 40,000 words requires about 400,000 bits. Understanding the meaning of those words requires yet more bits, because words contain a lot of information. “It’s lexical semantics, which is the full meaning of a word. If I say ‘turkey’ to you, there’s information you know about a turkey. You can answer whether or not it can fly, whether it can walk,” Mollica says. All that requires about 12 million bits for 40,000 words. Knowing how often certain words appear is also important during language learning, and storing this word frequency information takes about 80,000 bits. Finally, syntax – the set of rules that govern sentences – requires the least, clocking in at around 700 bits. Add that all together and you get 1.56 megabytes – slightly more than the capacity of a floppy disk. Mollica says that while these numbers only apply to English, they are broad enough estimates that they might carry over to other languages. Journal reference: Royal Society Open Science , DOI: 10.1098/rsos.181393 More on these topics: learning language    Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        All the info our brain needs for language nearly fits on a floppy disk    We've discovered a massive dinosaur-era river delta under the sea    AIs go up against animals in an epic competition to test intelligence    The US wants to send astronauts to the moon’s south pole in 2024    Smog may be getting worse in some cities thanks to Arctic warming        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        All the info our brain needs for language nearly fits on a floppy disk    We've discovered a massive dinosaur-era river delta under the sea    The US wants to send astronauts to the moon’s south pole in 2024    A third of wild bee and hoverfly species are in decline in Britain    NASA cancels first all-women spacewalk due to spacesuit size issue                        Download  Buy In Print        Advertisement                Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top               ", "category": "science"}