{"author": "Michael Marshall", "title": "We've discovered a massive dinosaur-era river delta under the sea", "description": "Some of the first dinosaurs may have lived and hunted on the largest delta plain ever discovered, which was 10 times the size of the Amazon river delta", "url": "https://www.newscientist.com/article/2197767-weve-discovered-a-massive-dinosaur-era-river-delta-under-the-sea/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/26163856/gettyimages-129381705.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                                  ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            We've discovered a massive dinosaur-era river delta under the sea          Earth   26 March 2019     The Amazon delta was a tenth the size of a recently discovered dinosaur-era delta Planet Observer/Universal Images Group via Getty Images By Michael Marshall A vast floodplain 10 times the size of the Amazon delta existed during the early days of the dinosaur era. It is the largest known delta from Earth’s history and may have been a crucial habitat. During the Triassic period when dinosaurs first appeared, all of Earth’s continents were joined together in a supercontinent called Pangaea. Part of northern Pangaea is preserved under the Barents Sea between Norway and Russia. So Tore Grane Klausen, whilst at the University of Bergen in Norway, and his colleagues took data from drilling wells in the Barents Sea and combined it with seismic data to map the rock layers.   Advertisement        Read more: Going under: The world’s sinking cities  The team found preserved sediments from a delta that existed 237 to 227 million years ago. A delta is a wide, flat plain of muddy sediment that forms when a river meets a larger water body, like a lake or ocean. The remains spanned the entire Barents Sea and were 10 times the size of largest modern deltas in the Amazon and the Ganges. This equates to 1.65 million square kilometres, or about 1 per cent of the total modern land area. The team has not named the delta, but has informally called it the Snadd Delta because they found it in rocks called the Snadd Formation. Delta plain dinosaur stomp A delta forms when rivers carry sediments downstream then dump them by the coast. The accumulated sediments form vast, fertile plains that can support huge numbers of plants and animals . The ancient delta lay on the north coast of Pangaea. It was fed by multiple rivers flowing north from a mountain range, which supplied huge volumes of sediment. In turn, intense monsoon rains formed the rivers. The animals that would have lived in the delta have not been studied in detail, but they included amphibians called labyrinthodonts that often lived in wetlands. The plant life included lots of ferns and some conifers. “Everywhere you look, you can pick up these sandstone samples with imprints of ferns,” says Klausen. Just off the coast, crocodile-like pliosaurs and dolphin-like ichthyosaurs ruled the seas. Much of the rest of Pangaea was less hospitable. The regions close to the equator spent much of the Triassic as extremely hot and dry deserts , so the delta may have been a major centre of biodiversity. The delta was also long-lived, steadily growing for periods of 2 to 5 million years at a time. This suggests sea level did not change much, in line with the established idea that the Triassic had a steady “greenhouse” climate with little or no ice at the poles. Journal reference: Geology , DOI: 10.1130/G45507.1 More on these topics: geology    Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        We've discovered a massive dinosaur-era river delta under the sea    AIs go up against animals in an epic competition to test intelligence    The US wants to send astronauts to the moon’s south pole in 2024    Smog may be getting worse in some cities thanks to Arctic warming    A third of wild bee and hoverfly species are in decline in Britain        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        We've discovered a massive dinosaur-era river delta under the sea    The US wants to send astronauts to the moon’s south pole in 2024    A third of wild bee and hoverfly species are in decline in Britain    NASA cancels first all-women spacewalk due to spacesuit size issue    The pigment in our skin could be used to make electrical body implants                        Download  Buy In Print        Advertisement                Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top               ", "category": "science"}