{"author": "Rory O’Connor", "title": "It’s not just reality TV - all media must help to prevent suicides", "description": "Coverage of high-profile deaths such as Love Island contestant Mike Thalassitis often falls short – we can and must do better, says psychologist Rory O’Connor", "url": "https://www.newscientist.com/article/2197417-its-not-just-reality-tv-all-media-must-help-to-prevent-suicides/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/22154723/hwfk7k.jpg", "publishedAt": "2019-03-22T00:00:00Z", "content": "                                  ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            It’s not just reality TV - all media must help to prevent suicides  Coverage of high-profile deaths such as Love Island contestant Mike Thalassitis often falls short – we can and must do better, says psychologist Rory O’Connor         Comment   22 March 2019     Media coverage of suicide often falls short Brian Jackson/Alamy Stock Photo By Rory O’Connor The apparent suicide last week of Mike Thalassitis, a former contestant on the UK reality TV show Love Island , has once again thrust into the spotlight what we can do to protect vulnerable individuals. Any such death is one too many. It is encouraging to see ITV, Love Island ’s broadcaster, committing itself to providing access to psychological support before, during and after contestants appear on the show. Other broadcasters and production companies must make the same commitments. I also welcome UK Health Secretary Matt Hancock’s intervention , highlighting that reality TV shows have a duty of care for contestants. As someone who has been researching suicide for more than 20 years, the stark reality is that although we have made significant advances in understanding suicide, our ability to predict it is no better than chance. In part, this is because suicide is statistically a rare event. In the UK, for example, of every 100,000 people, 10 will die by their own hand in a given year . The difficulty is in trying to identify those people, but also identify when they are suicidal. The near-impossibility of this task is why keeping people safe, and mitigating suicide risk when people are vulnerable, is vital. Complex causes This means a duty of care not just for producers of reality TV shows, but the wider news media. We know that coverage of high-profile suicides can increase the risk of suicidal behaviour. But too often, that coverage fails to highlight the complexity of the contributing factors. Suicide rarely has a single cause. It is generally the product of a complex set of circumstances , often beginning with early life trauma, later mental health problems, fear of failure and a belief that loved ones would be better off if they were dead. When reporting such deaths, this complexity should be conveyed. In the UK, the charity Samaritans maintains guidelines on how to report celebrity suicides . The message is simple: avoid speculation about causes, don’t report explicit details about suicide methods and don’t offer simplistic explanations. Do offer messages of compassion, hope and recovery. These guidelines should be adhered to. This isn’t about censorship, but about keeping people alive. Suicidal thoughts wax and wane, and despite the unbearable pain, things can and do get better. Every life matters: we must work together to ensure that we protect everyone who is vulnerable, whatever degree of fame they achieve in life. Need a listening ear?  UK Samaritans : 116123; US National Suicide Prevention Lifeline : 1 800 273 8255; hotlines in other countries. More on these topics: mental health depression     Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        Genome-editing record smashed with 13,000 edits made in one cell    NASA cancels first all-women spacewalk due to spacesuit size issue    Spiky space antenna will probe the frigid exteriors of Jupiter's moons    The pigment in our skin could be used to make electrical body implants    Global carbon emissions from energy hit a record high in 2018        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        NASA cancels first all-women spacewalk due to spacesuit size issue    The pigment in our skin could be used to make electrical body implants    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Crashed Boeing 737s lacked upgrades that could have warned pilots    Our brains may be able to make new neurons throughout adulthood           Rory O’Connor is Professor of Health Psychology and Director of the Suicidal Behaviour Research Lab at the University of Glasgow, UK              Download  Buy In Print        Advertisement                Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top               ", "category": "science"}