{"author": "Donna Lu", "title": "AIs go up against animals in an epic competition to test intelligence", "description": "AIs have some superhuman abilities, but just how clever are they overall? To find out, a new competition will adapt tests used to study animals", "url": "https://www.newscientist.com/article/2197791-ais-go-up-against-animals-in-an-epic-competition-to-test-intelligence/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/26171428/a1993r.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                                      ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            AIs go up against animals in an epic competition to test intelligence          Technology   26 March 2019     Can AIs succeed at versions of tests that African grey parrots ace? Juniors Bildarchiv GmbH/Alamy Stock Photo By Donna Lu Some artificial intelligences can perform tasks with superhuman ability, but just how clever are they overall? As smart as a honeybee? A Labrador? Or a chimp? A competition called the Animal-AI Olympics will pit AIs against tests normally used to study animal intelligence . From April, AIs will battle it out in a virtual playground for a $10,000 prize pool. All the tasks involve retrieving a piece of food, but the skills needed to succeed vary in complexity. This mimics real-life …    Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        We've discovered a massive dinosaur-era river delta under the sea    AIs go up against animals in an epic competition to test intelligence    The US wants to send astronauts to the moon’s south pole in 2024    Smog may be getting worse in some cities thanks to Arctic warming    A third of wild bee and hoverfly species are in decline in Britain        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        We've discovered a massive dinosaur-era river delta under the sea    The US wants to send astronauts to the moon’s south pole in 2024    A third of wild bee and hoverfly species are in decline in Britain    NASA cancels first all-women spacewalk due to spacesuit size issue    The pigment in our skin could be used to make electrical body implants       To continue reading this premium article, subscribe for unlimited access. Existing subscribers, please log in with your email address to link your account access. Digital Unlimited web access New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print & digital Unlimited web access Weekly print edition New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print Unlimited web access Weekly print edition SUBSCRIBE Quarterly by Direct Debit Inclusive of applicable taxes (VAT) YOU MIGHT ALSO LIKE...   Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top             ", "category": "science"}