{"author": "Yvaine Ye", "title": "Smog may be getting worse in some cities thanks to Arctic warming", "description": "Rising temperatures in the Arctic may be weakening winds in China and India, lessening air flow over major cities and exacerbating winter smogs", "url": "https://www.newscientist.com/article/2197769-smog-may-be-getting-worse-in-some-cities-thanks-to-arctic-warming/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/26162703/gettyimages-1075871206.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                                      ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            Smog may be getting worse in some cities thanks to Arctic warming          Environment   26 March 2019     VCG/VCG via Getty By Yvaine Ye  MILDER conditions in the Arctic could be weakening winds in China and India, making winter smogs worse.  Burning fossil fuels can result in severe clouds of pollution in many cities in Asia, including Beijing and Delhi. These smogs – aerosols of fine particles – are worse in winter, when more fuel is used for heating and weather patterns that can cause dirty air to linger tend to take hold.    Advertisement        Chuanfeng Zhao at Beijing Normal University in China and his colleagues wondered if rising temperatures in the Arctic …         Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        Smog may be getting worse in some cities thanks to Arctic warming    A third of wild bee and hoverfly species are in decline in Britain    Genome-editing record smashed with 13,000 edits made in one cell    NASA cancels first all-women spacewalk due to spacesuit size issue    Spiky space antenna will probe the frigid exteriors of Jupiter's moons        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        A third of wild bee and hoverfly species are in decline in Britain    NASA cancels first all-women spacewalk due to spacesuit size issue    The pigment in our skin could be used to make electrical body implants    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Crashed Boeing 737s lacked upgrades that could have warned pilots           To continue reading this premium article, subscribe for unlimited access. Existing subscribers, please log in with your email address to link your account access. Digital Unlimited web access New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print & digital Unlimited web access Weekly print edition New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print Unlimited web access Weekly print edition SUBSCRIBE Quarterly by Direct Debit Inclusive of applicable taxes (VAT)  YOU MIGHT ALSO LIKE...      Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top                        ", "category": "science"}