{"author": "Clare Wilson", "title": "One in four scientists have experienced harassment or discrimination", "description": "A survey of nearly 3700 scientists across Europe and North America suggests that harassment, bullying and discrimination are widespread", "url": "https://www.newscientist.com/article/mg24132223-400-one-in-four-scientists-have-experienced-harassment-or-discrimination/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/20111425/gettyimages-960990096.jpg", "publishedAt": "2019-03-20T00:00:00Z", "content": "                                      ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            One in four scientists have experienced harassment or discrimination  A survey of nearly 3700 scientists across Europe and North America suggests that harassment, bullying and discrimination are widespread         Life   20 March 2019     Cavan Images/Getty By Clare Wilson  A QUARTER of people working in science have experienced sexual harassment, bullying and discrimination over issues ranging from disabilities to diet.  The 2019 New Scientist/SRG Salary Survey polled nearly 3700 people across Europe and North America who worked in academia, industry and government agencies. The data revealed a gap of about £10,000 between the average salaries of male and female respondents in the UK.    Advertisement        Of the countries surveyed, discrimination and harassment seems highest in the US and Canada. Twenty nine per cent of respondents in …         Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        Spiky space antenna will probe the frigid exteriors of Jupiter's moons    The pigment in our skin could be used to make electrical body implants    Global carbon emissions from energy hit a record high in 2018    Crashed Boeing 737s lacked upgrades that could have warned pilots    Our brains may be able to make new neurons throughout adulthood        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        The pigment in our skin could be used to make electrical body implants    Crashed Boeing 737s lacked upgrades that could have warned pilots    Our brains may be able to make new neurons throughout adulthood    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Exclusive: Thousands of security flaws found on UK government websites           To continue reading this premium article, subscribe for unlimited access. Existing subscribers, please log in with your email address to link your account access. Digital Unlimited web access New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print & digital Unlimited web access Weekly print edition New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print Unlimited web access Weekly print edition SUBSCRIBE Quarterly by Direct Debit Inclusive of applicable taxes (VAT)  YOU MIGHT ALSO LIKE...      Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top                        ", "category": "science"}