{"author": "Adam Vaughan", "title": "A third of wild bee and hoverfly species are in decline in Britain", "description": "Concerns are rising about the loss of pollinators in Britain after analysis found 33 per cent of bee and hoverfly species have declined since 1980", "url": "https://www.newscientist.com/article/2197733-a-third-of-wild-bee-and-hoverfly-species-are-in-decline-in-britain/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/26134913/bombus_ruderarius_steven_falk.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                                  ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            A third of wild bee and hoverfly species are in decline in Britain          Life   26 March 2019     The geographic range of the red-shanked carder bee declined by 42 per cent between 1980 and 2013 Steven Falk By Adam Vaughan A third of wild bee and hoverfly species are in decline across Great Britain, raising concerns about biodiversity declines and the potential loss of pollinators . Analysis of 700,000 naturalist records going back to 1980 has found that about 33 per cent of 353 species studied declined in the extent of their range across the island. Losses worsened in wild bees after 2007, four years after the introduction of a group of pesticides known as neonicotinoids, which have since been almost entirely banned by the EU. The assessment found that the key group of 22 wild bees and hoverflies behind crop pollination had been doing relatively well. Overall, 11 per cent of the species studied increased their range between 1980 and 2013.   Advertisement       That is no reason for complacency though, says Gary Powney of the Centre for Ecology and Hydrology, who was involved in the work. “It’s a risky pollination strategy to rely on just 22 species.” While not immediate cause for alarm in terms of food production, the shrinking of many species’ range is a concern for a loss of richness in nature. The geographic range of the common carder bee increased by 82 per cent between 1980 and 2013 Lucy Hulmes “The widespread common species, in very broad terms, are doing okay. The rarer species are doing less well. If you only care about wildlife and biodiversity, it’s bad news. If you only care about whether your crops are being pollinated, it’s okay,” says Nick Isaac, who also worked on the research at the Centre for Ecology and Hydrology. The once widespread red-shanked carder bee ( Bombus ruderarius ) is among the losers, down 42 per cent. By contrast, the ashy mining bee ( Andrena cineraria) increased its range fivefold. Farming, habitat loss and pesticide use have all been blamed for insect losses in recent years. Key crop pollinators could be doing well because of a sevenfold increase in land given over to oilseed rape since 1980, and more strips of wildflowers in farm fields, experts say.  Read more: Honeybees let out a ‘whoop’ when they bump into each other  “If further evidence were needed, this new study confirms that declines in insects are ongoing,” says Dave Goulson at the University of Sussex, UK. Emily Bailes of Royal Holloway, University of London, says the research suggests that agricultural environment schemes are having a positive impact. However, she foresees new threats: “I see climate change as an increasing issue for pollinators in the future, alongside habitat loss from urban development.” Journal reference: Nature Communications , DOI: 10.1038/s41467-019-08974-9 More on these topics: biodiversity    Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        All the info our brain needs for language nearly fits on a floppy disk    We've discovered a massive dinosaur-era river delta under the sea    AIs go up against animals in an epic competition to test intelligence    The US wants to send astronauts to the moon’s south pole in 2024    Smog may be getting worse in some cities thanks to Arctic warming        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        All the info our brain needs for language nearly fits on a floppy disk    We've discovered a massive dinosaur-era river delta under the sea    The US wants to send astronauts to the moon’s south pole in 2024    A third of wild bee and hoverfly species are in decline in Britain    NASA cancels first all-women spacewalk due to spacesuit size issue                        Download  Buy In Print        Advertisement                Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top               ", "category": "science"}