{"author": "Michael Le Page", "title": "Genome-editing record smashed with 13,000 edits made in one cell", "description": "A team led by George Church has used CRISPR to make a record number of DNA changes in one cell, taking us a step closer to thoroughly re-writing our genomes", "url": "https://www.newscientist.com/article/2197656-genome-editing-record-smashed-with-13000-edits-made-in-one-cell/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/03/26114718/c0386360-crispr-cas9_gene_editing_complex_illustration-spl-1.jpg", "publishedAt": "2019-03-26T00:00:00Z", "content": "                                      ×       THE DAILY NEWSLETTER Sign up to our daily email newsletter        Subscribe and save          Menu   news technology space physics health environment mind video travel events jobs            Sign in         Search      Sign in Log in with facebook Log in with google Email Password Forgotten Password? Sign up for free | Educational access Sign up for more online articles A selection of top articles hand-picked by our editors available only to registered users. Get increased access now Manage your subscription Check your subscription package, update your details, renew or upgrade. Manage your subscription here Activate subscription            Genome-editing record smashed with 13,000 edits made in one cell          Health   26 March 2019     CRISPR gene editing changes the sequence of DNA CARLOS CLARIVAN/SCIENCE PHOTO LIBRARY By Michael Le Page A team has used CRISPR to make a record-breaking 13,200 changes to the DNA of a single human cell. The feat takes us a step closer to being able to thoroughly rewrite the genomes of our cells and other organisms. Half of our genomes – the complete set of DNA inside our cells – consist of hundreds of thousands of copies of genetic parasites called transposons. These transposons code for genes that copy and paste themselves from one location in the genome to …    Advertisement      Trending  Latest  Video  Free      We may finally know what causes Alzheimer’s – and how to stop it    Huge T. rex fossil suggests many dinosaurs were bigger than we thought    Dogs really can smell your fear, and then they get scared too    Schrödinger’s kittens: New thought experiment breaks quantum theory    We’ve found 4000 exoplanets but almost zero are right for life        We've discovered a massive dinosaur-era river delta under the sea    AIs go up against animals in an epic competition to test intelligence    The US wants to send astronauts to the moon’s south pole in 2024    Smog may be getting worse in some cities thanks to Arctic warming    A third of wild bee and hoverfly species are in decline in Britain        I want to believe: An astronomer's view of aliens    What do you do with the world's most powerful laser?    Anu Ojha: Will humans make it to Mars?    Geraint Lewis: What is the fate of our universe?    Emily Mitchell: Mysterious early lifeforms        We've discovered a massive dinosaur-era river delta under the sea    The US wants to send astronauts to the moon’s south pole in 2024    A third of wild bee and hoverfly species are in decline in Britain    NASA cancels first all-women spacewalk due to spacesuit size issue    The pigment in our skin could be used to make electrical body implants       To continue reading this premium article, subscribe for unlimited access. Existing subscribers, please log in with your email address to link your account access. Digital Unlimited web access New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print & digital Unlimited web access Weekly print edition New Scientist app Videos of over 100 science talks available exclusively to subscribers SUBSCRIBE Print Unlimited web access Weekly print edition SUBSCRIBE Quarterly by Direct Debit Inclusive of applicable taxes (VAT) YOU MIGHT ALSO LIKE...   Sign up to our newsletter Enter your email address to get started  Contact us Help About us Privacy & cookies Terms & conditions Advertise Write for us Events Science jobs Syndication RSS feeds Gift subscriptions Student subscriptions Educational subscriptions Corporate subscriptions   Get the app   FOLLOW US                                                   © Copyright New Scientist Ltd.   Back to top             ", "category": "science"}